[
  {
    "id": "op_service_1_purchase_materials",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Procurement Services",
    "topic": "Service 1: Purchase of Materials and Equipment",
    "content": "Under Service 1 of the Office of the EARIST President, the Purchase of Materials and Equipment requires the President's approval for items intended for Office or College use. This transaction is classified as Government to Government (G2G) and is available to Executive Officials, Faculty, and Employees. The mandatory requirements are an Endorsement Letter from the concerned Dean or Director, a Recommendation Letter from the concerned Vice President, and a photocopy of the Annual Procurement Plan (APP) reflecting the requested item. The process involves submitting documents to the Office of the President staff for propriety checking and verification against the approved APP. The total processing time is 30 minutes, and no fees are collected.",
    "keywords": ["purchase materials", "equipment", "APP", "procurement", "endorsement", "office of the president"]
  },
  {
    "id": "op_service_2_seminar_attendance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Human Resource Development",
    "topic": "Service 2: Attendance to Seminars and Conferences",
    "content": "Service 2 involves the approval of the EARIST President for attendance to seminars and conferences. This service is available to Executive Officials, Faculty, Employees, and Students (G2G and G2C transactions). The required documents include an Endorsement Letter from the Dean or Director, a Recommendation Letter from the Vice President, an Invitation with an attached Initial Request, a Certificate of Availability of Funds (CAF) from the FMS Office, and a recommendation for a substitute if applicable. The procedure includes checking for proper endorsements and the preparation of an Office Order for Staff Development. If the event requires a budget allocation, FMS Office staff are involved. The total processing time is 30 minutes.",
    "keywords": ["seminar attendance", "conference", "office order", "staff development", "substitute", "CAF"]
  },
  {
    "id": "op_service_3_budget_activities",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Financial Approvals",
    "topic": "Service 3: Budget for Activities",
    "content": "Service 3 covers the approval of the President for the conduct of seminars, extension activities, and other related events requiring a budget. This service is open to all internal and external clients (G2G and G2C). The checklist of requirements includes an Endorsement Letter from the Dean or Director, a Recommendation Letter from the Vice President, a Program of Activities from the organizer, a Certificate of Availability of Funds (CAF), and the Eligibility or Classification of Expenditure from the FMS Office. The agency action involves checking endorsements and preparing a Special Order. The total processing time for this service is 30 minutes.",
    "keywords": ["budget", "activities", "extension activity", "special order", "program of activities", "expenditure"]
  },
  {
    "id": "op_service_4_replenishment_liquidation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Financial Approvals",
    "topic": "Service 4: Replenishment, Liquidation, and Reimbursement",
    "content": "Service 4 manages the approval process for the replenishment of petty cash, liquidation of seminars attended, and reimbursement of cash advances. Available to Executive Officials, Faculty, and Employees, this G2G transaction requires the following: a Letter Request with Recommendation endorsed by the Dean/Director and Vice President, the Approved Initial Request, Official Receipts, a photocopy of the Special Order, and evidence of the conducted activity (such as an Attendance Sheet). The Staff of the Office of the President checks for endorsements and supporting documents. The entire process is designed to be completed in 30 minutes.",
    "keywords": ["replenishment", "liquidation", "reimbursement", "petty cash", "cash advance", "official receipt"]
  },
  {
    "id": "op_service_5_7_8_personnel_movements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Personnel Actions",
    "topic": "Services 5, 7, & 8: Reinstatement, Retirement, and Change of Official Time",
    "content": "The Office of the President handles various personnel movement approvals. \n\nService 5 (Reinstatement) approves the reinstatement of faculty or employees upon submission of Endorsement and Recommendation letters. \n\nService 7 (Retirement) processes retirement approvals for Executive Officials, Faculty, and Employees. Requirements include a Letter Request endorsed by the appropriate Official and an Accomplished General Clearance from the HRMS Office.\n\nService 8 (Change of Official Time) approves changes to work schedules. It requires a Letter Request endorsed by the Dean/Director and Vice President, along with a duly accomplished form. \n\nAll three services are G2G transactions with a processing time of 30 minutes each.",
    "keywords": ["reinstatement", "retirement", "change of official time", "personnel", "clearance", "HRMS"]
  },
  {
    "id": "op_service_6_vehicle_facilities",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Administrative Services",
    "topic": "Service 6: Use of Institute Vehicle and Facilities",
    "content": "Service 6 provides Presidential approval for the use of Institute vehicles and facilities. This G2G transaction is available to Executive Officials, Faculty, and Employees. To avail of this service, applicants must submit a Letter Request duly endorsed by the appropriate Official (Dean/Director and Vice President) and an accomplished/approved trip ticket from the Office of Administrative Services. The Staff of the Office of the President and Administrative Services are responsible for checking endorsements and documents. The processing time is 30 minutes.",
    "keywords": ["vehicle use", "facilities", "trip ticket", "administrative services", "endorsement"]
  },
  {
    "id": "op_service_9_tuition_refund",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Student Services",
    "topic": "Service 9: Refund of Tuition Fees",
    "content": "Service 9 allows students (External Clients) to request a Refund of Tuition Fees. This is a G2C transaction. The requirements are a Basic Request endorsed by the Dean and recommended by the Vice President (secured from the Student and SAS Office) and a photocopy of the Certificate of Registration (COR) from the SRRMS Office. The Staff of the Office of the President, FMS Office, and SAS Office collaborate to check endorsements and process the request. The turnaround time for this service is 30 minutes.",
    "keywords": ["tuition refund", "student refund", "COR", "SAS office", "fees"]
  },
  {
    "id": "op_service_10_11_12_financial_instruments",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Financial Approvals",
    "topic": "Services 10, 11, & 12: Vouchers, Payments, and Checks",
    "content": "The Office of the President approves various financial instruments. \n\nService 10 (Vouchers) requires an Approved Request Resolution, Certificate of Availability of Funds (CAF), and a Special Order or Board Resolution. \n\nService 11 (Payment of Obligation) covers gasoline, electricity, and water consumption. It requires a Letter Request endorsed by the Dean/Director and recommended by the Vice President, and a Statement of Account checked by the FMS and IAS Office. \n\nService 12 (LDDAP, Checks, ACIC) involves the signature of the President on financial documents. Requirements include an Approved Request Resolution, CAF, and Special Order. \n\nEach service takes 30 minutes to process.",
    "keywords": ["vouchers", "payment of obligation", "gasoline", "utilities", "LDDAP", "checks", "ACIC", "CAF"]
  },
  {
    "id": "op_service_13_document_clearances",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Records and Certifications",
    "topic": "Service 13: Clearances, Leave Forms, and Academic Documents",
    "content": "Service 13 involves the President's approval or signature on Clearances, Leave Forms, Class Programs, Diplomas, and Certificates. This service is available to Executive Officials, Faculty, Employees, and Students. Required signatories prior to submission include the concerned Dean or Director, the Supervisor/AS Director/HR, the Vice President for Academic Affairs (VPAA), and the Registrar (for academic documents). The Staff of the Office of the President checks for the completeness of these signatories. The total processing time is 30 minutes.",
    "keywords": ["clearance", "leave form", "diploma", "class program", "certificate", "signatories"]
  },
  {
    "id": "op_service_14_15_16_procurement_cycle",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Procurement Services",
    "topic": "Services 14, 15, & 16: Purchase Orders, Abstracts, and Awards",
    "content": "These services cover the President's approval at key stages of the procurement cycle. \n\nService 14 (Purchase Order) requires an Approved Request, CAF, Special Order, Abstract of Canvass, and BAC/Board Resolution. \n\nService 15 (Abstract of Bids) requires an Initial Request funded by FMS, a BAC Resolution with supporting documents, and Board approval of the project. \n\nService 16 (Award of Contract/Notice to Proceed) requires the BAC Resolution and Board approval. \n\nProcessing involves checking for completeness of signatories and preparing Board Resolutions (if necessary) by the Board Secretary. Each service has a processing time of 30 minutes.",
    "keywords": ["purchase order", "abstract of bids", "award of contract", "notice to proceed", "BAC resolution", "board resolution"]
  },
  {
    "id": "op_service_17_moa",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Legal and External Affairs",
    "topic": "Service 17: Memorandum of Agreement (MOA)",
    "content": "Service 17 concerns the approval and signature of the President for a Memorandum of Agreement (MOA). This service is available to Executive Officials, Faculty, Employees, and Students. Requirements include an initial request duly funded by the FMS, a BAC Resolution with supporting documents, and Board approval of the project/procurement. The Agency Action involves checking for completeness of signatories, proper endorsement by the Vice President, and the preparation of a Board Resolution by the College/Board Secretary. The total processing time is 30 minutes.",
    "keywords": ["MOA", "memorandum of agreement", "board approval", "BAC resolution", "contract"]
  }
]
