[
  {
    "id": "earist_history_founding_legal_basis",
    "source": "Student Handbook",
    "category": "Institutional History",
    "topic": "Founding and Legal Mandates",
    "content": "In the context of the History of the Institution, the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) was established after the liberation of Manila in 1945. EARIST traces its development from a Vocational High School located at the second floor of the Mapa High School, with nine teachers, a clerk, and 147 students under Principal Mr. Pantaleon Regala. The institute's former name was Eulogio Rodriguez Vocational High School (ERVHS). On July 1, 1946, EARIST acquired its present site at Nagtahan, Sampaloc, Manila. Mr. Apolinario Apilado was appointed as principal, followed by Dr. Hilario G. Nudas in 1949. The growth of EARIST was facilitated by specific legislative acts. Republic Act No. 4072 (1964) authorized the establishment of the Technical Education Department. Republic Act No. 5088 (1967) authorized the renaming of ERVHS to Eulogio 'Amang' Rodriguez Memorial School of Arts and Trades (EARMSAT) and signaled its separation from the Division of City Schools, Manila. Republic Act No. 6595 (1972) converted EARMSAT to EARIST with a President as its head, making it a full-fledged College and authorizing the establishment of branches in each Congressional District of Manila.",
    "keywords": [
      "ERVHS",
      "Republic Act 4072",
      "Republic Act 5088",
      "Republic Act 6595",
      "Nagtahan",
      "Founding",
      "EARMSAT"
    ]
  },
  {
    "id": "earist_history_cavite_campus_development",
    "source": "Student Handbook",
    "category": "Institutional History",
    "topic": "Cavite Campus (GASAT) Development",
    "content": "In the context of the EARIST Cavite Campus history, the General Alvarez School of Arts and Trades (GASAT), now known as EARIST Cavite Campus (ECC), was established through Board Resolution No. 007-82 on March 24, 1982. This resolution approved the opening of GASAT as an EARIST Branch in General Mariano Alvarez, Cavite, with funding from EARIST's budgetary allotment. Major infrastructure milestones include the acquisition of a 31,282 sq. meter lot donated by the National Housing Authority on December 29, 1983. The groundbreaking ceremony for the main building occurred on March 2, 1990, led by Dr. Lydia Macaraig Profeta. From 1989 to 1999, school building projects (Phase I-X) were completed with a total cost of PhP 42,682,197.40, funded by congressional insertions from Hon. Renato P. Dragon. Additionally, a Multi-Purpose Sports Complex Gymnasium was finished on June 14, 1999, funded by Speaker Jose C. De Venecia, Jr., and further building improvements were funded by Congressman Erineo 'Ayong' Maliksi in January 2000.",
    "keywords": [
      "Cavite Campus",
      "GASAT",
      "General Mariano Alvarez",
      "Board Resolution 007-82",
      "Renato P. Dragon",
      "Infrastructure",
      "National Housing Authority"
    ]
  },
  {
    "id": "earist_vmgo_vision_mission_goals",
    "source": "Student Handbook",
    "category": "Institutional Mandate",
    "topic": "Vision, Mission, Goals, and Objectives (VMGO)",
    "content": "The EARIST Institutional Mandate outlines the Vision, Mission, Goals, and Objectives of the university. The Vision states that EARIST is envisioned to be a center of excellence in trades, business, arts, science, and technology education. The Mission is to turn out vocationally, technically, technologically, and scientifically trained graduates who will be economically productive, self-sufficient, effective, responsible, and disciplined citizens of the Philippines. The Institutional Goal is to provide professional, scientific, technological, technical, and vocational instruction and training in trades, business, arts, sciences, and technology. This goal includes promoting research, advanced studies, and progressive leadership as specified in Section 2, RA 6595 and Section 6, PD 1524. The Objectives are to: 1) Strive for academic excellence in instruction, research, extension, and production through accreditation; 2) Provide appropriate and continuing faculty and staff development programs; 3) Provide and maintain appropriate technologies, instructional facilities, materials, and equipment; 4) Produce quality graduates who are globally competitive to man the needs of business and industry; and 5) Attain university status through unity, solidarity, and teamwork.",
    "keywords": [
      "Vision",
      "Mission",
      "Goals",
      "Objectives",
      "Center of Excellence",
      "Academic Excellence",
      "Graduates",
      "Global Competitiveness"
    ]
  },
  {
    "id": "curricular_main_cafa_ccs",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Main Campus - Architecture, Fine Arts, and Computing Science",
    "content": "Under Curricular Offerings for the Main Campus, the College of Architecture and Fine Arts (CAFA) offers the Bachelor of Science in Architecture (BS ARCHI.), Bachelor of Science in Interior Design (BSID), and Bachelor of Fine Arts (BFA). The BFA program includes majors in Painting and Visual Communication. The College of Computing Science (CCS) offers the Bachelor of Science in Computer Science and the Bachelor of Science in Information Technology.",
    "keywords": [
      "CAFA",
      "CCS",
      "BS ARCHI",
      "BSID",
      "BFA",
      "Computer Science",
      "Information Technology"
    ]
  },
  {
    "id": "curricular_main_cas_cbpa",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Main Campus - Arts, Sciences, Business, and Public Admin",
    "content": "Under Curricular Offerings for the Main Campus, the College of Arts and Sciences (CAS) offers the Bachelor of Science in Applied Physics with Computer Science Emphasis (BSAP), Bachelor of Science in Psychology (BSPSYCH), and Bachelor of Science in Mathematics (BSMATH). The College of Business and Public Administration (CBPA) offers the Bachelor of Science in Office Administration (BSOA), Bachelor of Science in Entrepreneurship (BSEntrep), and Bachelor in Public Administration (BPA). Additionally, the CBPA offers the Bachelor of Science in Business Administration with majors in Human Resource Management and Marketing Management.",
    "keywords": [
      "CAS",
      "CBPA",
      "BSAP",
      "BSPSYCH",
      "BSMATH",
      "BSOA",
      "BSEntrep",
      "BPA",
      "HRM",
      "Marketing"
    ]
  },
  {
    "id": "curricular_main_ced",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Main Campus - College of Education",
    "content": "Under Curricular Offerings for the Main Campus, the College of Education (CED) provides several teacher education programs. The Bachelor in Secondary Education (BSE) includes majors in Filipino, Mathematics, and Science. The Bachelor of Technology and Livelihood Education (BTLEd) includes majors in Home Economics and Industrial Arts. The college also offers the Bachelor of Special Needs Education (BSNEd) and a Professional Education / Subjects (TCP) program consisting of 18 units for non-education graduates.",
    "keywords": [
      "CED",
      "BSE",
      "BTLEd",
      "BSNEd",
      "TCP",
      "Home Economics",
      "Secondary Education"
    ]
  },
  {
    "id": "curricular_main_cen",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Main Campus - College of Engineering",
    "content": "Under Curricular Offerings for the Main Campus, the College of Engineering (CEN) offers a variety of technical degrees. These include the Bachelor of Science in Chemical Engineering (BSChE), Bachelor of Science in Civil Engineering (BSCE), Bachelor of Science in Electrical Engineering (BSEE), Bachelor of Science in Electronics and Communication Engineering (BSECE), Bachelor of Science in Mechanical Engineering (BSME), and Bachelor of Science in Computer Engineering (BSCoE).",
    "keywords": [
      "CEN",
      "Engineering",
      "BSChE",
      "BSCE",
      "BSEE",
      "BSECE",
      "BSME",
      "BSCoE"
    ]
  },
  {
    "id": "curricular_main_chtm_cit_ccje",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Main Campus - Hospitality, Industrial Tech, and Criminology",
    "content": "Under Curricular Offerings for the Main Campus, three colleges provide specialized vocational and professional degrees. The College of Hospitality and Tourism Management (CHTM) offers the Bachelor of Science in Tourism Management (BST) and Bachelor of Science in Hospitality Management (BSHM). The College of Criminal Justice Education offers the Bachelor of Science in Criminology (BSCrim). The College of Industrial Technology (CIT) offers the Bachelor of Science in Industrial Technology (BSIT) with majors in Automotive Technology, Electrical Technology, Electronics Technology, Food Technology, Fashion Apparel Technology, Industrial Chemistry, Drafting Technology, Machine Shop Technology, and Refrigeration and Air-conditioning.",
    "keywords": [
      "CHTM",
      "CIT",
      "CCJE",
      "BSIT",
      "BSCrim",
      "Tourism",
      "Automotive",
      "Drafting"
    ]
  },
  {
    "id": "curricular_main_grad_school",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Main Campus - Graduate School Programs",
    "content": "Under Curricular Offerings for the Main Campus, the Graduate School provides Master's and Doctoral degrees. Master's programs include Master of Science in Mathematics, Master of Arts in Industrial Psychology, Master in Business Administration (MBA), and Master in Public Administration (MPA). The Master of Arts in Industrial Education offers a major in Hotel Management. The Master of Arts in Education includes majors in Administration and Supervision, Guidance & Counseling, and Special Education. The Master of Arts in Teaching includes majors in Electronics Technology, Mathematics, and Science. Doctoral offerings include Doctor of Philosophy in Industrial Psychology, Doctor of Education in Educational Management, Doctor in Business Administration, and Doctor in Public Administration.",
    "keywords": [
      "Graduate School",
      "MBA",
      "MPA",
      "Doctorate",
      "PhD",
      "EdD",
      "Masters"
    ]
  },
  {
    "id": "curricular_cavite_campus",
    "source": "Student Handbook",
    "category": "Curricular Offerings",
    "topic": "Cavite Campus - All Programs",
    "content": "Under Curricular Offerings for the EARIST-Cavite Campus, the institution provides Graduate, Post-Baccalaureate, and Undergraduate programs. The Graduate Program offers the Doctor in Education (Major in Educational Management), Master of Arts in Education (Major in Administration and Supervision), and Master in Business Administration. The Post Baccalaureate Program offers Professional Education Subjects (18 units). The Undergraduate Program includes Bachelor of Science degrees in Computer Science, Computer Technology, Criminology, Hospitality Management, Office Administration, and Industrial Psychology. It also offers the Bachelor of Science in Business Administration (Major in Marketing Management) and Bachelor of Technology and Livelihood Education. The Bachelor of Science in Industrial Technology is available with majors in Automotive, Electrical, Electronics, Food Technology, and Drafting Technology.",
    "keywords": [
      "Cavite Campus",
      "GASAT",
      "Cavite Graduate School",
      "Cavite Undergraduate",
      "Cavite Industrial Technology"
    ]
  },
  {
    "id": "admission_policy_eligibility_criteria",
    "source": "Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "General Policy and Eligibility",
    "content": "Under Article I, the General Admission Policy states that admission of all students is primarily based on academic preparedness, including entrance examination results, personal interviews, academic records, and character evaluation. Students must be willing to abide by the rules and ideals of the Institute. The admission of freshmen and transferees operates on a first-come-first-served basis, subject to available resources such as rooms and faculty. Regarding eligibility, Freshmen applicants must be Grade 12 graduates (CMO No. 105, s. 2017) or Senior High School Alternative Learning System (ALS) Accreditation and Equivalency passers. Transferees are eligible if they preferably have no grades of 'Dropped', 'Incomplete', or 'Failed', subject to slot availability in the chosen program. Foreign students are eligible if they graduated from high schools abroad and have not yet enrolled in international Higher Education Institutions (HEIs).",
    "keywords": [
      "Eligibility",
      "Grade 12",
      "ALS",
      "Transferee",
      "First-come-first-served",
      "CMO No. 105"
    ]
  },
  {
    "id": "admission_requirements_local",
    "source": "Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Requirements for Freshmen and Transferees",
    "content": "Under Article I, Section A outlines the specific documentary requirements for local applicants. Freshmen must submit: 1) Form 138 (Senior High School Report Card); 2) Certificate of Good Moral Character with the school seal; 3) PSA Authenticated Birth Certificate; 4) EARISTCAT Result; 5) Satisfactory Result of Dean's Assessment and Evaluation; and 6) Medical and Health Examination results. Transferees must submit: 1) Transcript of Records or Certification of Grades; 2) Certification of Good Moral Character; 3) Satisfactory Result of Dean's Assessment and Evaluation; 4) Recommendation from the Dean or Guidance Counselor of the previous school; 5) Transfer Credential or Honorable Dismissal; 6) EARISTCAT result; and 7) Medical and Health Examination results.",
    "keywords": [
      "Form 138",
      "PSA Birth Certificate",
      "Good Moral",
      "Transcript of Records",
      "Honorable Dismissal",
      "Medical Exam"
    ]
  },
  {
    "id": "admission_requirements_foreign",
    "source": "Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Requirements for Foreign Students",
    "content": "Under Article I, foreign students who graduated from high schools abroad and have not enrolled in international HEIs must submit specific legal and academic documents. These requirements include: 1) A notarized affidavit of support and proof of adequate financial support; 2) Equivalent High School Diploma; 3) Certificate of Good Moral Character; 4) Authenticated Birth Certificate; 5) Medical Examination Certificate from the Institute or a Government Physician; 6) Original or certified copy of Birth Certificate; 7) Certified copy of Alien Certificate of Registration (ACR); 8) Study Permit from the Commission on Higher Education (CHED); 9) Authenticated copy of Student Visa and Passport; and 10) Two copies of a 1½ x 1½ picture with a name tag.",
    "keywords": [
      "Foreign Students",
      "Affidavit of Support",
      "Alien Certificate of Registration",
      "ACR",
      "Student Visa",
      "Study Permit",
      "CHED"
    ]
  },
  {
    "id": "admission_screening_level_1_earistcat",
    "source": "Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Screening Level 1: EARISTCAT",
    "content": "Under Article I, the Screening Process involves three levels, with Level 1 being the EARIST College Admission Test (EARISTCAT). The transmutation formula for calculating the EARISTCAT rating is: EARISTCAT Rating = (Total Score multiplied by 50, divided by the Number of Items) + 50. Regarding administration and processing: EARISTCAT applications are processed at the office of the Student Admission, Registration and Records Management Services (SARRMS). The test itself is administered by the Guidance and Counselling Office of the Student Affairs Services (SAS) in coordination with the Management Information System and Technology Services (MISTS).",
    "keywords": [
      "EARISTCAT",
      "Transmutation Formula",
      "SARRMS",
      "MISTS",
      "Guidance Office",
      "Entrance Exam"
    ]
  },
  {
    "id": "admission_screening_level_2_interview",
    "source": "Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Screening Level 2: Interview and Special Tests",
    "content": "Under Article I, Screening Level 2 consists of the College Admission Interview. This step is intended to assess the student as a candidate. The interviewer, typically the chairperson or a faculty member of the program, evaluates the student's leadership potential, determination, perseverance, career choice, and communication skills. For applicants to the College of Architecture and Fine Arts (CAFA), a Drawing Ability Test (DAT) is conducted as an additional part of this screening level. Each college has the prerogative to define its own mechanism and evaluation rubric for the interview. The evaluation rendered by the interviewer is considered final and unappeasable.",
    "keywords": [
      "Interview",
      "Drawing Ability Test",
      "DAT",
      "CAFA",
      "Evaluation Rubric",
      "Leadership Potential"
    ]
  },
  {
    "id": "art_1_admission_principles_qualifications",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "General Admission Principles and Qualifications",
    "content": "Under Article I Admission Policy, the admission of all students to EARIST is primarily based on academic preparedness. This includes the results of entrance examinations, personal interviews, academic records, character evaluation, the individual student's ability to benefit from academic programs, and their willingness to abide by the Institute's rules and ideals. Admission for freshmen and transferees operates on a first-come-first-served basis, contingent upon available resources such as rooms and faculty.\n\nRegarding Admission Qualifications for Local Students, EARIST accepts the following groups: Freshmen, including all Grade 12 graduates pursuant to CMO No. 105, s. 2017, and Senior High School Alternative Learning System (ALS) Accreditation and Equivalency passers. Transferees are eligible for admission preferably if they have no grades of 'Dropped', 'Incomplete', or 'Failed', subject to slot availability in the chosen program. Foreign students who graduated from high schools abroad and have not enrolled in international Higher Education Institutions (HEIs) are also eligible under CHED CMO internalization policies.",
    "keywords": [
      "admission criteria",
      "first-come-first-served",
      "Grade 12 graduates",
      "ALS passers",
      "transferee qualifications",
      "CMO No. 105"
    ]
  },
  {
    "id": "art_1_document_requirements_local",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Document Requirements for Local Students",
    "content": "Under Article I Admission Policy, Section A outlines the specific documentary requirements for admission. Freshmen must submit: Form 138 (Senior and High School Report Card), a Certificate of Good Moral Character with the school seal, a PSA Authenticated Birth Certificate, the EARISTCAT Result, a Satisfactory Result from the Dean's Assessment and Evaluation, and a Medical and Health Examination result.\n\nTransferees are required to submit: a Transcript of Records or Certification of Grades, a Certification of Good Moral Character, a Satisfactory Result from the Dean's Assessment and Evaluation, a Recommendation from the Dean or Guidance Counselor of the previous school, Transfer Credentials or Honorable Dismissal, the EARISTCAT result, and a Medical and Health Examination result.",
    "keywords": [
      "Form 138",
      "PSA Birth Certificate",
      "Good Moral Character",
      "Transcript of Records",
      "Honorable Dismissal",
      "Medical Examination",
      "freshmen requirements",
      "transferee requirements"
    ]
  },
  {
    "id": "art_1_document_requirements_foreign",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Document Requirements for Foreign Students",
    "content": "Under Article I Admission Policy, foreign students who graduated from high schools abroad and have not enrolled in international Higher Education Institutions (HEIs) must submit specific documents for admission. These requirements include: a notarized affidavit of support and proof of adequate financial support, an equivalent High School Diploma, a Certificate of Good Moral Character, and an authenticated Birth Certificate (original or certified copy). Additionally, they must provide a Medical Examination Certificate from the Institute or a Government Physician, a certified copy of the Alien Certificate of Registration (ACR), a Study Permit from the Commission on Higher Education (CHED), an authenticated copy of their Student Visa and Passport, and two copies of a 1 ½ x 1 ½ picture with a name tag.",
    "keywords": [
      "foreign students",
      "affidavit of support",
      "Alien Certificate of Registration",
      "ACR",
      "Study Permit",
      "CHED",
      "Student Visa"
    ]
  },
  {
    "id": "art_1_screening_process_level_1_2",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Screening Levels 1 and 2 (EARISTCAT and Interview)",
    "content": "Under Article I Admission Policy, the screening process consists of three levels. Screening Level 1 is the EARIST College Admission Test (EARISTCAT). The transmutation formula for EARISTCAT scores is: EARISTCAT Rating equals ((Total Score multiplied by 50) divided by the Number of Items) plus 50. Applications for the test are processed by the Student Admission, Registration and Records Management Services (SARRMS), while the test is administered by the Guidance and Counselling Office of the Student Affairs Services (SAS) in coordination with the Management Information System and Technology Services (MISTS).\n\nScreening Level 2 is the College Admission Interview. This interview assesses the student's leadership potential, determination, perseverance, career choice, and communication skills. The interviewer is the chairperson or a faculty member of the program applied for. For Architecture and Fine Arts applicants, a Drawing Ability Test (DAT) is included in this level. Each college determines its own evaluation rubric, and the interviewer's evaluation is final and unappealable.",
    "keywords": [
      "EARISTCAT formula",
      "SARRMS",
      "Guidance and Counselling Office",
      "College Admission Interview",
      "Drawing Ability Test",
      "DAT"
    ]
  },
  {
    "id": "art_1_screening_process_level_3_ppt",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Screening Level 3: Program Preparedness Test (PPT)",
    "content": "Under Article I Admission Policy, Screening Level 3 involves the Program Preparedness Test (PPT). These are placement examinations designed to assess student competency in specific skills or disciplines required for technical programs. The programs requiring the PPT include: BS Architecture, BS Applied Physics, BS Mathematics, BS Computer Science, BS Information Technology, BS Psychology, BS Civil Engineering, BS Chemical Engineering, BS Computer Engineering, BS Electronics and Communications Engineering, BS Electrical Engineering, and BS Mechanical Engineering.\n\nStudents who score lower than the pre-determined cut-off score in the PPT may be conditionally admitted. To remain in the program, conditionally admitted students must undergo an Enhancement Program, which requires enrolling in and passing one to two enhancement courses during their first year. Students who fail to meet the score requirements of their first-choice program are advised to apply for admission to their second-choice program.",
    "keywords": [
      "Program Preparedness Test",
      "PPT",
      "conditional admission",
      "Enhancement Program",
      "placement examination",
      "BS Architecture",
      "BS Civil Engineering",
      "Engineering admission"
    ]
  },
  {
    "id": "art_1_admission_matrix_scores",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Admission and Readmission Score Matrix",
    "content": "Under Article I Admission Policy, admission and readmission decisions are based on specific percentage thresholds per college and program.\n\nFor the College of Fine Arts (C/FA): BS Architecture requires 80.00% for admission (Readmission < 75.00%). BS Industrial Design (BSID) requires 70.00% (Readmission < 50.00%).\n\nFor the College of Arts and Sciences (CAS): BS Applied Physics (BSAP) requires 60.00% (Readmission < 50.00%). BS Computer Science (BSCS) requires 75.00% (Readmission < 70.00%). BS InfoTech requires 77.00% (Readmission < 23.00%).\n\nFor the College of Business Administration (CBA): BSOA requires 55.00% for admission (Readmission < 50.60%).\n\nFor the College of Education (CED): BS Education requires 80.00% for admission (Readmission < 50.00%).\n\nFor the College of Engineering (CEN): BS Civil Engineering (BSCE) requires 85.00% for admission (Readmission < 70.00%). BS Mechanical Engineering (BSME) requires 70.00% (Readmission < 50.00%).\n\nFor the College of Hospitality Management (CHM): BST requires 75.00% for admission (Readmission < 65.00%).",
    "keywords": [
      "admission scores",
      "readmission scores",
      "CEN",
      "CAS",
      "CED",
      "CBA",
      "C/FA",
      "cut-off scores"
    ]
  },
  {
    "id": "art_1_ppt_criteria_enhancement_courses",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "PPT Criteria and Enhancement Courses",
    "content": "Under Article I Admission Policy, conditionally admitted students must take specific enhancement courses based on their Program Preparedness Test (PPT) scores.\n\nFor BS Architecture (C/FA), the PPT covers Mathematics with a 60% cut-off. Conditional students must take REMMCRTA (5 units, 5 hours).\n\nFor BS Applied Physics (CAS), the PPT covers Critical Thinking with a 60% cut-off. Conditional students must take REMMCRIC (3 units, 3 hours).\n\nFor BS Computer Science (CAS), the PPT covers Moral Philosophy (no specific cut-off listed). Conditional students must take REMMCOPHI (3 units, 3 hours).\n\nFor BS Civil Engineering (CEN), the PPT covers Mathematics for College Readiness 1 with a 70% cut-off. Conditional students must take REMMCRTA (5 units, 5 hours).\n\nFor BS Mechanical Engineering (CEN), the PPT covers Mathematics for College Readiness 2. Conditional students must take REMMCRSA (5 units, 5 hours).\n\nFor all CBA Courses, the PPT covers Accounting with a 60% cut-off. Conditional students must take GENACONT (3 units, 3 hours).",
    "keywords": [
      "REMMCRTA",
      "REMMCRIC",
      "REMMCOPHI",
      "GENACONT",
      "REMMCRSA",
      "enhancement courses",
      "conditional admission subjects"
    ]
  },
  {
    "id": "art_1_misc_transferees_pledge_readmission",
    "source": "EARIST Student Handbook",
    "category": "Article I - Admission Policy",
    "topic": "Transferee Credits, Non-Discrimination, Pledge, and Re-admission",
    "content": "Under Article I Admission Policy, several miscellaneous provisions apply. Regarding non-discrimination, an applicant meeting minimum requirements cannot be deferred due to handicap, disability (RA 7277; RA 9442), or being part of Indigenous Cultural Communities (RA 8371).\n\nRegarding Transferee Credits: Courses from a student's previous school may be credited upon submission of the Official Transcript of Records and evaluation by the Department Chairperson and Registrar. Transferees using the old curriculum do not need the Bridging Program. Those on the new curriculum must pass additional general education subjects in the Bridging Program for Lifelong Learners.\n\nRegarding the Student Pledge: Every student must sign a pledge and data privacy waiver. Violation is cause for denial of admission or dismissal.\n\nRegarding Re-admission: Students returning from a leave of absence need a Copy of the Approved Leave of Absence, an Evaluation Record Form from the Registrar, and an Admission Recommendation from the College Dean.",
    "keywords": [
      "RA 7277",
      "RA 9442",
      "RA 8371",
      "credit evaluation",
      "Bridging Program",
      "student pledge",
      "re-admission requirements",
      "leave of absence"
    ]
  },
  {
    "id": "art_2_sec_1_registration_procedures",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 1: Registration Procedure",
    "content": "Under Article II Academic Policies, Section 1, a student must be officially registered to receive credit for course work. The standard registration procedure for new students involves the following steps: issuance of the Notice of Admission from the Office of the Dean or Campus Administrator; submission of original requirements to the Registrar's Office; pre-enrollment and issuance of a Student Number; validation of fees at the Financial Management Services Office; payment at the Cashier's Office (for paying or opt-out students); and validation of the Certificate of Registration by the Registrar's Office. The registration certificate is considered valid once the 'Copy for Student' portion is signed by the student, stamped 'ENROLLED', and initialed by the enrollment officer.\n\nRegistration deadlines are strictly enforced. No student may register later than the date specified in the school calendar unless there are reasonable circumstances determined by the Dean and recommended to the Vice President for Academic Affairs. However, late registration cannot exceed two weeks from the first day of regular classes. Additionally, students cannot enroll in more than one college to earn multiple degrees simultaneously. A student must appear on the Official Class List issued by the Registrar to attend classes; otherwise, the Certificate of Registration serves as temporary proof prior to the final list.",
    "keywords": [
      "registration steps",
      "late enrollment",
      "Notice of Admission",
      "Official Class List",
      "enrollment deadline"
    ]
  },
  {
    "id": "art_2_sec_1_cross_enrollment_second_degree",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 1: Cross-Enrollment and Second Degrees",
    "content": "Under Article II Academic Policies, Section 1, cross-enrollment is permitted only upon favorable endorsement by the Dean or Campus Administrator and recommendation to the Registrar. A student may cross-enroll in another school if the course is not offered at EARIST and the total cross-enrolled load does not exceed six (6) units. The Registrar's Office prepares the cross-enrollment form and must receive a copy of the approved request. Conversely, cross-enrollees from other institutions entering EARIST require written permission from their originating school's Registrar, stating the total units and course descriptions authorized.\n\nRegarding second degrees, the Institute explicitly states that it does not accept applications for a second baccalaureate degree.",
    "keywords": [
      "cross-enrollment",
      "second degree policy",
      "external credits",
      "permit to study",
      "maximum units"
    ]
  },
  {
    "id": "art_2_sec_2_academic_load_overload",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 2: Academic Load and Overload",
    "content": "Under Article II Academic Policies, Section 2, students must carry the regular load prescribed in their curricular program every semester. Students are not allowed to carry less than half of the regular load unless they have academic deficiencies, are graduating, or the required courses are unavailable. The maximum academic units for undergraduate students correspond to the program checklist.\n\nOverloading is permitted under specific conditions: the overload must not exceed six (6) units above the regular load; the courses must be back subjects (previously failed or missed) or courses without pre-requisites; and the overload must be recommended by the Dean and approved by the Vice President for Academic Affairs. Additionally, students cannot take additional units if they conflict with training schedules. For intersession classes, the regular load is six (6) units, but a student may enroll in an additional three (3) units if the subjects are back courses or have no pre-requisites.",
    "keywords": [
      "academic load",
      "overload rules",
      "intersession load",
      "back subjects",
      "maximum units"
    ]
  },
  {
    "id": "art_2_sec_3_change_substitute_drop",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 3: Changing, Substituting, and Dropping Courses",
    "content": "Under Article II Academic Policies, Section 3, students may apply for a change of class (subject or schedule) using the College Advisement Slip due to schedule conflicts, dissolved subjects, or inadvertent enrollment errors. Substitution of courses is authorized if a curriculum is superseded by a new one (though students may opt to follow their original curriculum) or if a required course is not offered. Substitution requires that the proposed course aligns with the substituted course in content and unit weight (same or higher), involves courses within the same department where possible, and is approved by the Program Chairperson, Dean, Registrar, and Vice President for Academic Affairs. Substitution is not allowed for major courses the student has failed unless the substitute is substantially similar in scope.\n\nTo drop a course, a student must fill out SARRMS Form No. 007 and secure endorsements from the Dean and approval from the Vice President for Academic Affairs. All forms for substitution, adding, changing, or dropping must be submitted during the adjustment period prescribed in the school calendar.",
    "keywords": [
      "dropping subjects",
      "substitution rules",
      "SARRMS Form No. 007",
      "curriculum revision",
      "changing classes"
    ]
  },
  {
    "id": "art_2_sec_4_classification_status_load",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 4: Classification by Admission Status and Load",
    "content": "Under Article II Academic Policies, Section 4, students are classified by admission status and academic load.\n\n**By Admission Status:**\n* **Beginning Freshmen:** Admitted via EARIST-CAT with no prior college enrollment.\n* **Returning Students (Returnees):** Readmitted based on slot availability and Dean's evaluation of previous performance.\n* **Shifting Students (Shifters):** Those changing programs within EARIST. Shifting within the same college requires a letter to the Dean. Shifting to a different college requires a letter to the new Dean, a recommendation from the current Dean, and a Clearance of good moral standing and no obligations. Shifters must meet grade requirements and slot availability.\n* **Transferring Students (Transferees):** Students from EARIST Cavite or other schools. Admission depends on slots and requirements. Credits are evaluated by the Department Chairperson and Registrar using Form SARRMS C 1.\n\n**By Academic Load:**\n* **Regular Student:** Carries the full load required for the semester.\n* **Irregular Student:** Carries less than the full load.\n* **Special Student:** Enrolled in the Special Opportunity Program or not earning formal credits.",
    "keywords": [
      "freshmen",
      "returnees",
      "shifters",
      "transferees",
      "regular student",
      "irregular student",
      "special student"
    ]
  },
  {
    "id": "art_2_sec_4_classification_year_pwd",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 4: Classification by Year Level and Special Needs",
    "content": "Under Article II Academic Policies, Section 4, students are classified by year level based on curriculum completion:\n* **Freshman:** First year or has finished less than 25% of total units.\n* **Sophomore:** Second year or has finished 25% to <50% of total units.\n* **Junior:** Third year or has finished 50% to <75% of total units.\n* **Senior:** Fourth year or has finished 75% or more of total units.\n* **Fifth Year:** In Engineering, Architecture, and Fine Arts, a student is a senior if they have completed at least 80% of requirements.\n\nRegarding Persons with Disabilities (PWDs) and Special Needs, EARIST mandates modified facilities per CHED Memo 30 s. 2009. This includes sensory materials and Braille for the visually impaired; hearing aids and speech kits for the hearing impaired; and compliance with the Accessibility Law (Batas Pambansa Bilang 344) for orthopedic handicaps, including adjustable desks. Instructional devices are also provided for learners with behavioral problems, autism, or learning disabilities.",
    "keywords": [
      "year level",
      "sophomore",
      "junior",
      "senior",
      "PWD facilities",
      "Batas Pambansa Bilang 344",
      "special needs"
    ]
  },
  {
    "id": "art_2_sec_5_attendance_policy",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 5: Attendance and Tardiness",
    "content": "Under Article II Academic Policies, Section 5, students must attend all classes from the first meeting. Non-attendance constitutes an absence. A student is considered absent if they are not present within the first 1/6 fraction of the scheduled class time. Specifically, a student is absent if they arrive after: 30 minutes for a 3-hour class; 20 minutes for a 2-hour class; 15 minutes for a 1.5-hour class; or 10 minutes for a 1-hour class.\n\nA student is considered late/tardy if they arrive within that first 1/6 fraction. Three incidences of tardiness equal one absence. Excused absences require an excuse slip from the College Dean or a medical certificate verified by the Institute Medical Office. Three successive unexcused absences result in a report to the Prefect of Discipline. Crucially, a student absent for more than 20% of the scheduled hours in a subject for the semester shall be automatically dropped from the class roll.",
    "keywords": [
      "attendance rules",
      "tardiness",
      "excessive absences",
      "dropped due to absence",
      "medical certificate",
      "20 percent rule"
    ]
  },
  {
    "id": "art_2_sec_6_grading_system",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 6: Grading System and Definitions",
    "content": "Under Article II Academic Policies, Section 6, the academic performance of students is graded using the following numerical system:\n* **1.00:** 97-100% (Highly Excellent)\n* **1.25:** 94-96% (Excellent)\n* **1.50:** 91-93% (Very Superior)\n* **1.75:** 88-90% (Superior)\n* **2.00:** 85-87% (Very Good)\n* **2.25:** 82-84% (Good)\n* **2.50:** 79-81% (Satisfactory)\n* **2.75:** 76-78% (Fair)\n* **3.00:** 75% (Passed)\n* **5.00:** Below 75% (Failed)\n* **INC:** Incomplete\n* **DRP:** Dropped Officially/Unofficially\n* **NC:** No Credit\n\nOnly the assigned faculty member can issue grades unless they are no longer connected with the Institute, in which case the Area Chairperson assumes responsibility. A student who passes a course cannot retake an examination to improve their grade.",
    "keywords": [
      "grading scale",
      "passing grade",
      "failing grade",
      "INC",
      "DRP",
      "numerical grades"
    ]
  },
  {
    "id": "art_2_sec_6_incomplete_change_grades",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 6: Incomplete Grades and Rectification",
    "content": "Under Article II Academic Policies, Section 6, an \"INC\" (Incomplete) is a temporary grade given when valid reasons prevent course completion. It must be completed using SARRMS Form No. 006 within the next two semesters; otherwise, it automatically becomes a \"5.0\" (Failed). Completion is free of charge. If the faculty member is unavailable (retired, resigned, unresponsive, deceased), the Area Chairperson may act on the INC with the Dean's approval.\n\n\"Dropped\" status applies when a student voluntarily withdraws at least two weeks before the mid-term exam or exceeds allowable absences. \"No Credit\" (NC) is reserved for OJT, Thesis, or Special Students.\n\n**Rectification of Grades:** Faculty can amend grades without a petition within 5 days of the posting deadline. Beyond this (6-10 days), they must file a Petition Form for Rectification with an affidavit, class record, and report of grades. This requires approval from the Department Head, Dean, VP for Academic Affairs, and President. Petitions filed after 10 days are handled by the Committee on Rectification of Grades.",
    "keywords": [
      "removal of incomplete",
      "INC expiration",
      "change of grade",
      "rectification period",
      "Committee on Rectification"
    ]
  },
  {
    "id": "art_2_sec_7_11_retention_probation",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 7 & 11: Retention, Probation, and Dismissal",
    "content": "Under Article II Academic Policies, Sections 7 and 11 outline retention and scholastic delinquency rules. Students failing or withdrawing from the same course three times will be dropped from the roll. \"Incomplete\" grades are not computed for delinquency unless replaced by a final grade.\n\n**Probation Rules:**\n* **Freshmen:** Incurring failures in 3 or more courses (or 50% of load) in the first semester results in probation for the second semester with a restricted load.\n* **Old Students:** Failing 3 or more courses or withdrawing from 5 courses results in non-readmission for the succeeding semester. Fails in one subject result in a warning and load reduction.\n* **Probation Limits:** A student can only be on probation twice. Failure to lift the second probation renders the student ineligible to enroll. \n\n**Dismissal Triggers:**\n* Any student obtaining a \"5.00\" in 40%-75% of their total units is dropped from the College.\n* Any student obtaining a \"5.00\" in more than 75% of their total units is permanently disqualified from the Institute.\n* Students on probation who fail 50% or more of their units are dropped from the Institute.",
    "keywords": [
      "scholastic delinquency",
      "probation rules",
      "dismissal policy",
      "maximum failures",
      "warning status"
    ]
  },
  {
    "id": "art_2_sec_8_tenure_loa_honorable_dismissal",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 8: Tenure, Leave of Absence, and Honorable Dismissal",
    "content": "Under Article II Academic Policies, Section 8, tenure and leave policies are defined. Regular students must finish their program within the prescribed years, with a grace period of one year (two semesters). Athletic Scholars have 5 years for a 4-year degree (or 6 for a 5-year degree) plus a one-year grace period. Working students are allowed 1.5 times the normal residency period. Approved Leave of Absence (LOA) is not counted against tenure, but unofficial LOA is.\n\n**Leave of Absence (LOA):** Students must apply for LOA if temporarily separating for non-academic reasons. They must be in good standing and cannot enroll elsewhere. LOA generally does not exceed one academic year but may extend to two years with approval. Absences beyond two years result in loss of residency status.\n\n**Honorable Dismissal:** This is issued to students voluntarily withdrawing to transfer schools. It requires clearance from all accountabilities. Students issued an Honorable Dismissal cannot be readmitted to EARIST.",
    "keywords": [
      "maximum residency",
      "tenure",
      "Leave of Absence",
      "LOA",
      "Honorable Dismissal",
      "working student tenure"
    ]
  },
  {
    "id": "art_2_sec_9_10_graduation_honors",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 9 & 10: Graduation Requirements and Honors",
    "content": "Under Article II Academic Policies, Sections 9 and 10, graduation requires satisfying all academic requirements and filing an application with the Registrar. Transfer students must earn more than 50% of their academic units at EARIST to graduate. Diplomas are withheld until all accountabilities are cleared.\n\n**Graduation with Honors:**\nLatin Honors are awarded based on cumulative Grade Point Average (GPA) including PE and NSTP:\n* **Summa cum Laude:** 1.0000 to 1.2500\n* **Magna cum Laude:** 1.2501 to 1.5000\n* **Cum Laude:** 1.5001 to 1.7500\n\nTo qualify for honors, a candidate must: complete the program within the prescribed years (no extensions); have completed at least 75% of units at the Institute; have been in residence for the last three years; have **no final grade lower than 2.25** in any course (academic or non-academic) taken at EARIST or elsewhere; have **no grades of Incomplete, Dropped, or 5.0**; and have never repeated a course.",
    "keywords": [
      "graduation requirements",
      "Summa cum Laude",
      "Magna cum Laude",
      "Cum Laude",
      "latin honors criteria",
      "residency rule"
    ]
  },
  {
    "id": "art_2_sec_12_13_ojt_lms",
    "source": "EARIST Student Handbook",
    "category": "Article II - Academic Policies",
    "topic": "Section 12 & 13: OJT and Learning Management System",
    "content": "Under Article II Academic Policies, Section 12, students undergoing On-the-Job Training (OJT), Practicum, or Internship must enroll in the equivalent course, be in good academic standing, complete all prerequisites, and be certified physically and mentally fit by the school physician. Students with additional academic subjects (major/minor) cannot train outside the school unless the schedule does not conflict with training hours. In-house training is allowed for those with enrolled subjects. Ladderized programs with OJT follow college requirements.\n\nUnder Section 13, per Board Resolution No. 352-2020, faculty members are mandated to utilize flexible, blended, and alternative teaching approaches. This includes connecting with students through both Online Delivery and Offline Delivery methods.",
    "keywords": [
      "OJT requirements",
      "practicum",
      "internship",
      "flexible learning",
      "online delivery",
      "Board Resolution No. 352-2020"
    ]
  },
  {
    "id": "art_3_sec_1_2_fees_general_provisions",
    "source": "EARIST Student Handbook",
    "category": "Article III - Payments and Refund of Fees",
    "topic": "Section 1 & 2: General Provisions and Schedule of Fees",
    "content": "Under Article III Payments and Refund of Fees, Section 1 establishes that the Board of Trustees fixes tuition fees and other necessary school charges, including matriculation, graduation, and laboratory fees, subject to R.A. No. 8292 and R.A. No. 10931. The Institute is mandated to adopt mechanisms for online payment of fees.\n\nSection 2 states that educational expenses for EARIST students are free as stipulated in R.A. 10931 (Universal Access to Quality Tertiary Education Act). However, the Institute charges a fixed amount per unit/hour and laboratory fees may vary by subject for those not covered. For 'Payee Students' (those not covered by free tuition), total matriculation fees include tuition, miscellaneous, and other fees. These matriculation fees may be paid in cash or on an installment basis, with terms determined by the Financial Management Services.",
    "keywords": [
      "Board of Trustees",
      "R.A. 10931",
      "free tuition",
      "payee students",
      "installment basis",
      "online payment"
    ]
  },
  {
    "id": "art_3_sec_3_withdrawal_refunds",
    "source": "EARIST Student Handbook",
    "category": "Article III - Payments and Refund of Fees",
    "topic": "Section 3: Withdrawal and Refund of Fees",
    "content": "Under Article III Payments and Refund of Fees, Section 3 outlines the guidelines for the withdrawal and refund of fees, which differ based on the student's status.\n\nFor Tertiary students availing of the Free Tuition Fee under R.A. No. 10931, refunds are not permitted. A student cannot refund tuition, entrance, examination, or other charges regardless of whether they attended classes.\n\nFor Tertiary students not covered by R.A. No. 10931, Graduate Programs, and the Secondary Laboratory Department, students may opt to pay fees and are eligible for refunds. To process a refund, the student must cancel their registration by filing a Dropping Form at the Registrar's Office, signed by all concerned faculty, the Dean, and the Registrar.\n\nThe rules for the refund of fees are as follows:\n1. Full refund of tuition fee is granted before the start of classes.\n2. 80% refund of tuition fee is granted within one (1) week from the start of classes.\n3. 50% refund of tuition fee is granted within two (2) weeks from the start of classes.\n4. No refund is granted after the 2nd week of classes.",
    "keywords": [
      "refund policy",
      "dropping form",
      "R.A. 10931 refund",
      "graduate school refund",
      "withdrawal of enrollment",
      "refund schedule"
    ]
  },
  {
    "id": "art_4_sec_1_tertiary_education_program",
    "source": "EARIST Student Handbook",
    "category": "Article IV - Scholarship and Financial Assistance",
    "topic": "Section 1: Tertiary Education Program (TEP)",
    "content": "Under Article IV Scholarship and Financial Assistance, the UniFAST, through the Office of Student Affairs and Services (SAS), provides aid to qualified students. Section 1 details the Tertiary Education Program.\n\nQualifications include: The student must be enrolled; must carry a regular load of 18 units (except for graduating students); must not be a recipient of a scholarship or grant from any government agency; and must not have a failing grade or a dropped subject in the previous semester.\n\nRequirements for application include: A duly accomplished Scholarship Form from the SAS signed by respective personnel; a copy of the current and previous Certificate of Registration (COR); a copy of the current and previous Report of Grades; and a photocopy of the School I.D. with three specimen signatures.",
    "keywords": [
      "Tertiary Education Program",
      "UniFAST",
      "scholarship qualifications",
      "18 units requirement",
      "SAS form"
    ]
  },
  {
    "id": "art_4_sec_2_tulong_dunong_program",
    "source": "EARIST Student Handbook",
    "category": "Article IV - Scholarship and Financial Assistance",
    "topic": "Section 2: Tulong Dunong Program (TDP)",
    "content": "Under Article IV Scholarship and Financial Assistance, Section 2 outlines the Tulong Dunong Program.\n\nQualifications for this program are: The student must be enrolled; must carry a regular load of 18 units (except for graduating students); must not have a failing grade or dropped subject in the previous semester; must be a Filipino citizen; must meet existing admission and retention requirements without exceeding the Maximum Residency Policy; must not have been expelled from any Higher Education Institution (HEI); and must not be a recipient of any other government scholarship or grant. Additionally, the student must be a dependent of an Overseas Filipino Worker (OFW) who was repatriated, displaced, or deceased during the COVID-19 Pandemic, as certified by the Department of Labor and Employment (DOLE).\n\nRequirements include: A duly accomplished Scholarship Form from the Office of Student Affairs and Services (SAS); a copy of the current and previous Certificate of Registration (COR); a copy of the current and previous Report of Grades; and a photocopy of the School I.D. with three specimen signatures.",
    "keywords": [
      "Tulong Dunong Program",
      "OFW dependent",
      "COVID-19 scholarship",
      "DOLE certification",
      "maximum residency"
    ]
  },
  {
    "id": "art_4_sec_3_faculty_union_scholarship",
    "source": "EARIST Student Handbook",
    "category": "Article IV - Scholarship and Financial Assistance",
    "topic": "Section 3: Faculty and Employees Union Scholarship",
    "content": "Under Article IV Scholarship and Financial Assistance, Section 3 details the Faculty and Employees Union Scholarship, available to qualified children of EARIST employees.\n\nQualifications: The student must be currently enrolled in a course at any college; must carry a minimum academic load of 18 units (except graduating students); and must have a passing grade in all subjects, including P.E. and NSTP, to qualify for continuance.\n\nRequirements: A duly accomplished Scholarship Form (Appendix J); a copy of the previous Certificate of Registration; a copy of the current Report of Grades; and a Certificate of Employment of the parent from the EARIST HRD.\n\nConditions: The scholar shall not drop any subject, shift courses, or stop schooling without approval from the Dean and Registrar. They must not commit any infraction ranging from serious to very serious offenses. They must apply for renewal at the end of each semester and must finish the course within the specified years in the curriculum. Failure to comply leads to discontinuance.",
    "keywords": [
      "Faculty Union Scholarship",
      "employee dependents",
      "HRD certificate",
      "NSTP requirement",
      "scholarship renewal"
    ]
  },
  {
    "id": "art_4_sec_4_5_6_special_grants_student_assistant",
    "source": "EARIST Student Handbook",
    "category": "Article IV - Scholarship and Financial Assistance",
    "topic": "Section 4-6: Special Grants, Student Assistance, and Dual Policy",
    "content": "Under Article IV Scholarship and Financial Assistance, Section 4 lists Special Grants available, including CHED-Student Financial Assistance Programs (StuFAPs), EARIST Faculty Sponsored Scholarship, DOST-SEI Scholarship Grant, and grants from other NGOs.\n\nSection 5 defines Student Assistance as term-employment for students. The work is limited to not more than 100 hours per month. Wages are set at P30.00 per hour for non-technical skills and P75.00 per hour for technical skills. Applicants must be bonafide students with at least one semester of residence, no failing grades in the previous semester, and a weighted average of at least 2.50.\n\nSection 6 establishes the Policy on \"No Dual Scholarship.\" A student is prohibited from enjoying more than one scholarship or grant simultaneously. If a student qualifies for multiple grants, the Scholarship Coordinator must inform the accounting department, and the student must choose the most beneficial option.",
    "keywords": [
      "Student Assistant wage",
      "working student rate",
      "DOST-SEI",
      "CHED-StuFAPs",
      "dual scholarship policy",
      "100 hours limit"
    ]
  },
  {
    "id": "art_5_sec_1_student_rights",
    "source": "EARIST Student Handbook",
    "category": "Article V - Rights and Responsibilities of Students",
    "topic": "Section 1: Student Rights",
    "content": "Under Article V, Section 1, bonafide students of EARIST are guaranteed specific rights necessary for their academic and personal growth. These rights include the freedom to choose a field of study subject to fair admission requirements, and the right to participate in matters affecting their welfare. Students are entitled to avail of career guidance and counseling services. They have the right to access and receive official documents such as certificates, diplomas, transcripts of records, and report of grades upon request and payment of fees.\n\nFurthermore, students have the right to publish a student newspaper consistent with the \"Campus Journalism Act of 1991\" and enjoy privacy of communication and freedom of speech. They may participate in approved projects for holistic growth. Students are also entitled to freely express their gender preference, provided they follow the norms of the Institution without prejudice to the Handbook's provisions. Lastly, students have the right to seek justification for contested grades. In such cases, a student may file a written request for re-computation or rectification within a prescribed period through the Dean or Campus Administrator for major courses, or the Director of Instruction for general education courses.",
    "keywords": [
      "student rights",
      "Campus Journalism Act",
      "gender preference",
      "grade rectification",
      "access to records",
      "freedom of speech",
      "career guidance"
    ]
  },
  {
    "id": "art_5_sec_2_student_responsibilities",
    "source": "EARIST Student Handbook",
    "category": "Article V - Rights and Responsibilities of Students",
    "topic": "Section 2: Responsibilities of the Student",
    "content": "Under Article V, Section 2, bonafide students of EARIST are bound by specific duties and responsibilities to the Institute and the community. Students must conduct themselves with proper behavior, showing respect and manners at all times. They are expected to exert utmost diligence in their studies to develop their potential and become assets to their families and society. Upholding the academic integrity of the Institute is mandatory, achieved by striving for academic excellence and abiding by school rules.\n\nStudents are also responsible for promoting and maintaining a pleasant school environment and fostering harmonious relationships with fellow students, faculty, and staff. They must actively participate in co-curricular and extra-curricular activities that contribute to the cultural development of the community. Finally, students must adopt positive measures for their holistic development and strictly abide by the Code of Conduct and Discipline formulated by the Institute.",
    "keywords": [
      "student responsibilities",
      "academic integrity",
      "proper behavior",
      "Code of Conduct",
      "holistic development",
      "co-curricular activities"
    ]
  },
  {
    "id": "art_6_sec_1_3_conduct_uniform_grooming",
    "source": "EARIST Student Handbook",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "General Conduct, Branding, Uniforms, and Grooming",
    "content": "Under Article VI Code of Conduct and Discipline, Section 1 establishes that every student must strictly adhere to the EARIST Code of Conduct proposed by Dr. Editha V. Pillo, which emphasizes the motto: \"DO the right thing, right!\" regarding the pursuit of academic excellence and discipline.\n\nSection 2 mandates that only Institute offices may use the EARIST name, logo, and seal. Students require recommendation from an adviser and approval from an authorized official to use these on printed materials.\n\nSection 3 outlines conduct regarding appearance and behavior. Every student must wear the prescribed uniform on Mondays, Wednesdays, and Fridays. College Shirt uniforms are worn on Tuesdays and Thursdays, while Organizational Shirt uniforms are worn on Saturdays. Exemptions apply for laboratory, P.E., and NSTP classes during their respective periods. Pregnant students are exempted upon submission of a medical certification to the EARIST Medical Officer.\n\nRegarding grooming, male students must maintain a clean haircut (barber's cut 2x3 inches) without colorful highlights, earrings, or goatees. Female students are prohibited from having colorful hair highlights. For all students, exposed body piercing and loud tattoos are strictly prohibited. Working students requiring specific hairstyles for employment must secure a special permit from the Office of Student Affairs and Services.",
    "keywords": [
      "uniform schedule",
      "grooming standards",
      "haircut policy",
      "pregnant student uniform",
      "logo usage",
      "Dr. Editha V. Pillo"
    ]
  },
  {
    "id": "art_6_sec_3_id_regulations_curfew",
    "source": "EARIST Student Handbook",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "ID Regulations, Curfew, and Campus Order",
    "content": "Under Article VI Code of Conduct and Discipline, Section 3.2 mandates that every student must wear the official identification card (ID) at all times inside the campus. Entrance is denied without it. In case of loss, the student must report to the Security Officer and secure a replacement from the Registrar's Office by submitting a Notarized Affidavit of Loss, an Accomplished Clearance Form from the College Prefect of Discipline, and the Official Receipt of ID Replacement.\n\nPenalties for lost IDs are specific: Losing an ID for the second time without a valid reason is a \"negligence\" (minor offense), requiring a parent dialogue and warning. Losing an ID for the third time is \"gross negligence\" (major offense), requiring a parent dialogue and Discipline Probation.\n\nRegarding campus order, Section 3.3.4 sets the curfew at 9:30 PM, unless endorsed by a Dean and approved by the President's representative. Students must maintain cleanliness, respect school property, and refrain from using gadgets during classes and examinations. Loitering along corridors during classes is prohibited.",
    "keywords": [
      "ID replacement",
      "lost ID penalty",
      "campus curfew",
      "gross negligence",
      "gadget policy"
    ]
  },
  {
    "id": "art_6_sec_4_major_offenses_part_1",
    "source": "EARIST Student Handbook",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Major Offenses: Academic Dishonesty, Safety, and Violence",
    "content": "Under Article VI Section 4.1.1, Major Offenses include acts related to academic integrity, safety, and violence. Academic dishonesty includes cheating in any form (exams, reports, experiments), unauthorized possession of notes, copying or allowing others to copy, having someone else take an exam, and plagiarism.\n\nOffenses regarding safety and violence include: Vandalism or deliberate destruction of property; carrying deadly weapons; deliberate disruption of academic functions creating disorder; brawls; and direct assault or inflicting physical injuries on any person.\n\nDrug and alcohol violations are strictly classified as Major Offenses. This includes the unauthorized possession or use of prohibited drugs (violation of RA 9165/Comprehensive Dangerous Drugs Act of 2002) and the possession or consumption of alcohol inside premises, or entering the campus under the influence of alcohol regardless of the amount. Hazing (RA 8049) is also a major offense; officers of organizations are liable whether present or not, and members present are liable regardless of participation.",
    "keywords": [
      "major offenses",
      "academic dishonesty",
      "plagiarism",
      "cheating",
      "RA 9165",
      "RA 8049",
      "hazing",
      "deadly weapons"
    ]
  },
  {
    "id": "art_6_sec_4_major_offenses_part_2",
    "source": "EARIST Student Handbook",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Major Offenses: Integrity, Cyber, and Social Conduct",
    "content": "Under Article VI Section 4.1.1, Major Offenses also cover institutional integrity, cyber security, and social conduct. These offenses include: Gross acts of disrespect towards any Institute personnel or student; threatening others with harm; acts of lewdness or immorality (including necking, petting, or accessing pornography); acts bringing disrepute to the Institute; unjust enrichment (stealing or failing to turn over lost items); unauthorized collection of money; and forging or tampering with academic/official records.\n\nComputer security breaches are Major Offenses, including unauthorized access, altering data, introducing viruses, or preventing authorized use. Unauthorized use of the EARIST name/logo on social media is prohibited. Other Major Offenses include perjury, possession of firecrackers, lending/using another's ID, making sexual advances, illegal reproduction of Institute materials, violation of Intellectual Property Rights, scalping tickets, robbery/theft, and smoking (including e-cigarettes) on premises. Bullying under RA 10627 is also a Major Offense. Habitual commission of minor offenses (3 of the same kind or 5 of different kinds) is elevated to a Major Offense.",
    "keywords": [
      "computer security breach",
      "forgery",
      "immorality",
      "RA 10627",
      "bullying",
      "smoking ban",
      "habitual disregard"
    ]
  },
  {
    "id": "art_6_sec_4_minor_offenses",
    "source": "EARIST Student Handbook",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Minor Offenses",
    "content": "Under Article VI Section 4.1.2, Minor Offenses include: Simple acts of disrespect; acts disturbing peace (disturbing classes); refusal to present ID; proselytizing; littering; unauthorized selling or soliciting; Public Display of Physical Intimacy (PDPI); unauthorized use of classrooms; and loitering during classes (second offense).\n\nAdditional minor offenses involve specific facility and prohibited item violations: Playing electronic/board games outside official activities; unhygienic use of facilities; entering restricted areas; bringing cutters/scissors without permit; and bringing domesticated pets. \n\nRepeated procedural violations are also Minor Offenses: Third entry without ID in an academic year; third loss of ID (Note: Section 3.2.2.2 classifies 3rd loss as Major/Gross Negligence, but Section 4.1.2.15 lists it here—users should verify context); third non-wearing of ID; changing uniform on premises (except as allowed); and refusal to undergo random drug testing.",
    "keywords": [
      "minor offenses",
      "public display of affection",
      "PDPI",
      "littering",
      "loitering",
      "unauthorized selling",
      "no ID entry"
    ]
  },
  {
    "id": "art_6_sec_4_disciplinary_procedures",
    "source": "EARIST Student Handbook",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Disciplinary Procedures and Student Discipline Board",
    "content": "Under Article VI Section 4.2, the Student Discipline Board (SDB) hears cases. For Minor Offenses (College Level), the Board consists of the Dean, College Prefect of Discipline, Department Head, and CSG Governor. For Major Offenses (Institute Level), the Board consists of the OSAS Director, the Dean, ISG President, and CSG Governor. The VPAA may appoint additional members to guarantee impartiality.\n\n**Hearing Procedure:** Complaints must be written and filed with the Dean (Minor) or OSAS (Major). Incident reports from Security are considered formal complaints. Due process requires: 1) The student is informed in writing of the accusation and evidence; 2) The student has the right to answer allegations and present counter-evidence with an adviser; 3) All evidence must be under oath and notarized.\n\n**Corrective Measures:** Penalties are formative, not just retributive. \n* **Major Offenses:** Probation, Suspension, Dismissal/Non-Readmission, or Expulsion.\n* **Minor Offenses:** 1st: Written Warning; 2nd: Written Reprimand + Parent Letter/Conference; 3rd: Charged as Major Offense (or Reprimand + Conference depending on applicability).\n* **Mandatory Actions:** Students/Parents may also be required to attend seminars, write apology letters, undergo counseling, or pay restitution.",
    "keywords": [
      "Student Discipline Board",
      "SDB",
      "disciplinary hearing",
      "due process",
      "suspension",
      "expulsion",
      "formative intervention"
    ]
  },
  {
    "id": "art_7_sec_1_2_minor_sanctions",
    "source": "EARIST Student Handbook",
    "category": "Article VII - Disciplinary Sanctions",
    "topic": "Warning, Reprimand, and Suspension",
    "content": "Under Article VII Disciplinary Sanctions, Sections 1 and 2 outline the penalties for minor offenses or initial disciplinary actions. \n\nSection 1 defines Warning or Reprimand. These sanctions are imposed either in writing (for minor offenses) or through verbal admonition. The purpose is to warn the erring student that a repetition of the offense will result in graver disciplinary measures. A warning or reprimand is typically given for a first and second incident of a minor offense and is recorded in the Dean's Office or the Office of Student Affairs and Services (OSAS).\n\nSection 2 defines Suspension. This sanction bars a student from a particular class or from the school for a prescribed period. If a suspension exceeds three days, it requires the approval of the Vice President for Academic Affairs. The Institute considers the period of suspension as an absence voluntarily incurred by the student.",
    "keywords": [
      "warning",
      "reprimand",
      "suspension",
      "minor offense",
      "VPAA approval",
      "disciplinary record"
    ]
  },
  {
    "id": "art_7_sec_3_probation_types",
    "source": "EARIST Student Handbook",
    "category": "Article VII - Disciplinary Sanctions",
    "topic": "Academic and Discipline Probation",
    "content": "Under Article VII Disciplinary Sanctions, Section 3 defines Probation, which is imposed on students whose actions or behavior merit potential separation from the school. There are two types of probation:\n\n**Academic Probation** is imposed when a student fails one (1) major course or two (2) minor courses. This status lasts for one semester and is automatically lifted if the student passes all courses during the probationary semester. Further failure in any course results in the denial of readmission.\n\n**Discipline Probation** is imposed if a student commits a major offense meriting this sanction, or three (3) minor offenses within a semester. The probationary period lasts a minimum of sixty (60) school days up to a maximum of one semester. A student may be placed on probation only twice; further violations result in dismissal.\n\nIn both types, the student and their parent or guardian are informed in writing. The Dean's Office or OSAS issues a communication regarding the lifting of the probation status only after a required counseling session has been held.",
    "keywords": [
      "Academic Probation",
      "Discipline Probation",
      "major course failure",
      "probation duration",
      "counseling requirement",
      "readmission"
    ]
  },
  {
    "id": "art_7_sec_4_6_exclusion_dismissal_expulsion",
    "source": "EARIST Student Handbook",
    "category": "Article VII - Disciplinary Sanctions",
    "topic": "Non-Readmission, Dismissal, and Expulsion",
    "content": "Under Article VII Disciplinary Sanctions, Sections 4 through 6 define the severe penalties resulting in separation from the Institute.\n\n**Non-Readmission (Section 4)** allows an erring student with a major offense to finish the current semester but excludes them from enrolling in the next semester. This sanction automatically disqualifies the student from receiving a Certificate of Good Moral Character upon the recommendation of the EARIST Grievance Committee.\n\n**Dismissal (Section 5)** allows the school to immediately drop an undesirable student from the school rolls and issue transfer credentials. This is applied to students guilty of major offenses when extreme urgency necessitates immediate removal. It also results in the non-issuance of a Certificate of Good Moral Character.\n\n**Expulsion (Section 6)** is an extreme penalty excluding the student from admission to **any** public or private school in the Philippines. This requires prior approval from the Board of Trustees (BOT). A student under investigation for expulsion may be preventively suspended if their presence poses a risk to life, property, or normal operations. This also results in the non-issuance of a Certificate of Good Moral Character.",
    "keywords": [
      "non-readmission",
      "dismissal",
      "expulsion",
      "Board of Trustees",
      "preventive suspension",
      "Good Moral Character",
      "transfer credentials"
    ]
  },
  {
    "id": "art_7_sec_7_10_misc_penalties_graduating",
    "source": "EARIST Student Handbook",
    "category": "Article VII - Disciplinary Sanctions",
    "topic": "Other Penalties, Graduating Students, and Prescription",
    "content": "Under Article VII Disciplinary Sanctions, Sections 7 through 10 outline supplementary penalties and specific rules for graduating students.\n\nSection 7 allows for other penalties depending on the gravity of the offense. These include payment of fines or civil liabilities, revocation of degree, non-issuance of diploma, disqualification from enrollment, or annotation of the offense on the Transcript of Records.\n\nSection 9 specifically addresses **Graduating Students**. Those who commit a major offense shall not be allowed to join the commencement exercises (graduation ceremony) and shall not be issued a Certificate of Good Moral Character upon the recommendation of the Student Discipline Board (SDB).\n\nSection 10 establishes the Prescriptive Period, stating that the school has the right to take action against violators as long as they remain enrolled. All violations must be reported to parents or guardians through the Dean's Office or OSAS.",
    "keywords": [
      "graduating students",
      "commencement exercises",
      "revocation of degree",
      "transcript annotation",
      "prescriptive period",
      "civil liabilities"
    ]
  },
  {
    "id": "art_8_grievance_filing_process",
    "source": "EARIST Student Handbook",
    "category": "Article VIII - Settlement of Complaints/Grievances",
    "topic": "Filing Complaints and Due Process",
    "content": "Under Article VIII Procedures for the Settlement of Complaints/Grievances, the Institute mandates due process, fairness, and a preference for counseling and amicable settlement. \n\nSection 1 outlines the filing process. The initial step is consultation with a teacher or official. Psychological problems are referred to the Counseling and Testing Office. Complaints must be in writing. \n\n**Filing Jurisdiction:**\n* **Minor Offenses:** Filed with the Office of the Dean.\n* **Major Offenses:** Filed with the Director of Student Affairs and Services (OSAS).\n\n**Referral Pathways:**\n* **Student vs. Faculty/Personnel:** The OSAS Director refers the case to the Vice President for Academic Affairs (for academic concerns) or the Vice President for Administration and Finance (for administrative concerns).\n* **Faculty/Personnel vs. Student:** The case is referred to the College Discipline Board or Institutional Discipline Board.\n\nIn all proceedings, both the complainant and respondent have the right to a counsel of their choice and to present affidavits.",
    "keywords": [
      "grievance procedure",
      "filing complaints",
      "right to counsel",
      "OSAS jurisdiction",
      "amicable settlement",
      "due process"
    ]
  },
  {
    "id": "art_8_grievance_arbitration_appeals",
    "source": "EARIST Student Handbook",
    "category": "Article VIII - Settlement of Complaints/Grievances",
    "topic": "Arbitration, Investigation, and Appeals",
    "content": "Under Article VIII, Sections 1.2 and 1.3 detail the resolution and appeals process for grievances.\n\nThe academic or administrative unit receiving a complaint must first aim for arbitration and amicable settlement. If settlement is not possible, the unit refers the case to the **EARIST Grievance Committee** for proper investigation. The Committee then submits its recommendations to the Institute President.\n\n**Appeals:** The decision of the Institute President is final and executory unless appealed to higher authorities, including the **Board of Trustees (BOT)**. The decision of the Board of Trustees is deemed final and executory, without prejudice to the provisions of the Civil Service Law.",
    "keywords": [
      "arbitration",
      "EARIST Grievance Committee",
      "Institute President",
      "Board of Trustees",
      "appeals process",
      "Civil Service Law"
    ]
  },
  {
    "id": "art_9_sec_1_welfare_info_laws",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 1: Student Welfare, Information and Orientation",
    "content": "Under Article IX Student Affairs and Services, Section 1 defines Student Welfare Services as basic programs necessary for student well-being. This includes Information and Orientation Services designed to facilitate adjustment to tertiary education. The Institute provides materials on the mission, vision, rules, and student conduct.\n\nA comprehensive orientation program is held for new and continuing students, covering relevant laws and policies. The Institute ensures educational and career materials are available, including specific statutes affecting students: RA 10627 (Anti-Bullying Act), RA 9262 (Violence Against Women and Children), RA 7877 (Anti-Sexual Harassment Act), RA 8049 (Anti-Hazing Law), RA 7610 (Special Protection of Children Against Abuse), RA 8504 (Philippine AIDS Prevention and Control Act), RA 7277 (Magna Carta for Persons with Disabilities), RA 9165 (Comprehensive Dangerous Drugs Act), RA 9418 (Volunteer Act), RA 9512 (Environmental Awareness), and Gender and Development policies.",
    "keywords": [
      "Student Welfare Services",
      "orientation program",
      "RA 10627",
      "RA 9262",
      "RA 7877",
      "RA 8049",
      "RA 7277",
      "relevant laws"
    ]
  },
  {
    "id": "art_9_sec_1_guidance_counseling_services",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 1.2: Guidance and Counseling Services",
    "content": "Under Article IX Student Affairs and Services, Section 1.2 outlines Guidance and Counseling Services. These services use an integrated approach to help individuals utilize their potential. Specific services include:\n\n* **Counseling:** A goal-oriented relationship (individual or group) to improve planning, decision-making, and problem resolution.\n* **Individual Inventory:** Systematically collecting and interpreting data to identify student characteristics.\n* **Testing and Appraisal:** Measuring ability and achievement to predict performance or diagnose learning difficulties.\n* **Information:** Disseminating descriptive materials through advising or group activities.\n* **Research and Evaluation:** Conducting research to advance knowledge and evaluating programs to determine if goals are met.\n* **Follow-up:** Determining the status of students who received assistance.\n* **Referral:** Assisting clients in obtaining services from other agencies.\n* **Special Programs:** Adjunct services organized based on current needs, such as Pre-employment Seminars, Career Talks, and Job Fairs.",
    "keywords": [
      "guidance services",
      "counseling",
      "individual inventory",
      "psychological testing",
      "referral service",
      "career talk"
    ]
  },
  {
    "id": "art_9_sec_1_economic_enterprise_handbook",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 1.4-1.5: Economic Enterprise and Handbook Development",
    "content": "Under Article IX Student Affairs and Services, Section 1.4 covers Economic Enterprise Development. This includes Student Cooperatives (loans, savings) and Entrepreneurial activities (lay-outing, photography, event planning, rentals, product selling). Student organizations wishing to conduct business must apply to the Office of Student Affairs and Services (OSAS), get an endorsement from the Office of Production and IGP, and secure approval from the President via the OVPAA. Approved organizations must submit a Financial Status report annually to renew their permit.\n\nSection 1.5 mandates the development and revision of the Student Handbook every five (5) years. The Committee on Revision includes the VP for Academic Affairs (Chair), Director of SAS (Co-chair), Deans, Student Trustee, and ISG President. Updates supported by legal issuances may be included between revisions if approved by the Board of Trustees.",
    "keywords": [
      "student cooperatives",
      "IGP",
      "business permit",
      "student handbook revision",
      "financial status report"
    ]
  },
  {
    "id": "art_9_sec_2_leadership_training",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 2.2: Leadership Training",
    "content": "Under Article IX Student Affairs and Services, Section 2.2 describes Leadership Training programs. The OSAS organizes training for student leaders from the classroom to the institutional level, including officers of accredited organizations. The Leadership Training Seminar (LTS) is intended for elected officers of the Institute Student Government (ISG), College Student Government (CSG), and Legislative Department.\n\nStudent leaders are given opportunities to attend training at local, regional, or national levels. The Leadership Service Division (LSD) develops a queuing system to ensure equal chances for attendance. Invitations from external organizations are processed by SAS and recommended to the President. Leaders who attend training must submit a narrative report, liquidation, and a copy of the lecture materials to OSAS.",
    "keywords": [
      "Leadership Training Seminar",
      "LTS",
      "queuing system",
      "student leaders",
      "training liquidation"
    ]
  },
  {
    "id": "art_9_sec_2_isg_structure_election",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 2.3: Institute Student Government (Structure & Election)",
    "content": "Under Article IX Student Affairs and Services, Section 2.3 establishes the Institute Student Government (ISG) as the highest student governing body. It serves as the official representative of students and a mediator in conflicts. The ISG is composed of an Executive Board (President, Vice President, Secretary, Treasurer, Auditor) and a Legislative Board (College Representatives). The Executive Board is elected at large by all bonafide students, while the Legislative Board is elected by students of their respective colleges.\n\nThe ISG includes appointed committees: Ways and Means, Education/Training, Socio-Cultural/Sports, Cleanliness, Special Projects, and Grievance. The term of office is one year, from January 1 to December 31. Officers are entitled to re-election.",
    "keywords": [
      "Institute Student Government",
      "ISG",
      "Executive Board",
      "Legislative Board",
      "student election",
      "term of office"
    ]
  },
  {
    "id": "art_9_sec_2_officer_qualifications_disqualifications",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 2.3: ISG/CSG Qualifications and Disqualifications",
    "content": "Under Article IX Student Affairs and Services, Section 2.3 outlines the qualifications for ISG and CSG officers. Candidates must: be bonafide students; carry a minimum load of 18 units (appeals allowed if the regular load is lower); have at least one year of residency; not have been found guilty of any major offense; have a GPA of 2.50 or higher; and have no failing grades in the preceding semester.\n\nOfficers are disqualified from continuing their term if they: obtain a failing grade during the semester before or during their term; commit a major offense; failure to enroll during their term; or suffer permanent physiological/psychological incapacity.",
    "keywords": [
      "officer qualifications",
      "GPA requirement",
      "18 units",
      "residency rule",
      "impeachment grounds",
      "disqualification"
    ]
  },
  {
    "id": "art_9_sec_2_publications_yearbook",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 2.5: Student Publications and Yearbook",
    "content": "Under Article IX Student Affairs and Services, Section 2.5 covers Student Publications. The Institute supports student publications pursuant to R.A. 7079 (Campus Journalism Act of 1991). The OSAS supervises all publications and coordinates with the Board of Examiners to determine the staff of major publications like *The EARIST Technozette* and *The Champion* through qualifying examinations.\n\n\"The EARISTians\" is designated as the official yearbook of graduating students. Funding for the yearbook is derived from subscriptions voluntarily paid by the graduating students.",
    "keywords": [
      "student publication",
      "Technozette",
      "The Champion",
      "Campus Journalism Act",
      "RA 7079",
      "yearbook"
    ]
  },
  {
    "id": "art_9_sec_4_medical_insurance_safety",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 4: Medical, Insurance, and Safety Services",
    "content": "Under Article IX Student Affairs and Services, Section 4 outlines institutional services. Medical and Dental Services provide primary health care, including entry-level physical exams for freshmen, free consultation, minor treatments, and free tooth extraction (if indicated). Emergency cases are referred to hospitals.\n\nAll bonafide students are covered by a personal accident insurance policy managed by a private company. The annual premium is taken from the student's miscellaneous fees.\n\nSafety and Security Services enforce strict rules: All assets brought onto campus (laptops, etc.) must be reported to Security. Personal valuables are the sole responsibility of the student. Firearms, deadly weapons, liquors, and prohibited drugs are strictly banned. The Institute is a no-smoking area. Students cannot enter the premises on Saturdays, Sundays, or Holidays for sports without prior authority from the President. A Disaster Risk Reduction and Management Committee (DRRMC) handles contingency plans and drills.",
    "keywords": [
      "medical services",
      "accident insurance",
      "campus security",
      "asset reporting",
      "no smoking policy",
      "weekend entry"
    ]
  },
  {
    "id": "art_9_sec_4_housing_faith_special_needs",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 4: Housing, Faith, Foreign, and Special Needs Services",
    "content": "Under Article IX Student Affairs and Services, Section 4 details specialized support services. Student Housing services involve the periodic monitoring and evaluation of student-athlete dormitories and housing facilities inside the campus by OSAS. Inter-Faith Services provide facilities such as a chapel for religious expression, and OSAS assists in accrediting religious organizations. Foreign Student Services assist with academic and non-academic needs.\n\nServices for Students with Special Needs and Persons with Disabilities (PWDs) ensure equal opportunities. The Institute accommodates learners with special needs, provides life skills training, and the Counseling and Testing Office maintains records of students with disabilities.",
    "keywords": [
      "student housing",
      "inter-faith services",
      "foreign students",
      "PWD services",
      "special needs"
    ]
  },
  {
    "id": "art_9_sec_4_sports_athletes_intramurals",
    "source": "EARIST Student Handbook",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Section 4.11: Sports, Student-Athletes, and Intramurals",
    "content": "Under Article IX Student Affairs and Services, Section 4.11 outlines the Sports and Physical Development Programs. To qualify as a Student-Athlete, a student must be bonafide, enrolled in an undergraduate program, within the SCUAA age limit, and have no failed grades in the previous semester. Benefits include monthly allowances, travel allowances, free uniforms, and competition shoes. Duties include attending classes and mandatory training.\n\nAthletes forfeit their status for violations of the Student Handbook, non-participation in training, or culpable violations in competitions. The Institutional Intramurals is an annual sports festival where attendance is checked by instructors (no classes are held). Intramural night activities are allowed up to 9:00 p.m. only.",
    "keywords": [
      "student-athlete benefits",
      "SCUAA",
      "intramurals",
      "athlete qualifications",
      "sports allowance"
    ]
  },
  {
    "id": "art_10_sec_1_2_gov_authority",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "General Policy and OSAS Authority",
    "content": "Under Article X Student Organization, Sections 1 and 2 establish the governance and regulation of student groups at EARIST. The creation of these organizations is governed by Batas Pambansa Blg. 232 (Education Act of 1982). The authority to regulate the establishment and operations of any student organization is vested in the Office of Student Affairs and Services (OSAS).\n\nOSAS has the authority to formulate policies, approve co-curricular and extra-curricular activities, and issue Certificates of Recognition. This certificate must be signed by the Leadership Coordinator, SAS Director, Vice President for Academic Affairs (VPAA), and the President. OSAS also holds the power to renew or revoke accreditation based on consultation with the Institute Student Government (ISG) or College Student Government (CSG). In cases of conflict within or between organizations where no resolution is reached, OSAS may intervene and render a binding decision. Furthermore, OSAS may create committees composed of bonafide members of accredited organizations to assist the office and train potential leaders.",
    "keywords": [
      "OSAS authority",
      "Certificate of Recognition",
      "Batas Pambansa Blg. 232",
      "conflict resolution",
      "accreditation power"
    ]
  },
  {
    "id": "art_10_sec_3_accreditation_application",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Application for Recognition/Accreditation",
    "content": "Under Article X Student Organization, Section 3 outlines the application process for recognition. Applications must be submitted to OSAS through the Institute Student Government (ISG) one (1) month after the school year opens. The processing period is within fifteen (15) working days. Required documents include: a letter of application (endorsed by the Dean for college-based orgs), a duly accomplished SAS Application Form, the Constitution and By-Laws (aligned with the Institution's Mission-Vision), updated rosters of officers/founders with specimen signatures and photos, a photocopy of the latest registration form, the Adviser's Conforme form, and a Master Plan of activities with a budget breakdown.\n\nThe deadline is strictly enforced; late applicants must wait for the next school year. The Accreditation Board (ISG President, Leadership Coordinator, SAS Director) convenes immediately after the deadline, and organization presidents must be available for interviews. Failure to seek recognition for one school year without justifiable cause results in the loss of privileges to use Institute facilities or hold projects.",
    "keywords": [
      "accreditation requirements",
      "application deadline",
      "Master Plan of activities",
      "Adviser Conforme",
      "recognition process"
    ]
  },
  {
    "id": "art_10_sec_4_renewal_accreditation",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Renewal of Accreditation",
    "content": "Under Article X Student Organization, Section 4 details the renewal process for accredited student organizations. Organizations intending to renew must apply one (1) month after the opening of the school year. The required documents for renewal include: an Accomplishment Report with documentation (attested by the auditor and president, endorsed by the Adviser and Dean); Amendments to the Constitution and By-Laws (if any) with proof of ratification; lists of new officers and members; a Master Plan of Activities; Program/Activity Evaluations; and the Faculty Adviser Conforme.\n\nFor Institutional Organizations, the financial/accomplishment reports must be prepared by the treasurer and noted by the Adviser.",
    "keywords": [
      "renewal of accreditation",
      "accomplishment report",
      "ratification of amendments",
      "renewal deadline"
    ]
  },
  {
    "id": "art_10_sec_5_6_status_classification_revocation",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Status, Classification, and Revocation",
    "content": "Under Article X Student Organization, Sections 5 and 6 define the status and classification of organizations. The Institute Student Government (ISG) is designated as the \"mother organization\" of all student groups. Accredited organizations are classified by status as either **Regular** (satisfactory performance) or **Probationary** (demoted due to failure to meet requirements). They are also classified by nature: **College-Based Organizations** support the academic development of members within a specific program, while **Institute Organizations** focus on social, cultural, religious, literary, and recreational aspects.\n\nRegarding revocation, a Certificate of Recognition may be revoked at any time if the organization violates its own statement of purpose, Constitution, By-Laws, or EARIST policies. Revocation is enforced only after due process is observed.",
    "keywords": [
      "probationary status",
      "regular status",
      "college-based organizations",
      "institute organizations",
      "revocation of recognition",
      "ISG function"
    ]
  },
  {
    "id": "art_10_sec_7_activity_approval_process",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Policies on Approval of Activities",
    "content": "Under Article X Student Organization, Section 7 mandates that all curricular and extra-curricular activities falling under ISG jurisdiction must be approved by the Institute President through the VPAA and SAS Director. Proposals must be supported by an Activity Proposal Form, a letter to the President, budgetary allocation, venue reservation, and profiles of resource persons (or parental waivers for outside activities).\n\nCrucial operational constraints include: Solicitations and external communications must be noted by the Adviser and Dean and approved by the President/VPAA/SAS Director. Student groups are **prohibited** from holding activities one week before and during major examinations. All activities must be coordinated with the College Dean and Security Office. Finally, a Student Activity Performance Report, Activity Evaluation, and Financial Statement must be submitted within five (5) days after the activity; failure to do so prohibits future activities.",
    "keywords": [
      "activity proposal",
      "examination ban",
      "solicitation approval",
      "activity report deadline",
      "banned dates"
    ]
  },
  {
    "id": "art_10_sec_8_off_campus_activities",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Off-Campus and Overnight Activities",
    "content": "Under Article X Student Organization, Section 8 outlines strict requirements for off-campus and overnight activities. Authorization requires approval from OSAS, duly accomplished Notarized Parental Waivers for participating students, a letter of conformity from the adviser, and compliance with all CHED requirements.\n\nMandatorily, all off-campus and overnight activities must be attended by the faculty adviser. If the adviser is unavailable, a replacement faculty member may be designated, provided SAS is informed two days prior. The Institute imposes a ratio of one faculty adviser or guardian for every 30 or fewer student participants per activity.",
    "keywords": [
      "off-campus activity",
      "parental waiver",
      "faculty adviser ratio",
      "overnight activity",
      "CHED compliance"
    ]
  },
  {
    "id": "art_10_sec_9_fund_raising",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Rules on Fund Raising Activities",
    "content": "Under Article X Student Organization, Section 9 stipulates that recognized student organizations may sponsor only **one (1) fundraising activity per school year**. Applications must be submitted to the Director of SAS or College Dean at least thirty (30) days before the scheduled date. The application must include a Letter of Request, Project Proposal and IGP Form, list of beneficiaries, endorsements from the Dean and SAS Director, and a resolution from the organization's officers.\n\nRegarding financial accountability, an audited financial report certified by the faculty adviser must be submitted to OSAS within five (5) days after the activity. Failure to submit this report is grounds for prohibiting future activities. The SAS Director reserves the right to re-audit the report.",
    "keywords": [
      "fundraising limit",
      "IGP form",
      "financial audit",
      "fundraising application"
    ]
  },
  {
    "id": "art_10_sec_10_faculty_adviser",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Faculty Adviser Qualifications and Tenure",
    "content": "Under Article X Student Organization, Section 10 requires each student organization to have an Adviser who is a full-time faculty member of EARIST with at least one year of residency. For college-based organizations, the Dean designates the adviser. For institutional organizations, the OSAS Director designates the adviser upon the organization's recommendation.\n\nA faculty adviser is limited to advising only one (1) organization. Their term is for one school year but is renewable. Advisers for curricular organizations must be involved in the specific academic area, while advisers for extra-curricular organizations must be knowledgeable in that particular field.",
    "keywords": [
      "faculty adviser qualifications",
      "adviser term",
      "adviser limit",
      "full-time faculty"
    ]
  },
  {
    "id": "art_10_sec_12_financial_fees_bank",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Financial Rules, Membership Fees, and Bank Accounts",
    "content": "Under Article X Student Organization, Section 12 outlines financial regulations. Only accredited organizations can collect voluntary membership fees. The fee for College-Based Organizations shall not exceed **One Hundred Pesos (P100.00)** per school year. Increases must be agreed upon by the majority, confirmed by the Dean, and approved by the President.\n\nOrganizations must open an account in a government depository bank if funds accumulate to at least P10,000. Signatories for withdrawals include the Organization President or Treasurer as one signatory. The co-signatory is the College Dean (or approved faculty) for college-based groups, or the OSAS Director for Institute organizations. Resolutions signed by a majority of officers are required for withdrawals. Officers with financial liabilities must pay the exact amount to the Financial Management Services (FMS). New officers must file cases against former officers with pending obligations before the Grievance Committee.",
    "keywords": [
      "membership fee limit",
      "P100 limit",
      "bank account requirement",
      "signatories",
      "financial liability",
      "government depository bank"
    ]
  },
  {
    "id": "art_10_sec_13_16_posting_awards_digital",
    "source": "EARIST Student Handbook",
    "category": "Article X - Student Organization",
    "topic": "Postings, Digital Submission, and Awards",
    "content": "Under Article X Student Organization, Sections 13 through 16 cover miscellaneous policies. Posters and notices must be approved by OSAS and posted only on freedom boards. Regarding digital services, all SAS announcements are posted on official social media, and accreditation/proposal documents must be sent via the official OSAS email.\n\nThe Institute grants various recognition and awards to students and organizations for outstanding performance. These include:\n* **Academic Awards:** Summa Cum Laude, Magna Cum Laude, Cum Laude, and Academic Excellence.\n* **Service Awards:** Outstanding Student Organization and Outstanding Leader.\n* **Other Awards:** Cultural Awards, Sports and Development Awards, Research Awards, and Monetary Incentives for National Recognition (PRC/Government Exams) or Skills Competitions.",
    "keywords": [
      "freedom boards",
      "OSAS email",
      "academic awards",
      "service awards",
      "monetary incentives",
      "posting rules"
    ]
  },
  {
    "id": "art_11_policy_scope_legal_basis",
    "source": "EARIST Student Handbook",
    "category": "Article XI - Guidelines on Campus Publication",
    "topic": "Policy, Goals, Scope, and Legal Basis",
    "content": "Under Article XI Guidelines on Campus Publication, the Institute recognizes the right of students to free expression as embodied in the Constitution. The Institute encourages quality publications to disseminate information, creative ideas, research results, opinions, and constructive criticisms. The goals of student publications include representing the interests of the academe, stimulating responsible advocacy, fostering goodwill, and promoting intellectual excellence and truth.\n\nThese publications are coordinated by the Office of Student Affairs and Services (OSAS) through the Chief of Student Publication. The scope of student publication covers all printed matters produced by students, such as newspapers, magazines, yearbooks, journals, and newsletters. The authority of the Student Publication as the publisher must be recognized at all times in compliance with the Editorial Policies approved by the Board of Editors and in accordance with Republic Act 7079 (Campus Journalism Act). The Editorial Policy must be reviewed to adopt updated practices and abide by legal mandates.",
    "keywords": [
      "free expression",
      "RA 7079",
      "Campus Journalism Act",
      "OSAS coordination",
      "scope of publication",
      "editorial policy"
    ]
  },
  {
    "id": "art_11_appointments_printing_discipline",
    "source": "EARIST Student Handbook",
    "category": "Article XI - Guidelines on Campus Publication",
    "topic": "Appointments, Printing, E-Publication, and Discipline",
    "content": "Under Article XI Guidelines on Campus Publication, specific rules govern staffing, printing, and discipline. The Publication Chief and Technical Adviser are appointed by the Institute President. Specifically, the Technical Adviser is appointed based on the recommendation of the Board of Editors, who must submit three nominees to the Director of Student Affairs and Services (SAS) for endorsement. The Editorial Board is fully and solely responsible for published materials, with technical guidance from the Adviser.\n\nRegarding production, the printing of the publication by a private printer must be conducted by the editorial board through canvass or bidding. The Student Publication Office is required to provide software for students to convert print materials to E-publication, complying with CHED CMO No. 8 series 2021. Honoraria for the board and staff are charged to the publication fund subject to accounting rules.\n\nRegarding discipline, violations of publication policies or professional journalism standards are subject to suspension or expulsion from the staff. Extreme cases may face disciplinary action by the EARIST Grievance Committee.",
    "keywords": [
      "Technical Adviser appointment",
      "Board of Editors",
      "printing bidding",
      "E-publication",
      "CHED CMO No. 8",
      "honoraria",
      "journalism ethics"
    ]
  },
  {
    "id": "art_11_funding_financial_management",
    "source": "EARIST Student Handbook",
    "category": "Article XI - Guidelines on Campus Publication",
    "topic": "Funding, Banking, and Financial Management",
    "content": "Under Article XI Guidelines on Campus Publication, funding is derived from student subscriptions, advertisements, donations, and grants. Subscription fees are collected during the enrollment period and must be approved by the EARIST Board of Trustees (or as stipulated in RA 10931) after consultation with the student body. These funds are for the exclusive use of the publication, covering printing costs, supplies, transport, press conference attendance, and staff allowances.\n\nRegarding financial management, the Student Publication is required to open a passbook checking account in a government depository bank. Withdrawals require two signatories: one must be the Editor-in-Chief or Managing Editor, and the co-signatory must be the Director of Student Affairs and Services (SAS). The publication is required to submit financial statements to both the Office of Student Affairs and Services (OSAS) and Financial Management Services (FMS).",
    "keywords": [
      "publication funding",
      "subscription fees",
      "government depository bank",
      "check signatories",
      "financial statements",
      "RA 10931"
    ]
  },
  {
    "id": "art_12_religious_activities_interfaith_guidelines",
    "source": "EARIST Student Handbook",
    "category": "Article XII - Guidelines on Religious Activities",
    "topic": "Interfaith Services and Religious Freedom",
    "content": "Under Article XII Guidelines on Religious Activities, the Institute defines Interfaith Services as the provision of an environment conducive to freely expressing one's religious orientation in accordance with institutional principles. The Institution respects the establishment of religion and the free exercise thereof, allowing religious profession and worship without discrimination, provided it is not harmful to academic goals or violative of existing policies. No religious test is required for the exercise of civil and political rights.\n\nThe Institute Chapel maintains an interfaith character reserved for faith activities with due respect to God. Consequently, classrooms and other facilities cannot be used by religious groups without permission from the concerned Institute authority. The Institute encourages imploring the aid of the Almighty God to build a just and humane society and promotes ecumenism and unity of the faithful on campus.",
    "keywords": [
      "Interfaith Services",
      "Institute Chapel",
      "religious freedom",
      "ecumenism",
      "campus ministry"
    ]
  },
  {
    "id": "art_13_cultural_programs_procedures",
    "source": "EARIST Student Handbook",
    "category": "Article XIII - Guidelines on Cultural Programs/Activities",
    "topic": "Procedures for Cultural Activities",
    "content": "Under Article XIII Guidelines on Cultural Programs/Activities, every proposed cultural program or activity must be in pursuit of the objectives of the Academe. Prior approval must be secured from the Office of the President through the Office of the Vice President for Academic Affairs (VPAA), as recommended by the Office of Student Affairs and Services (OSAS).\n\nAny bonafide faculty member, administrative employee, or student organization desiring to present a cultural program must submit requirements to OSAS through the EARIST Cultural Affairs Division (ECAD) and the Income Generating Project (IGP) Office. These requirements include a letter of request, tentative program, production staff list, budget estimates, and sources of funding. The letter of request must state the title, description, objectives, dates, time, venue, and bear the signatures of authorized representatives and advisers.\n\nThe ECAD acts upon the request by making recommendations to OSAS and informing the requesting organization of the approval status. Project proponents must inform ECAD of any intended changes two days prior to the presentation. Five days after the activity, proponents are required to submit documentation for record purposes.",
    "keywords": [
      "cultural programs",
      "ECAD",
      "event approval",
      "OSAS recommendation",
      "IGP Office"
    ]
  },
  {
    "id": "art_14_sec_1_3_cultural_program_reiteration",
    "source": "EARIST Student Handbook",
    "category": "Article XIV - Right to Proper Information",
    "topic": "Cultural Program Requirements (Reiteration)",
    "content": "Under Article XIV Right to Proper Information, Sections 1 through 3 reiterate the protocols for cultural programs. Every proposed cultural program or activity must pursue the objectives of the Academe and requires prior clearance from the Office of the President through the Office of Student Affairs and Services (OSAS). Any bonafide faculty, administrative employee, or student desiring to present a cultural activity must submit a letter of request, tentative program, production staff list, and budget estimates to OSAS through the EARIST Cultural Affairs Division (ECAD) and IGP Office.",
    "keywords": [
      "cultural program clearance",
      "ECAD submission",
      "student event requirements"
    ]
  },
  {
    "id": "art_14_social_media_posting_guidelines",
    "source": "EARIST Student Handbook",
    "category": "Article XIV - Right to Proper Information",
    "topic": "Posting on Official Social Media Accounts",
    "content": "Under Article XIV Right to Proper Information, the Institute outlines guidelines for Posting of Advertisement Materials on Official Social Media Accounts. EARIST uses social media to supplement marketing efforts and encourages students to share Institute news. However, students mentioning EARIST or sharing its information are automatically considered representatives of the Institute and must understand the implications of their posts.\n\nThe Institute reserves the right to request the removal of content from an official social media account if it poses a risk to the reputation of the Institute, its employees, or students. Permission to post digital materials is granted subject to specific conditions: the press must not be used for unlawful or divisive purposes, and materials must not violate contemporary ethical or moral standards. Procedurally, all digital materials and announcements must bear the signature of the SAS Director and be endorsed to the Information and Public Affairs Services (InfoPAS) Director for posting.",
    "keywords": [
      "social media policy",
      "InfoPAS",
      "digital materials",
      "student representatives",
      "reputation management"
    ]
  },
  {
    "id": "art_14_campus_advertisement_installation",
    "source": "EARIST Student Handbook",
    "category": "Article XIV - Right to Proper Information",
    "topic": "Installation of Advertisement Materials on Campus",
    "content": "Under Article XIV Right to Proper Information, permits to post announcements within school premises are subject to strict guidelines. All announcements must bear the signature of the SAS Director before posting and are restricted to bulletin boards or designated areas approved by the SAS Office. The SAS Director reserves the right to approve or reject the kind of announcement to be posted.\n\nContent requirements dictate that posters must not violate ethical or moral standards and must be neat, clean, clear, and concise, avoiding excessive aesthetics. Posters must indicate the name of the responsible individual, group, or organization. The responsible party is liable for removing the posters after they have served their purpose and for any damage to the posting area. Furthermore, permits to install banners or tarpaulins are granted only upon compliance with prescribed conditions.",
    "keywords": [
      "posting announcements",
      "bulletin boards",
      "poster guidelines",
      "SAS Director approval",
      "banner permit"
    ]
  },
  {
    "id": "art_14_logo_trademark_usage",
    "source": "EARIST Student Handbook",
    "category": "Article XIV - Right to Proper Information",
    "topic": "Use of EARIST Logo and Trademarks",
    "content": "Under Article XIV Right to Proper Information, strict rules govern the Use of EARIST Logo and Trademarks. Any individual, group, or organization wishing to use or imitate the EARIST Logo, or use a strikingly similar seal in documents, goods, or services, must secure a permit from the Information and Public Affairs Services (InfoPAS) Office. \n\nSpecific approval from InfoPAS is required for the use or selling of the logo on products, merchandise, or services distributed to the public. This applies to three categories: 1) Institutional collateral such as calling cards, brochures, and letterheads; 2) Souvenir items or merchandise like jackets, t-shirts, mugs, and stickers; and 3) Institutional advertisements including posters, billboards, print ads, and electronic ads.",
    "keywords": [
      "EARIST logo",
      "trademark usage",
      "InfoPAS permit",
      "institutional collateral",
      "merchandise licensing"
    ]
  },
  {
    "id": "art_15_international_affairs_services",
    "source": "EARIST Student Handbook",
    "category": "Article XV - International Affairs Services",
    "topic": "OIAS Functions and International Linkages",
    "content": "Under Article XV, the Office of the International Affairs Service (OIAS) serves as the technical secretariat assisting the academe in implementing education, student mobility, and internship matters involving international organizations. OIAS coordinates all international dimensions of EARIST in compliance with CHED Memorandum Order 55, Series of 2016.\n\nSection 1 defines International Linkages, including: the Exchange Visitors Program (Mutual Education and Cultural Exchange Act); the Cultural Exchange Program (promoting mutual understanding via exchange of students/artists); the Study Abroad Program; and Academic Short Courses leading to degrees or certificates. Section 2 defines International Internship as the application of classroom learning to actual work abroad (commercial, industrial, government, or non-government) for the purpose of completing an academic degree, with a duration ranging from six (6) months to one (1) year.",
    "keywords": [
      "OIAS",
      "International Internship",
      "Study Abroad Program",
      "Exchange Visitors Program",
      "CMO 55 Series 2016"
    ]
  },
  {
    "id": "art_16_effectivity_clause",
    "source": "EARIST Student Handbook",
    "category": "Article XVI - Effectivity",
    "topic": "Handbook Effectivity",
    "content": "Under Article XVI Effectivity, the Student Handbook takes effect immediately upon approval by the Board of Trustees. The policies and regulations contained within the handbook apply to all bona fide students of the Institute.",
    "keywords": [
      "handbook effectivity",
      "Board of Trustees approval",
      "bona fide students"
    ]
  },
  {
    "id": "institutional_identity_hymn_pledge",
    "source": "EARIST Student Handbook",
    "category": "Institutional Identity",
    "topic": "EARIST Hymn, Inang Paaralan, and Pledge of Loyalty",
    "content": "The EARIST Hymn lyrics are as follows: 'Let the EARIST music fill the air, With the echo our spirit rise. There's a magic that will stir the hearts When we sing our lively, tuneful march. What a joy to sing the music gay, When it sounds with a beat of martial air. Let the call of duty we obey, And the service we give every day. EARIST, your name is in our hearts, EARIST, our love will always spark. We pledge to stand by you, thru our Noble thoughts and deeds, To give you our love and loyalty forever. E.A.R.I.S.T. – EARIST, Forever!'\n\nThe Inang Paaralan (Alma Mater Song) lyrics are: 'Ating lilisanin, Paaralan, Inang Paaralan, Paaralang mahal. Kamag-aral at mga guro, Gunita sa tuwina'y Laging alaala, Lalagi sa dibdib. Kami'y pinagpala, Tapos na ang aral. Sa aming paglisan, Ngunit itiya'y simula Tungo sa tagumpay, Pagsisikap sa buhay. Paalam, paalam, Paaralang Mahal, Hanggang magtagumpay. Inang Paaralan, Rodriguez, naming mahal.'\n\nThe Pledge of Loyalty states: 'With all sincerity and freedom from pride, I hereby pledge my loyalty to my School and reiterate my love to my Country and people. To my Alma Mater, I solemnly promise to hold high its ideals and keep its noble traditions. I will strive with others to share all the knowledge and power that I have at my command, so necessary in the reconstruction of our nation’s economy. And finally, I resolve with a sober sense of responsibility to dedicate myself to the service of the Republic and the well-being of its citizenry. May God bless our Alma Mater and its graduates forever.'",
    "keywords": [
      "EARIST Hymn",
      "Inang Paaralan",
      "Pledge of Loyalty",
      "lyrics",
      "alma mater song"
    ]
  },
  {
    "id": "definition_terms_a_f",
    "source": "EARIST Student Handbook",
    "category": "Definition of Terms",
    "topic": "Terms A to F",
    "content": "Under the Definition of Terms section, the following terms are defined for academic and administrative contexts:\n\nAbsent refers to the act of not being present in a class. An Academic Degree is a course of study in a particular educational institution. Academic Honors are awards given to students with distinction, such as Summa, Magna, or Cum Laude. Academic Load is the number of subjects or courses a student is enrolled in. An Academic Program is a course or study taken at an educational institution. Accreditation is a concept based on self-regulation, focusing on evaluation and the continuous improvement of educational quality. Activity refers to something done that involves a group of people. Admission is the act of admitting or allowing a student to enroll. Attendance is the act of being physically present in class.\n\nA Baccalaureate Degree refers to any four- or five-year program of study. A Class is a series of meetings where students are taught a particular subject or activity, or a group of students instructed together. College refers to the tertiary level of education. A Complaint is a verbal or written statement expressing dissatisfaction. Conduct refers to the way a person behaves in a particular place or situation. Cross Enroll means to enroll in courses from one school while attending another. Curriculum is the systematic sequence of courses required for graduation. Dean is the person appointed in charge of a college. Director is a person who manages or supervises an institution. Discipline refers to control requiring rules to be obeyed. Dismissal is the discharge or removal from enrollment. Doctor refers to a person with a doctoral degree. Dropped refers to withdrawal from a course within a given period. Dropped Grade is a grade given to a student who voluntarily dropped a course at least two weeks after classes started. Examination is a test to assess progress. Expulsion is forcibly removing a student from an institution with justifiable cause. Failed Grade is a grade given to a student who does not meet passing requirements.",
    "keywords": [
      "Academic Degree",
      "Academic Load",
      "Accreditation",
      "Cross Enroll",
      "Dropped Grade",
      "Expulsion",
      "Failed Grade"
    ]
  },
  {
    "id": "definition_terms_f_p",
    "source": "EARIST Student Handbook",
    "category": "Definition of Terms",
    "topic": "Terms F to P",
    "content": "Under the Definition of Terms section, the following terms are defined:\n\nFee is an amount of money to be paid for enrollment or services in a given semester. Fifth Year refers to a student in their fifth year of study. Final Examination is an examination given before the end of a school term. Form is a printed document to be completed by anyone in the institution. Freshman is a first-year student. Grade is a mark given to a student reflecting academic performance. Graduate refers to a student who has successfully completed a level of education and earned a degree. Incomplete Grade (INC) is a temporary grade given to a student who may qualify for passing but has not fulfilled all requirements of a subject.\n\nInstitutional Student Programs and Services are designs to proactively respond to the basic health, food, shelter, and safety needs of all types of students. An Irregular Student is one who carries less than the full load and/or has back subjects required in a given semester. Junior is a third-year student. Master's refers to a master’s degree. Midterm Examination is given in the middle of the semester. Miscellaneous refers to additional fees aside from tuition fees. Offense is something that is wrong or improper. Official is a person who holds an office in an educational institution.\n\nPaying Students are defined as students who are overstaying, not able to finish their program within the prescribed period, and considered ineligible to avail of free tertiary education. Penalty is a punishment for breaking a rule. Policy refers to rules or procedures to be observed. President is the head of the school. Probation is a situation where a person who made a serious mistake is placed under supervision.",
    "keywords": [
      "Paying Students",
      "Irregular Student",
      "Incomplete Grade",
      "Institutional Student Programs",
      "Probation",
      "tuition eligibility"
    ]
  },
  {
    "id": "definition_terms_o_v",
    "source": "EARIST Student Handbook",
    "category": "Definition of Terms",
    "topic": "Terms O to V (OJT to Vocational)",
    "content": "Under the Definition of Terms section, the following terms are defined:\n\nOn-the-Job Training / Practicum / Internship / Immersion is a requirement for graduating students prescribed in the school’s curriculum. Organization refers to an organized group or body for a particular course or purpose. Rectification of Grades is the process of correcting incorrect entries in academic records. Refund is the return of certain fees within a prescribed period. Registration is the act of entering information into official records. Registrar is the officer in charge of registering students and maintaining academic records. Retention is the continued enrollment in school from one academic year to the next. Returnee is a student who failed or left a particular year level and wishes to be re-admitted.\n\nScholarship is financial assistance provided to defray educational expenses. School is an institution recognized by the state that undertakes educational operations. Senior is a fourth-year student. Shifter is a student who changes from one course to another. Sophomore is a second-year student. Special Student is a student enrolled at the tertiary level who is not earning formal academic credits. Student refers to a person currently enrolled and attending classes regularly. Student Handbook is the publication containing rules and policies.\n\nStudent Affairs and Services (SAS) are programs designed to complement student academic experiences and promote well-being. Student Welfare Services are basic services for well-being. Student Development Services are programs for student formation and discipline. Substitution is the act of replacing one thing with another. Suspension is the act of temporarily forcing a student to leave school due to an offense. Teacher is a person employed to guide learning experiences. Tertiary Students are those who enjoy free tertiary education and are enrolled in undergraduate degrees. Tenure is the length of stay of a student in the institution. Transcript of Records is the official record of grades. Transferee is a student entering from another school. Tuition is money paid for the right to study. Undergraduate is a student who has not yet earned a degree. Violation is the act of doing something not allowed by rule. Vocational relates to special skills or training for a job.",
    "keywords": [
      "Rectification of Grades",
      "Returnee",
      "Shifter",
      "Special Student",
      "SAS",
      "Tenure",
      "Tertiary Students",
      "Transcript of Records"
    ]
  },
  {
    "id": "list_abbreviations",
    "source": "EARIST Student Handbook",
    "category": "List of Abbreviations",
    "topic": "Acronyms and Abbreviations",
    "content": "The List of Abbreviations section defines the acronyms used throughout the handbook and Institute operations:\n\nCWTS stands for Civic Welfare Training Service. CSG stands for College Student Government. DRP stands for Dropped. EARIST stands for Eulogio 'Amang' Rodriguez Institute of Science and Technology. EARMSAT stands for Eulogio 'Amang' Rodriguez Memorial School of Arts and Trades. ECAD stands for EARIST Cultural Affairs Division. EARISTCAT stands for EARIST College Admission Test. ECC stands for EARIST Cavite Campus. ERVHS stands for Eulogio Rodriguez Vocational High School. ESG stands for EARIST Student Government. FMS stands for Financial Management Services. GASAT stands for General Alvarez School of Arts and Trades. GWA stands for General Weighted Average. INC stands for Incomplete Grade. ISG stands for Institute Student Government. LTS stands for Literacy Training Services. MTS stands for Military Training Services. NSTP stands for National Service Training Program. OJT stands for On-the-Job Training. SAS stands for Student Affairs and Services. PE stands for Physical Education. ROTC stands for Reserve Officer Training Corps. SARRMS stands for Student Admission, Registration, and Records Management Services. SPDE stands for Sports and Physical Development Education. VPAA stands for Vice President for Academic Affairs. VPAF stands for Vice President for Administration and Finance. VPREIA stands for Vice President for Production, Research, Extension, and International Affairs.",
    "keywords": [
      "EARIST acronyms",
      "SARRMS",
      "VPREIA",
      "CWTS",
      "LTS",
      "MTS",
      "NSTP",
      "ISG",
      "CSG"
    ]
  }
]