[
  {
    "id": "admission_update_2025_cbpa",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Business and Public Administration (CBPA) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Business and Public Administration (CBPA) offers the following programs: Bachelor of Science in Office Administration (BSOA), Bachelor of Science in Business Administration (Major in Marketing Management, Human Resource Management), Bachelor of Science in Entrepreneurship (BSEntrep), and Bachelor of Science in Public Administration (BPA). The admission qualifications for these programs require that applicants have no grades lower than 80 in all subjects and possess a General Weighted Average (GWA) of 90% or above.",
    "keywords": [
      "CBPA",
      "BSOA",
      "Business Administration",
      "Entrepreneurship",
      "Public Administration",
      "GWA 90",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_cas",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Arts and Sciences (CAS) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Arts and Sciences (CAS) has specific qualifications for its programs. The Bachelor of Science in Psychology requires no grades lower than 85 in all subjects, a General Weighted Average (GWA) of 90% or above, and prefers applicants from HUMSS or STEM strands. The Bachelor of Science in Applied Physics and the Bachelor of Science in Mathematics require no grades lower than 80 in all subjects.",
    "keywords": [
      "CAS",
      "Psychology",
      "Applied Physics",
      "Mathematics",
      "HUMSS",
      "STEM",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_ccs",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Computing Studies (CCS) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Computing Studies (CCS) offers the Bachelor of Science in Computer Science (BSCS) and the Bachelor of Science in Information Technology (BS INFO.TECH). The admission qualifications for these programs mandate that applicants must have no grades lower than 80 in all subjects and must have a General Weighted Average (GWA) of 90% or above.",
    "keywords": [
      "CCS",
      "Computer Science",
      "Information Technology",
      "BSCS",
      "BSIT",
      "GWA 90",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_cafa",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Architecture and Fine Arts (CAFA) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Architecture and Fine Arts (CAFA) lists specific requirements for its degrees. The Bachelor of Science in Architecture (BS ARCHI.) and Bachelor of Science in Interior Design (BSID) both require no grades lower than 85 in all subjects and a General Weighted Average (GWA) of 90%. The Bachelor of Fine Arts (BFA), with majors in Painting and Visual Communication, requires a General Weighted Average (GWA) of 85%.",
    "keywords": [
      "CAFA",
      "Architecture",
      "Interior Design",
      "Fine Arts",
      "Painting",
      "Visual Communication",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_ced",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Education (CED) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Education (CED) offers the Bachelor of Secondary Education (BSE) with majors in Filipino (preferably HUMSS), Mathematics (preferably STEM), and Science (preferably STEM). Additionally, it offers the Bachelor of Technology and Livelihood Education (BTLEd) with majors in Home Technology (TVL Track) and Industrial Arts (TVL Track), as well as the Bachelor of Special Needs Education (BSNed) Generalist (preferably HUMSS). The qualification across these programs requires no grades lower than 80 in all subjects.",
    "keywords": [
      "CED",
      "Education",
      "BSE",
      "BTLEd",
      "Special Needs Education",
      "TVL Track",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_ccje",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Criminal Justice Education (CCJE) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Criminal Justice Education (CCJE) offers the Bachelor of Science in Criminology (BSCrim). The admission qualifications are strict: applicants must have no grades lower than 85 in all subjects, a General Weighted Average (GWA) of 90% or above, and must meet the height requirement of 5'0\" for females and 5'2\" for males.",
    "keywords": [
      "CCJE",
      "Criminology",
      "BSCrim",
      "height requirement",
      "GWA 90",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_cit",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Industrial Technology (CIT) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Industrial Technology (CIT) offers the Bachelor of Industrial Technology with majors in Apparel and Fashion Technology, Automotive Technology, Computer Technology, Drafting Technology, Electrical Technology, Electronics Technology, Food Trades, Industrial Chemistry, Mechanical Technology, and Heating, Ventilating and Air-Conditioning Technology. The qualification for admission requires no grades lower than 80 in all subjects.",
    "keywords": [
      "CIT",
      "Industrial Technology",
      "Automotive",
      "Electronics",
      "Food Trades",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_chtm",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Hospitality and Tourism Management (CHTM) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Hospitality and Tourism Management (CHTM) offers the Bachelor of Science in Tourism Management (BST) and the Bachelor of Science in Hospitality Management (BSHM). Admission qualifications require no grades lower than 80 in all subjects, a General Weighted Average (GWA) of 85% or above, and a height requirement of 5'4\" for females and 5'6\" for males.",
    "keywords": [
      "CHTM",
      "Tourism Management",
      "Hospitality Management",
      "height requirement",
      "GWA 85",
      "admission requirements 2025"
    ]
  },
  {
    "id": "admission_update_2025_cen",
    "source": "EARIST Admission Posters A.Y. 2025-2026",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "College of Engineering (CEN) Programs & Qualifications",
    "content": "According to the EARIST Admission A.Y. 2025-2026 updates, the College of Engineering (CEN) offers Bachelor of Science degrees in Chemical Engineering (BSChE), Electrical Engineering (BSEE), Civil Engineering (BSCE), Mechanical Engineering (BSME), Computer Engineering (BSCoE), and Electronics and Communication Engineering (BSECE). The admission qualifications are the most rigorous among the colleges, requiring no grades lower than 88 in all subjects and a General Weighted Average (GWA) of 90% or above.",
    "keywords": [
      "CEN",
      "Engineering",
      "Civil Engineering",
      "Mechanical Engineering",
      "Computer Engineering",
      "GWA 90",
      "admission requirements 2025"
    ]
  },
  {
    "id": "earist_official_college_facebook_pages",
    "source": "Official University Social Media Directory",
    "category": "University Directory & Communications",
    "topic": "Official College Facebook Pages",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST) maintains official Facebook pages for its various colleges to facilitate communication and information dissemination. The official link for the College of Computing Studies (CCS) is https://www.facebook.com/tatakComsa. The College of Architecture and Fine Arts (CAFA) is accessible at https://www.facebook.com/cafaearistofficial. The College of Arts and Sciences (CAS) page is found at https://www.facebook.com/amazingcas. The College of Business and Public Administration (CBPA) is located at https://www.facebook.com/earist.cbpa. The College of Education (CED) uses the link https://www.facebook.com/EARIST.CED.Official. The College of Engineering (CEN) is accessible via https://www.facebook.com/CENSGEARIST. The College of Criminal Justice Education (CCJE) is located at https://www.facebook.com/EARIST.CCJE. The College of Hospitality and Tourism Management (CHTM) can be reached at https://www.facebook.com/CHTMOfficial. Finally, the College of Industrial Technology (CIT) is found at https://www.facebook.com/profile.php?id=100076321872710&sk=about.",
    "keywords": [
      "facebook pages",
      "social media links",
      "CCS",
      "CAFA",
      "CAS",
      "CBPA",
      "CED",
      "CEN",
      "CCJE",
      "CHTM",
      "CIT"
    ]
  }
]