[
  {
    "id": "official_earist_executive_officials_2025",
    "source": "EARIST Website (Nov 20, 2025)",
    "category": "EARIST Administration",
    "topic": "Executive Officials and Vice Presidents",
    "content": "According to the official EARIST Website as of November 20, 2025, the Executive Officials leading the Institute are defined as follows: Dr. Rogelio T. Mamaradlo serves as the Institute President and concurrently acts as the Interim Dean for the College of Engineering. Dr. Allan Q. Quismundo holds the position of Executive Vice President and is the Officer-in-Charge (OIC) Dean of the Graduate School. Dr. Eric C. Mendoza is the Vice President for Academic Affairs. Dr. Yolanda A. Lara serves as the Vice President for Administration and Finance and is also the Director of Financial Management Services. Ms. Gilda S. Familara serves as the College and Board Secretary.",
    "keywords": [
      "Dr. Rogelio T. Mamaradlo",
      "Dr. Allan Q. Quismundo",
      "Dr. Eric C. Mendoza",
      "Dr. Yolanda A. Lara",
      "Institute President",
      "Vice President",
      "Board Secretary"
    ]
  },
  {
    "id": "official_earist_college_deans_2025",
    "source": "EARIST Website (Nov 20, 2025)",
    "category": "EARIST Administration",
    "topic": "College Deans and Campus Administrators",
    "content": "According to the official EARIST Website as of November 20, 2025, the following officials serve as Deans of the various Colleges: Ar. Diane A. Jose is the Dean of the College of Architecture and Fine Arts (CAFA). Mrs. Rodora T. Oliveros is the Dean of the College of Arts and Sciences (CAS). Dr. Willy O. Gapasin leads the College of Business and Public Administration (CBPA). Dr. Jesus S. Paguigan is the Dean of the College of Computing Studies (CCS). Dr. Anabel D. Riva serves as the Dean of the College of Criminal Justice (CCJ). Dr. Evangeline M. Sangalang is the Dean of the College of Education (CED). Dr. Maria Rhoda D. Dinaga is the Dean of the College of Hospitality and Tourism Management (CHTM). Dr. Erwin P. Ordovez is the Dean of the College of Industrial Technology (CIT). Additionally, Dr. Agnes N. Coo serves as the Administrator for the EARIST Cavite Campus. Note that the College of Engineering is led by Interim Dean Dr. Rogelio T. Mamaradlo, and the Graduate School is led by OIC-Dean Dr. Allan Q. Quismundo.",
    "keywords": [
      "College Deans",
      "Cavite Campus Administrator",
      "CAFA Dean",
      "CAS Dean",
      "CBPA Dean",
      "CCS Dean",
      "CCJ Dean",
      "CED Dean",
      "CHTM Dean",
      "CIT Dean"
    ]
  },
  {
    "id": "official_earist_directors_admin_research_2025",
    "source": "EARIST Website (Nov 20, 2025)",
    "category": "EARIST Administration",
    "topic": "Directors of Administrative, Research, and Academic Support",
    "content": "According to the official EARIST Website as of November 20, 2025, the Directors for Administrative, Research, and Academic Support Services include: Dr. Giovanni L. Ahunin as Director of Administrative Services; Dr. Marlene M. Monterona as Director of Research Development Services; Dr. Eriberto R. Astorga Jr. as Director of Extension and Community Services; Ms. Jocelyn R. Moreno as Director of Production Services; Ms. Carina N. Romaquin as Director of Library Services; Mr. Blue Archimedes B. Santos as Director of the National Service Training Program (NSTP); and Mr. Benigno A. Castillo as Director of Quality Assurance.",
    "keywords": [
      "Director of Administrative Services",
      "Research Director",
      "Extension Services",
      "Library Director",
      "NSTP Director",
      "Quality Assurance Director"
    ]
  },
  {
    "id": "official_earist_directors_student_ops_2025",
    "source": "EARIST Website (Nov 20, 2025)",
    "category": "EARIST Administration",
    "topic": "Directors of Student Services, Records, and Operations",
    "content": "According to the official EARIST Website as of November 20, 2025, the Directors managing Student Services, Records, and Operations include: Ms. Julie Ann O. Espiritu as the Director of Student Registration and Records Management Services (SRRMS/Registrar). Ms. Agnes F. Amorin serves as the Director of Student Affairs and Services (SAS). Mr. Virgel E. Diamante is the Director of Instruction Services. Dr. Melba S. Asuncion is the Director of Internal Audit Services. Engr. Roberto M. Liwanag acts as the Director of Planning Services. Ar. Maundelito S. Florendo is the Director of the Project Management Unit. Engr. Ronald B. Baral serves as the Director of Management Information Services (MIS).",
    "keywords": [
      "SRRMS Director",
      "Registrar",
      "SAS Director",
      "MIS Director",
      "Planning Director",
      "Instruction Services",
      "Internal Audit"
    ]
  },
  {
    "id": "official_earist_directors_external_specialized_2025",
    "source": "EARIST Website (Nov 20, 2025)",
    "category": "EARIST Administration",
    "topic": "Directors of External Relations, InfoPAS, and Business Development",
    "content": "According to the official EARIST Website as of November 20, 2025, the Directors for Specialized Services, External Relations, and Business Development are: Engr. Jerome M. Saltorio, who serves as the Director for Information and Public Affairs Services (InfoPAS), Intellectual Property Management, and the Innovation Technology Support Office. Dr. Joselito D. Mabansag is the Director of International Affairs and Linkages Management Services and OIC of Institutional Events Management and Protocol. Dr. Hiromi T. Kikuchi serves as the Director of the Business Development Center.",
    "keywords": [
      "InfoPAS Director",
      "International Affairs Director",
      "Business Development",
      "Innovation Technology Support",
      "Public Affairs"
    ]
  },
  {
    "id": "official_earist_board_trustees_2025",
    "source": "EARIST Website (Nov 20, 2025)",
    "category": "EARIST Administration",
    "topic": "Board of Trustees Composition",
    "content": "According to the official EARIST Website as of November 20, 2025, the Board of Trustees (BOT) is the governing body of the Institute, composed of the following officials:\n\nThe Chairman of the Board is Hon. Dr. Desiderio Apag, III, who serves as the CHED Commissioner. The Vice Chairman is Hon. Rogelio T. Mamaradlo, the EARIST President.\n\nLegislative representatives include Hon. Alan Peter S. Cayetano (Member, Senate Committee on Education, Arts & Culture) and Hon. Mark O. Go (Member, Chair of the Committee of Higher and Technical Education).\n\nGovernment agency representatives include Hon. Engr. Romelen T. Tresvalles (Member, DOST-NCR Director) and Hon. Hazel Iris S. Baliatan (Member, Director IV, Public Investment Staff, NEDA).\n\nSectoral and Private representatives include:\n* Hon. Arnel S. Abrenica (Member, Private Sector Representative)\n* Hon. Allen R. Buenaventura (Member, Private Sector Representative)\n* Hon. Agnes F. Amorin (Member, EARIST Alumni Association Inc. President)\n* Hon. Carl Justine B. Dioquino (Member, Federated EARIST ISG President)\n\nThe Board Secretary is Ms. Gilda S. Familara.",
    "keywords": [
      "Board of Trustees",
      "BOT",
      "Desiderio Apag III",
      "Alan Peter Cayetano",
      "Mark O. Go",
      "Private Sector Representative",
      "Alumni President",
      "Student Regent",
      "Carl Justine B. Dioquino"
    ]
  },
  {
    "id": "earist_mis_support_contact",
    "source": "Official MIS Support Channel",
    "category": "Student Support Services",
    "topic": "Management Information Services (MIS) Support",
    "content": "The Management Information Services (MIS) at EARIST provides specific technical support for student portal and account issues. Students who encounter problems regarding uploading photos, forgotten accounts, waiting for emails, or unfinished applications are instructed to message or email the MIS team at mis.support@earist.edu.ph for assistance. The policy clarifies that for all other concerns outside of these specific technical issues, students must approach the Registrar's Office or the Admission Office.",
    "keywords": [
      "MIS",
      "mis.support@earist.edu.ph",
      "forgotten password",
      "account recovery",
      "technical support",
      "unfinished application"
    ]
  }
]