[
  {
    "id": "earist_cafa_bfa_painting_curriculum_years_1_and_2",
    "source": "BFA-PAINTING.pdf",
    "category": "Academic Curriculum",
    "topic": "Bachelor of Fine Arts (Painting) - First and Second Year Coursework",
    "content": "The EARIST College of Architecture and Fine Arts outlines the specific curriculum for the Bachelor of Fine Arts (Painting) program. This section details the course requirements, unit distributions, and prerequisites for the First and Second Years of the program.\n\nFor the First Year, First Semester, the total credited units are 26. The courses include: DRAWING1 (Drawing I, 3 units), GEKOMFIL (Kontekstwalisadong Komunikasyon sa Filipino, 3 units), GEPEMOVE (Movement Enhancement, 2 units), GEPURCO (Purposive Communication, 3 units), HISTWART (History of World Arts, 3 units), MATRALS1 (Materials I - Modeling 1, 3 units), NSTPROG1 (National Service Training Program 1, 3 units), TECHNOS1 (Techniques I - Freehand Drawing 1, 3 units), and VISPERC1 (Visual Perception 1 - Elements of Visual Arts, 3 units). All prerequisites are listed as 'None'.\n\nFor the First Year, Second Semester, the total credited units are 26. The courses include: DRAFTPER (Drafting and Perspective, 3 units), DRAWING2 (Drawing II, 3 units), GEMATHMW (Mathematics in the Modern World, 3 units), GEPANIPI (Panitikan sa Pilipinas / Philippine Literature, 3 units), GEPEFTE (Fitness Exercises, 2 units), MATRALS2 (Materials II - Modeling 2, 3 units), NSTPROG2 (National Service Training Program 2, 3 units), TECHNOS2 (Techniques II - Freehand Drawing 2, 3 units), and VISPERC2 (Visual Perception 2 - Concept of Visual Org., 3 units).\n\nFor the Second Year, First Semester, the total credited units are 23. The courses include: GEELECGS (Gender and Society, 3 units), GEELECIT (Living in Information Technology Era, 3 units), GEPEHEF1 (Physical Activity Towards Health and Fitness 1, 2 units), GESINEPP (Sinesosyedad/Pelikulang Panlipunan, 3 units), GEUNDETS (Understanding the Self, 3 units), MATRALS3 (Materials III - Concept, Techniques, Process, 3 units), TECHNQS3 (Techniques III - Color and Form 1, 3 units), and VISSTUD1 (Visual Studies 1 - Composition 1, 3 units).\n\nFor the Second Year, Second Semester, the total credited units are 26. The courses include: GEARTAPP (Art Appreciation, 3 units), GEELECCP (Communicative Proficiency in Business Correspondence and Research Writing, 3 units), GEETHICS (Ethics, 3 units), GEMATHMW (Mathematics in the Modern World, 3 units), GEPEHEF2 (Physical Activity Towards Health and Fitness II, 2 units), MATRALS4 (Materials IV - Continuation of Materials III, 3 units), ORIEARTS (Oriental Arts, 3 units), TECHNQS4 (Techniques IV - Color and Form 2, 3 units), and VISSTUD2 (Visual Studies 2 - Composition 2, 3 units).",
    "keywords": [
      "EARIST",
      "CAFA",
      "Bachelor of Fine Arts",
      "Painting",
      "Curriculum",
      "First Year",
      "Second Year",
      "Course Codes",
      "GE Courses",
      "Visual Perception",
      "Materials"
    ]
  },
  {
    "id": "earist_cafa_bfa_painting_curriculum_years_3_4_and_summary",
    "source": "BFA-PAINTING.pdf",
    "category": "Academic Curriculum",
    "topic": "Bachelor of Fine Arts (Painting) - Third and Fourth Year Coursework, Summer, and Summary",
    "content": "The EARIST College of Architecture and Fine Arts provides the advanced curriculum for the Bachelor of Fine Arts (Painting) program, covering the Third Year, Summer Term, and Fourth Year. This section also includes the program effectiveness date and total unit summary.\n\nFor the Third Year, First Semester, the total credited units are 24. The courses include: ADVISTU1 (Advanced Visual Studies 1 - Advanced Composition 1, 3 units), ARTTHEO1 (Art Theory 1, 3 units), ARTWORK1 (Art Workshop 1 - Adobe Photoshop, 3 units), BTAPHOTO (Basic to Advance Photography, 3 units), GECONTWO (The Contemporary World, 3 units), GEREADPH (Readings in Philippine History, 3 units), PAINTING1 (Painting 1 - Exploration and Analysis of Concept in Painting, 3 units), and PHILARTS (Philippine Art, 3 units).\n\nFor the Third Year, Second Semester, the total credited units are 24. The courses include: ADVISTU2 (Advanced Visual Studies 2 - Advanced Composition 2, 3 units), ARTTHEO2 (Art Theory 2, 3 units), ARTWORK2 (Art Workshop 1 - Corel Draw, 3 units), FASHDES (Costume & Fashion Design, 3 units), GACULHER (Gallery Visit and Cultural Heritage Tour, 3 units), GEELECDS (Practical Data Science, 3 units), GESCIENTS (Science and Technology, 3 units), and PAINTING2 (Painting 2 - Portfolio Presentation, 3 units).\n\nDuring the Summer term following the Third Year, students must complete COOPEDUC (Cooperative Education / On-the-Job Training), which requires 200 hours and carries 3 credited units.\n\nFor the Fourth Year, First Semester, the total credited units are 14. The courses include: ARTSEMR1 (Art Seminar 1 - Art Issues 1, 3 units), ARTWORK3 (Art Work 3 - Print Art, 3 units), GEELECES (Environmental Science, 3 units), and RESMETAR (Research Methods in the Arts, 5 units).\n\nFor the Fourth Year, Second Semester, the total credited units are 14. The courses include: ARTSEMR2 (Art Seminar 2 - Art Issues, 3 units), ARTWORK4 (Art Workshop 4 - Installation Art and Mural Painting, 3 units), GELIFEWR (The Life and Works of Rizal, 3 units), and THESISPT (Thesis, 5 units).\n\nThis curriculum became effective in June 2018. The total number of units required to complete the Bachelor of Fine Arts in Painting is 180 units.",
    "keywords": [
      "EARIST",
      "CAFA",
      "Bachelor of Fine Arts",
      "Painting",
      "Curriculum",
      "Third Year",
      "Fourth Year",
      "Thesis",
      "OJT",
      "Cooperative Education",
      "Advanced Visual Studies",
      "Art Theory",
      "Digital Art",
      "Photoshop",
      "Corel Draw"
    ]
  },
  {
    "id": "earist_cafa_bfa_curriculum_year_1",
    "source": "BFA-VC.pdf",
    "category": "College of Architecture and Fine Arts - Program Offerings",
    "topic": "Bachelor of Fine Arts First Year Curriculum",
    "content": "The Bachelor of Fine Arts program under the College of Architecture and Fine Arts at the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) outlines the following curriculum for the First Year.\n\nDuring the First Semester, students are required to take courses totaling 29 credited units. The General Education courses include: Living in Information Technology Era (GEELECIT, 3 units, 2 lecture/1 lab); Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL, 3 units); Movement Enhancement (GEPEMOVE, 2 units); Purposive Communication (GEPURPCO, 3 units); and National Service Training Program 1 (NSTPROG1, 3 units). The specialized Fine Arts courses are: History of World Arts (HISTWART, 3 units); Lettering (LETTRING, 3 units, 1 lecture/2 lab); Materials I (Modeling 1) (MATRALS1, 3 units, 1 lecture/2 lab); Techniques I (Freehand Drawing 1) (TECHNQS1, 3 units, 1 lecture/2 lab); and Visual Perception 1 (Elements of Visual Arts) (VISPERC1, 3 units, 1 lecture/2 lab). No prerequisites are listed for this semester.\n\nThe Second Semester curriculum consists of 26 credited units. The required courses are: Filipino sa Iba't ibang Disiplina (GEFILDIS, 3 units); Mathematics in the Modern World (GEMATHMW, 3 units); Fitness Exercises (GEPEFITE, 2 units); and National Service Training Program 2 (NSTPROG2, 3 units). The major courses include: Drafting and Perspective (DRAFTPER, 3 units, 1 lecture/2 lab); Materials II (Modeling 2) (MATRALS2, 3 units, 1 lecture/2 lab); Oriental Arts (ORIEARTS, 3 units); Techniques II (Freehand Drawing 2) (TECHNQS2, 3 units, 1 lecture/2 lab); and Visual Perception 2 (Concept of Visual Org.) (VISPERC2, 3 units, 1 lecture/2 lab).",
    "keywords": [
      "Bachelor of Fine Arts",
      "First Year Curriculum",
      "Visual Perception",
      "Techniques",
      "Materials Modeling",
      "History of World Arts",
      "EARIST CAFA"
    ]
  },
  {
    "id": "earist_cafa_bfa_curriculum_year_2",
    "source": "BFA-VC.pdf",
    "category": "College of Architecture and Fine Arts - Program Offerings",
    "topic": "Bachelor of Fine Arts Second Year Curriculum",
    "content": "The Bachelor of Fine Arts program under the College of Architecture and Fine Arts at EARIST prescribes the following courses for the Second Year level.\n\nThe First Semester requires 26 credited units. The curriculum includes: Gender and Society (GEELECGS, 3 units); Physical Activity Towards Health and Fitness 1 (GEPEHEF1, 2 units); Sinesosyedad/Pelikulang Panlipunan (GESINEPP, 3 units); and Understanding the Self (GEUNDETS, 3 units). The major courses introduced in this term are: Digital Design 1 (DGTLDES1, 3 units, 1 lecture/2 lab); Figure Drawing 1 (FIGDRAW1, 3 units, 1 lecture/2 lab); Photography 1 (PHOTOGH1, 3 units, 1 lecture/2 lab); Production Technique 1 (PRODTEC1, 3 units, 1 lecture/2 lab); and Visual Communication Design 1 (VISCODE1, 3 units, 1 lecture/2 lab). \n\nThe Second Semester curriculum comprises 23 credited units. General Education courses include Art Appreciation (GEARTAPP, 3 units); Communicative Proficiency in Business Correspondence and Research Writing (GEELECCP, 3 units); and Physical Activity Towards Health and Fitness II (GEPEHEF2, 2 units). The professional courses are continuations of the first semester's subjects: Digital Design 2 (DGTLDES2, 3 units, 1 lecture/2 lab); Figure Drawing 2 (FIGDRAW2, 3 units, 1 lecture/2 lab); Photography 2 (PHOTOGH2, 3 units, 1 lecture/2 lab); Production Technique 2 (PRODTEC2, 3 units, 1 lecture/2 lab); and Visual Communication Design 2 (VISCODE2, 3 units, 1 lecture/2 lab).",
    "keywords": [
      "Bachelor of Fine Arts",
      "Second Year Curriculum",
      "Digital Design",
      "Figure Drawing",
      "Photography",
      "Production Technique",
      "Visual Communication Design"
    ]
  },
  {
    "id": "earist_cafa_bfa_curriculum_year_3",
    "source": "BFA-VC.pdf",
    "category": "College of Architecture and Fine Arts - Program Offerings",
    "topic": "Bachelor of Fine Arts Third Year Curriculum",
    "content": "The Bachelor of Fine Arts program at EARIST outlines the Third Year curriculum, which introduces advanced design theory and specialized electives.\n\nThe First Semester requires 24 credited units. The courses include: Design Theory (DGTHEORY, 3 units, 1 lecture/2 lab); Digital Design 3 (DGTLDES3, 3 units, 1 lecture/2 lab); The Contemporary World (GECONTWO, 3 units); Readings in Philippine History (GEREADPH, 3 units); Philippine Art (PHILARTS, 3 units); Basic to Advanced Textile Design (TEXTDESI, 3 units, 1 lecture/2 lab); Visual Communication Design 3 (VISCODE3, 3 units, 1 lecture/2 lab); and Visual Verbal Communication (VISVERCO, 3 units, 1 lecture/2 lab).\n\nThe Second Semester consists of 24 credited units. The curriculum covers: Creative Research (CREATRES, 3 units, 2 lecture/1 lab); Digital Design 4 (DGTLDES4, 3 units, 1 lecture/2 lab); Costume & Fashion Design (FASHDES, 3 units, 1 lecture/2 lab); Practical Data Science (GEELECDS, 3 units); Ethics (GEETHICS, 3 units); Science, Technology and Society (GESCIETS, 3 units); Problem in Visual Communication (PROVISCO, 3 units, 1 lecture/2 lab); and Visual Communication Design 4 (VISCODE4, 3 units, 1 lecture/2 lab).\n\nThe Summer term requires Cooperative Education / On-the-Job Training (COOPEDUC, 3 units) which involves 200 hours of duty.",
    "keywords": [
      "Bachelor of Fine Arts",
      "Third Year Curriculum",
      "Textile Design",
      "Costume Design",
      "Fashion Design",
      "Visual Verbal Communication",
      "Cooperative Education",
      "OJT"
    ]
  },
  {
    "id": "earist_cafa_bfa_curriculum_year_4_summary",
    "source": "BFA-VC.pdf",
    "category": "College of Architecture and Fine Arts - Program Offerings",
    "topic": "Bachelor of Fine Arts Fourth Year Curriculum and Program Summary",
    "content": "The Bachelor of Fine Arts program at EARIST concludes with the Fourth Year curriculum, focusing on research, portfolio development, and thesis work.\n\nThe First Semester requires 17 credited units. The courses are: Environmental Science (GEELECES, 3 units); The Life and Works of Rizal (GELIFEWR, 3 units); Basic to Advanced Package Design (PACKDESI, 3 units, 2 lab units listed); Portfolio (PRTFOLIO, 3 units, 1 lecture/2 lab); and Research Methods in Visual Communication (RESMETVC, 5 units, 2 lecture/5 lab).\n\nThe Second Semester consists of 14 credited units. The final courses include: Basic to Advanced Print Making (PRINTMAK, 3 units, 1 lecture/2 lab); Seminar in Creative Management (SEMCREMA, 3 units, 1 lecture/2 lab); Thesis (THESISVC, 5 units, 2 lecture/3 lab); and Visual Merchandising (VISMECHA, 3 units, 1 lecture/2 lab).\n\nThe Total Number of Units for the Bachelor of Fine Arts program is 186. The curriculum effectivity is listed as June 2018.",
    "keywords": [
      "Bachelor of Fine Arts",
      "Fourth Year Curriculum",
      "Thesis",
      "Portfolio",
      "Package Design",
      "Print Making",
      "Visual Merchandising",
      "Total Units 186"
    ]
  },
  {
    "id": "earist_cbpa_bpa_curriculum_years_1_and_2",
    "source": "BPA.pdf",
    "category": "Academic Curriculum",
    "topic": "Bachelor in Public Administration - First and Second Year Coursework",
    "content": "The EARIST College of Business and Public Administration establishes the foundational curriculum for the Bachelor in Public Administration (BPA) degree. This section details the course requirements for the First and Second Years.\n\nFor the First Year, First Semester, students are required to complete 23 credited units. The courses include GEKOMFIL (Kontekstwalisadong Komunikasyon sa Filipino, 3 units), GEPEMOVE (Movement Enhancement, 2 units), GEPURPCO (Purposive Communication, 3 units), GEREADPH (Readings in Philippine History, 3 units), GEUNDETS (Understanding the Self, 3 units), INTRODPA (Introduction to Public Administration, 3 units), KMGTICTP (Knowledge Management and ICT for PA, 3 units), and NSTPROG1 (National Service Training Program 1, 3 units).\n\nFor the First Year, Second Semester, the total credited units are 23. The coursework includes GEARTAPP (Art Appreciation, 3 units), GEFILDIS (Filipino sa Iba't ibang Disiplina, 3 units), GELIFEWR (The Life and Works of Rizal, 3 units), GEMATHMW (Mathematics in the Modern World, 3 units), GEPEFITE (Fitness Exercises, 2 units), GESCIETS (Science, Technology and Society, 3 units), NSTPROG2 (National Service Training Program 2, 3 units), and PHADTHIN (Philippine Administrative Thought and Institution, 3 units).\n\nFor the Second Year, First Semester, the curriculum requires 23 credited units. Courses include COMPARAD (Comparative Administration, 3 units), GEETHICS (Ethics, 3 units), GEPANIPI (Panitikan sa Pilipinas / Philippine Literature, 3 units), GEPEHEF1 (Physical Activity Towards Health and Fitness 1, 2 units), ORGAMNGT (Organization and Management, 3 units), PBPOLPRO (Public Policy Program Administration, 3 units), POLIADMI (Politics and Administration, 3 units), and SPECSTAT (Elementary Statistics for Public Administration, 3 units).\n\nFor the Second Year, Second Semester, students must complete 23 credited units. The courses are BASICACC (Basic Accounting, 3 units), GECONTWO (The Contemporary World, 3 units), GEPEHEF2 (Physical Activity Towards Health and Fitness II, 2 units), HUMRSMGT (Human Resource Management, 3 units), LOCGOVRA (Local Government and Regional Administration, 3 units), PUBPERAD (Public Personnel Administration, 3 units), SPECARDP (Argumentation and Debate in Politics, 3 units), and SPECPSYC (Psychology in Public Administration, 3 units).",
    "keywords": [
      "EARIST",
      "CBPA",
      "Bachelor in Public Administration",
      "BPA",
      "Curriculum",
      "First Year",
      "Second Year",
      "Public Policy",
      "Local Government",
      "Administrative Thought",
      "Statistics"
    ]
  },
  {
    "id": "earist_cbpa_bpa_curriculum_years_3_4_and_summary",
    "source": "BPA.pdf",
    "category": "Academic Curriculum",
    "topic": "Bachelor in Public Administration - Third and Fourth Year Coursework and Summary",
    "content": "The EARIST College of Business and Public Administration outlines the advanced curriculum for the Bachelor in Public Administration (BPA) for the Third and Fourth Years, focusing on specialized administrative laws, fiscal management, and professional immersion.\n\nFor the Third Year, First Semester, the total credited units are 21. The courses include ADOFPROC (Office and System Management, 3 units), ELECTGPA (Globalization and Public Administration, 3 units), GOVSORES (Good Governance and Social Responsibility, 3 units), PUBADECS (Public Administration and the Economic System, 3 units), PUBFSADM (Public Fiscal Administration, 3 units), SPECCILJ (Introduction to Law and Jurisprudence, 3 units), and SPECPPAP (Parliamentary Practice and Procedure, 3 units).\n\nFor the Third Year, Second Semester, students complete 21 credited units. Courses include ADMINLAW (Administrative Law, 3 units), ELECTRPM (Records and Property Management, 3 units), ELECTTPA (Tools and Property Management, 3 units), HUMBEORG (Human Behavior in Organizations, 3 units), LEADDECM (Leadership and Decision Making, 3 units), PUBACBUD (Public Accounting and Budgeting, 3 units), and RESMEPA1 (Research Methods in PA 1, 3 units).\n\nFor the Fourth Year, First Semester, the curriculum requires 15 credited units. Courses include ELECPPDM (Program & Project Development in Management, 3 units), GOVERDEV (Governance and Development, 3 units), RESMEPA2 (Research Methods in PA 2, 3 units), SPCTOPPA (Special Topics in Public Administration, 3 units), and WRKETACT (Work Ethics and Accountability in Public Service, 3 units).\n\nFor the Fourth Year, Second Semester, students undergo INTRNSHP (Internship in Government). The curriculum lists 324 units in the lecture column (indicating hours required) and assigns 6 credited units for this internship.\n\nThis curriculum includes a total of 155 units and became effective in June 2018.",
    "keywords": [
      "EARIST",
      "CBPA",
      "Bachelor in Public Administration",
      "BPA",
      "Curriculum",
      "Third Year",
      "Fourth Year",
      "Internship",
      "Fiscal Administration",
      "Administrative Law",
      "Research Methods",
      "Governance"
    ]
  },
  {
    "id": "earist_cbpa_bsba_curriculum_years_1_and_2",
    "source": "BSBA-HRM.pdf",
    "category": "Academic Program - Bachelor of Science in Business Administration",
    "topic": "First and Second Year Curriculum Structure and Course Requirements",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Business and Public Administration, prescribes the following curriculum for the Bachelor of Science in Business Administration (BSBA) program. This section details the course requirements for the First and Second Academic Years, effective June 2018. \n\n**First Year - First Semester (Total: 26 Units)**\nStudents must complete the following courses: 'ADOPMNGT' (Administrative Office Procedure and Management) with 3 lecture units; 'ADWOVAAC' (Administrative Work Values and Accountability) with 3 lecture units; 'GEPEMOVE' (Movement Enhancement) with 2 lecture units; 'GEREADPH' (Readings in Philippine History) with 3 lecture units; 'GEUNDETS' (Understanding the Self) with 3 lecture units; 'HURSMNGT' (Human Resource Management) with 3 lecture units; 'KEYDOCPR' (Keyboarding and Documents Processing 1) with 3 lecture units; 'NSTPROG1' (National Service Training Program 1) with 3 lecture units; and 'ORGNMNGT' (Management / Organization and Management) with 3 lecture units. None of these courses have prerequisites.\n\n**First Year - Second Semester (Total: 20 Units)**\nThe curriculum continues with: 'GEETHICS' (Ethics) with 3 units; 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino) with 3 units; 'GEMATHMW' (Mathematics in the Modern World) with 3 units; 'GEPEFITE' (Fitness Exercises) with 2 units; 'GOVSORES' (Good Governance and Social Responsibility) with 3 units; 'NSTP-CWTS_2' (NSTP Civic Welfare Training Service 2) with 3 units; and 'RCRTSELC' (Recruitment and Selection) with 3 units. No prerequisites are required for these subjects.\n\n**Second Year - First Semester (Total: 23 Units)**\nStudents advance to the following subjects: 'ACCOUNT1' (Accounting for Service and Trading Industry) with 3 units; 'GEFILDIS' (Filipino sa Iba't ibang Disiplina) with 3 units; 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1) with 2 units; 'GESCIENTS' (Science and Technology) with 3 units; 'LBRLWLEG' (Labor Laws and Legislation) with 3 units; 'MICROECO' (Microeconomics) with 3 units; 'OPTNMNGT' (Operations Management / TQM) with 3 units; and 'TRNGDEVT' (Training and Development) with 3 units. No prerequisites are listed.\n\n**Second Year - Second Semester (Total: 20 Units)**\nThe Second Year concludes with: 'ACCOUNT2' (Accounting for Merchandising Industry) with 3 units; 'COMPEADM' (Compensation Administration) with 3 units; 'ENTREMGT' (Entrepreneurial Management) with 3 units; 'GEARTAPP' (Art Appreciation) with 3 units; 'GECONTWO' (The Contemporary World) with 3 units; 'GEPEHEF2' (Physical Activity Towards Health and Fitness II) with 2 units; and 'LBRRLNEG' (Labor Relations & Negotiations) with 3 units. All courses in this section are credited without prerequisites.",
    "keywords": [
      "BSBA",
      "Curriculum",
      "First Year",
      "Second Year",
      "Course Codes",
      "ADOPMNGT",
      "HURSMNGT",
      "Accounting",
      "NSTP",
      "EARIST College of Business and Public Administration"
    ]
  },
  {
    "id": "earist_cbpa_bsba_curriculum_years_3_and_4",
    "source": "BSBA-HRM.pdf",
    "category": "Academic Program - Bachelor of Science in Business Administration",
    "topic": "Third and Fourth Year Curriculum, Thesis, and Practicum Requirements",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) Bachelor of Science in Business Administration (BSBA) curriculum outlines specific advanced coursework for the Third and Fourth Years. This curriculum is designed by the College of Business and Public Administration and became effective in June 2018. The total number of units required to complete the full BSBA program is 140 units.\n\n**Third Year - First Semester (Total: 18 Units)**\nThe required courses include: 'GELIFEWR' (The Life and Works of Rizal) with 3 units; 'GEPHILIT' (Philippine Literature) with 3 units; 'GEPURPCO' (Purposive Communication) with 3 units; 'HRBUSRS1' (Business Research in HRM / Thesis 1) with 3 units; 'INCMTAXN' (Income Taxation) with 3 units; and 'PROJMNGT' (Project Management) with 3 units. No prerequisites are indicated for this semester.\n\n**Third Year - Second Semester (Total: 18 Units)**\nStudents must complete: 'BUSITAXN' (Taxation 2 / Business Taxation) with 3 units; 'FRANCHIS' (Franchising) with 3 units; 'HRBUSRS2' (Business Research in HRM / Thesis 2) with 3 units; 'INTLBATT' (International Business and Trade) with 3 units; 'MGRLACCT' (Managerial Accounting) with 3 units; and 'ORGNDEVT' (Organizational Development) with 3 units. \n\n**Fourth Year - First Semester (Total: 9 Units)**\nThe academic load decreases to focus on specialized topics: 'BUSLWOBL' (Business Law / Obligations & Contract) with 3 units; 'SPCLHRDM' (Special Topics in HRM) with 3 units; and 'STRAMNGT' (Strategic Management) with 3 units.\n\n**Fourth Year - Second Semester (Total: 6 Units)**\nThe final semester is dedicated to practical application via 'HRDMPRAC' (HRM Practicum), which requires 600 hours of service and is credited for 6 units. \n\nThis curriculum document is prepared by the Department Head and attested by the Dean of the College of Business and Public Administration.",
    "keywords": [
      "Third Year",
      "Fourth Year",
      "Thesis",
      "Practicum",
      "Internship",
      "Business Research",
      "Taxation",
      "Strategic Management",
      "HRM Practicum",
      "Total Units 140",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_cbpa_bsba_mktg_curriculum_years_1_and_2",
    "source": "BSBA-MKTG.pdf",
    "category": "Academic Program - BSBA Marketing Management",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Business and Public Administration, mandates the following curriculum for the first two years of the Bachelor of Science in Business Administration (BSBA), specifically tailored for the Marketing Management track. This curriculum structure is effective as of June 2018.\n\n**First Year - First Semester (Total: 26 Units)**\nThe foundational courses include 'ADWOVAAC' (Administrative Work Values and Accountability, 3 units), 'GEMATHMW' (Mathematics in the Modern World, 3 units), 'GEPEMOVE' (Movement Enhancement, 2 units), 'GESCIETS' (Science, Technology and Society, 3 units), 'HURSMNGT' (Human Resource Management, 3 units), 'KEYDOCPR' (Keyboarding and Documents Processing 1, 3 units), 'MICROECO' (Microeconomics, 3 units), 'NSTPROG1' (National Service Training Program 1, 3 units), and 'ORGNMNGT' (Management / Organization and Management, 3 units). None of these courses require prerequisites.\n\n**First Year - Second Semester (Total: 23 Units)**\nStudents proceed to 'BUSIMKTG' (Business Marketing, 3 units), 'GEARTAPP' (Art Appreciation, 3 units), 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino, 3 units), 'GEPEFITE' (Fitness Exercises, 2 units, Prereq: GEPEMOVE), 'GEREADPH' (Readings in Philippine History, 3 units), 'GEUNDETS' (Understanding the Self, 3 units), 'GOVSORES' (Good Governance and Social Responsibility, 3 units), and 'NSTPROG2' (National Service Training Program 2, 3 units).\n\n**Second Year - First Semester (Total: 20 Units)**\nThe curriculum introduces specialized subjects: 'ACCOUNT1' (Accounting for Service and Trading Industry, 3 units), 'GECONTWO' (The Contemporary World, 3 units), 'GEFILDIS' (Filipino sa Iba't ibang Disiplina, 3 units), 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1, 2 units, Prereq: GEPEMOVE), 'GEPURPCO' (Purposive Communication, 3 units), 'MKTGMNGT' (Marketing Management, 3 units, Prereq: BUSIMKTG), and 'RETLMNGT' (Retail Management, 3 units, Prereq: BUSIMKTG).\n\n**Second Year - Second Semester (Total: 23 Units)**\nThe second year concludes with 'ACCOUNT2' (Accounting for Merchandising Industry, 3 units, Prereq: ACCOUNT1), 'ADVERTSG' (Advertising, 3 units, Prereq: MKTGMNGT), 'CONSBHVR' (Consumer Behavior, 3 units), 'GELIFEWR' (The Life and Works of Rizal, 3 units), 'GEPEHEF2' (Physical Activity Towards Health and Fitness II, 2 units), 'MKTRESCH' (Market Research and Consumer Behavior, 3 units, Prereq: MKTGMNGT), 'PRODMNGT' (Product Management, 3 units, Prereq: RETLMNGT), and 'SALEMNGT' (Sales Management, 3 units, Prereq: RETLMNGT).",
    "keywords": [
      "BSBA Marketing Curriculum",
      "First Year Courses",
      "Second Year Courses",
      "Business Marketing",
      "Marketing Management",
      "Accounting",
      "Retail Management",
      "EARIST Business Administration"
    ]
  },
  {
    "id": "earist_cbpa_bsba_mktg_curriculum_years_3_and_4",
    "source": "BSBA-MKTG.pdf",
    "category": "Academic Program - BSBA Marketing Management",
    "topic": "Third and Fourth Year Curriculum, Thesis, and Practicum",
    "content": "The advanced curriculum for the Bachelor of Science in Business Administration (BSBA) Major in Marketing Management at EARIST focuses on strategic management, specialized marketing research, and professional practice. This corresponds to the Third and Fourth academic years under the June 2018 effectivity order.\n\n**Third Year - First Semester (Total: 21 Units)**\nStudents are required to take 'DISTMNGT' (Distribution Management, 3 units, Prereq: PRODMNGT), 'ENTRMNGT' (Entrepreneurial Management, 3 units), 'FRANCHIS' (Franchising, 3 units), 'GEPHILIT' (Philippine Literature, 3 units), 'INCMTAXN' (Income Taxation, 3 units, Prereq: ACCOUNT2), 'MGRLACCT' (Managerial Accounting, 3 units, Prereq: ACCOUNT2), and 'MMBUSRS1' (Business Research in Marketing Management / Thesis 1, 3 units, Prereq: MKTRESCH).\n\n**Third Year - Second Semester (Total: 15 Units)**\nThe coursework includes 'BUSITAXN' (Taxation 2 / Business Taxation, 3 units, Prereq: INCMTAXN), 'GEETHICS' (Ethics, 3 units), 'MMBUSRS2' (Business Research in Marketing Mgt. / Thesis 2, 3 units, Prereq: MMBUSRS1), 'PRICSTRA' (Pricing and Costing, 3 units, Prereq: DISTMNGT), and 'PROFSALE' (Professional Salesmanship, 3 units).\n\n**Fourth Year - First Semester (Total: 12 Units)**\nThe senior year begins with 'BUSLWOBL' (Business Law / Obligations & Contract, 3 units), 'INTLBATT' (International Business and Trade, 3 units), 'OPTNMNGT' (Operations Management / TQM, 3 units), and 'STRAMNGT' (Strategic Management, 3 units).\n\n**Fourth Year - Second Semester (Total: 6 Units)**\nThe final requirement for graduation is 'MKTGPRAC' (Marketing Practicum), which involves 600 hours of field work credited for 6 units. The prerequisite for the practicum is the completion of Thesis 2 (MMBUSRS2).\n\nThe total number of units required to graduate from the BSBA Marketing Management program is 146 units.",
    "keywords": [
      "BSBA Marketing Curriculum",
      "Third Year Courses",
      "Fourth Year Courses",
      "Marketing Thesis",
      "Marketing Practicum",
      "Business Taxation",
      "Distribution Management",
      "Professional Salesmanship",
      "Strategic Management",
      "Total Units 146"
    ]
  },
  {
    "id": "earist_coe_bsce_curriculum_years_1_and_2",
    "source": "BSCE.pdf",
    "category": "Academic Program - Bachelor of Science in Civil Engineering",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Engineering, prescribes the following curriculum for the first two years of the Bachelor of Science in Civil Engineering (BSCE) program, effective June 2018. \n\n**First Year - First Semester (Total: 29 Units)**\nStudents must complete the following foundational courses: 'CEENG111' (Civil Engineering Orientation, 2 units); 'CENMAT01' (Differential Calculus, 3 units); 'CENMATH 111' (Mathematics for Engineers, 3 units); 'GEARTAPP' (Art Appreciation, 3 units); 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino, 3 units); 'GEMATHMW' (Mathematics in the Modern World, 3 units); 'GEPEMOVE' (Movement Enhancement, 2 units); 'GESCIETS' (Science, Technology and Society, 3 units); 'NATSCI SP_102' (Chemistry for Engineers, 4 units); and 'NSTPROG1' (National Service Training Program 1, 3 units). No prerequisites are listed for this introductory semester.\n\n**First Year - Second Semester (Total: 27 Units)**\nThe curriculum continues with: 'COM_SP_212' (Computer Fundamentals and Programming, 2 units); 'DRW 101A' (Engineering Drawing and Plans, 1 unit); 'GEPANIPI' (Panitikan sa Pilipinas / Philippine Literature, 3 units); 'GEPEFITE' (Fitness Exercises, 2 units); 'GEPURPCO' (Purposive Communication, 3 units); 'GEREADPH' (Readings in Philippine History, 3 units); 'GEUNDETS' (Understanding the Self, 3 units); 'MATH_104' (Calculus II / Integral Calculus, 3 units); 'NATSCI103A' (Physics for Engineers - Calculus Based, 4 units); and 'NSTPROG2' (National Service Training Program 2, 3 units).\n\n**Second Year - First Semester (Total: 25 Units)**\nStudents advance to more technical subjects including: 'CAD 101' (Computer Aided Drafting, 1 unit); 'CVL 311A' (Fundamentals of Surveying, 4 units); 'DIFFEQUA' (Differential Equations, 3 units); 'EECO_311' (Engineering Economy, 3 units); 'GEADCPBR' (Communicative Proficiency in Business Correspondence and Research Writing, 3 units); 'GECONTWO' (The Contemporary World, 3 units); 'GELIFEWR' (The Life and Works of Rizal, 3 units); 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1, 2 units); and 'STRIGBOD' (Statics of Rigid Bodies, 3 units). Notably, 'STRIGBOD' requires the completion of Calculus II and Physics for Engineers.\n\n**Second Year - Second Semester (Total: 26 Units)**\nThe year concludes with: 'CENMECDB' (Mechanics of Deformable Bodies, 5 units); 'CVENG221' (Construction Materials and Testing, 3 units); 'CVENG222' (Engineering Data Analysis, 3 units); 'CVENG223' (Engineering Surveys, 3 units); 'CVENG224' (Geology for Civil Engineering, 2 units); 'GEADDPDS' (Practical Data Science, 3 units); 'GEETHICS' (Ethics, 3 units); 'GEPEHEF2' (Physical Activity Towards Health and Fitness II, 2 units); and 'MCH 322' (Dynamics of Rigid Bodies, 2 units).",
    "keywords": [
      "BSCE Curriculum",
      "Civil Engineering",
      "First Year Courses",
      "Second Year Courses",
      "Calculus",
      "Physics for Engineers",
      "Statics of Rigid Bodies",
      "Surveying",
      "EARIST College of Engineering"
    ]
  },
  {
    "id": "earist_coe_bsce_curriculum_years_3_and_4",
    "source": "BSCE.pdf",
    "category": "Academic Program - Bachelor of Science in Civil Engineering",
    "topic": "Third and Fourth Year Curriculum and Professional Courses",
    "content": "The advanced curriculum for the Bachelor of Science in Civil Engineering at EARIST covers the Third and Fourth Years, including a mandatory summer internship. The total number of units required to graduate from this program is 194 units.\n\n**Third Year - First Semester (Total: 25 Units)**\nRequired courses include: 'CENENVIR' (Environmental Science and Engineering, 3 units); 'CVENG311' (Engineering Utilities 1, 3 units); 'CVENG312' (Engineering Utilities 2, 3 units); 'CVENG313' (Highway and Railroad Engineering, 3 units); 'CVENG314' (Numerical Solution to CE Problems, 3 units); 'CVENG315' (Structural Theory, 5 units); 'CVENG316' (Engineering Management, 2 units); and 'GEELECIT' (Living in Information Technology Era, 3 units).\n\n**Third Year - Second Semester (Total: 24 Units)**\nStudents focus on design and systems with: 'CENTECNO' (Technopreneurship, 3 units); 'CVENG321' (Building System Design, 3 units); 'CVENG322' (Hydraulics, 5 units); 'CVENG323' (Principles of Reinforced/Prestressed Concrete, 4 units); 'CVENG324' (Principles of Steel Design, 4 units); 'CVENG325' (Timber Design, 3 units); and 'CVENG327' (Hydrology, 2 units).\n\n**Summer Term (Total: 3 Units)**\nA mandatory 'CENOTJOB' (On-the-Job Training) course requiring 300 hours is scheduled for the summer term.\n\n**Fourth Year - First Semester (Total: 18 Units)**\nThe final year introduces specialized professional courses: 'CVENG411' (CE Project 1, 2 units); 'CVENG413' (Geotechnical Engineering 1 / Soil Mechanics, 4 units); 'CVENG414' (Principles of Transportation Engineering, 3 units); 'CVENGSP1' (Professional Course- Specialized 1: Water Resources and Coastal Engineering, 3 units); 'CVENGSP2' (Professional Course- Specialized 2: Earthquake Engineering, 3 units); and 'CVENGSP3' (Professional Course- Specialized 3: Bridge Engineering, 3 units).\n\n**Fourth Year - Second Semester (Total: 17 Units)**\nThe program concludes with: 'CVENG422' (CE Project 2, 2 units); 'CVENG423' (Construction Methods and Project Management, 4 units); 'CVENG427' (Quantity Surveying, 2 units); 'CVENGSP4' (Professional Course- Specialized 4: Construction Cost Engineering, 3 units); 'CVENGSP5' (Professional Course- Specialized 5: Foundation Engineering, 3 units); and 'CVENG 421' (CE Laws, Ethics and Contracts, 3 units).",
    "keywords": [
      "BSCE Curriculum",
      "Third Year Courses",
      "Fourth Year Courses",
      "OJT",
      "Structural Theory",
      "Reinforced Concrete",
      "Steel Design",
      "Hydraulics",
      "Geotechnical Engineering",
      "Transportation Engineering",
      "Professional Specialized Courses"
    ]
  },
  {
    "id": "earist_coe_bsche_curriculum_years_1_and_2",
    "source": "BSCHE.pdf",
    "category": "Academic Program - Bachelor of Science in Chemical Engineering",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Engineering, mandates the following curriculum for the first two years of the Bachelor of Science in Chemical Engineering (BSChE) program. This curriculum is effective as of June 2018.\n\n**First Year - First Semester (Total: 27 Units)**\nThe introductory semester requires students to complete: 'CENMAT01' (Differential Calculus) with 3 units; 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino) with 3 units; 'GEMATHMW' (Mathematics in the Modern World) with 3 units; 'GEPEMOVE' (Movement Enhancement) with 2 units; 'GEPURPCO' (Purposive Communication) with 3 units; 'GEREADPH' (Readings in Philippine History) with 3 units; 'GESCIETS' (Science, Technology and Society) with 3 units; 'NATSCI SP_102' (Chemistry for Engineers) with 4 units; and 'NSTPROG1' (National Service Training Program 1) with 3 units. No prerequisites are listed for these courses.\n\n**First Year - Second Semester (Total: 23 Units)**\nStudents proceed to: 'CHE 102' (Analytical Chemistry) with 5 units (Prereq: Chemistry for Engineers); 'GEARTAPP' (Art Appreciation) with 3 units; 'GEPANIPI' (Panitikan sa Pilipinas) with 3 units; 'GEPEFITE' (Fitness Exercises) with 2 units (Prereq: Movement Enhancement); 'MATH_104' (Calculus II / Integral Calculus) with 3 units (Prereq: Differential Calculus); 'NATSCI103A' (Physics for Engineers - Calculus Based) with 4 units (Prereq: Differential Calculus); and 'NSTPROG2' (National Service Training Program 2) with 3 units.\n\n**Second Year - First Semester (Total: 26 Units)**\nThe curriculum advances to: 'ALCHE_03A' (Organic Chemistry) with 5 units; 'CHE0211A' (Chemical Engineering Calculations) with 4 units; 'DIFFEQUA' (Differential Equations) with 3 units; 'EEMCH 211' (Engineering Mechanics) with 3 units; 'GELIFEWR' (The Life and Works of Rizal) with 3 units; 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1) with 2 units; 'GEUNDETS' (Understanding the Self) with 3 units; and 'MM16' (Engineering Data Analysis) with 3 units. Prerequisites include Calculus II and Physics for Engineers.\n\n**Second Year - Second Semester (Total: 24 Units)**\nThe second year concludes with: 'ALCHE_04' (Physical Chemistry for Engineers 1) with 3 units; 'ALCHE_05' (Fundamentals of Material Science and Engineering) with 3 units; 'CHENG_02' (Introduction to Transport Phenomena and Momentum Transfer) with 3 units; 'CHENG_03' (Chemical Engineering Thermodynamics) with 3 units; 'CHENG 04' (Advanced Engineering Math in CHE) with 3 units; 'GENCAD 111' (Computer Aided Design) with 4 units; 'GEPEHEF2' (Physical Activity Towards Health and Fitness II) with 2 units; and 'STROFMAT' (Strength of Materials) with 3 units.",
    "keywords": [
      "BSChE Curriculum",
      "Chemical Engineering",
      "First Year Courses",
      "Second Year Courses",
      "Organic Chemistry",
      "Thermodynamics",
      "Transport Phenomena",
      "Calculus",
      "EARIST College of Engineering"
    ]
  },
  {
    "id": "earist_coe_bsche_curriculum_years_3_and_summer",
    "source": "BSCHE.pdf",
    "category": "Academic Program - Bachelor of Science in Chemical Engineering",
    "topic": "Third Year Curriculum and Summer Internship",
    "content": "The Third Year curriculum of the Bachelor of Science in Chemical Engineering at EARIST focuses on core engineering principles, laboratories, and specialization tracks, including a summer internship.\n\n**Third Year - First Semester (Total: 27 Units)**\nCourses include: 'ALCHE306' (Introduction to Biotechnology, 3 units); 'CENENVIR' (Environmental Science and Engineering, 3 units); 'CHENG306' (Heat and Mass Transfer, 5 units); 'CHENG307' (Physical Chemistry for Engineers 2, 3 units); 'CHENG308' (Solution Thermodynamics, 3 units); 'CHENG309' (Methods of Research, 3 units); 'CHENG310' (Computer Application in ChE, 3 units); 'EEENG411' (Electrical Standards and Practices, 1 unit); and 'GEELECCP' (Communicative Proficiency in Business Correspondence and Research Writing, 3 units).\n\n**Third Year - Second Semester (Total: 26 Units)**\nThe semester requires: 'ALCHE308' (Basic and Inferential Statistics, 3 units); 'CENENECO' (Engineering Economy, 3 units); 'CHENG311' (Chemical Reaction Engineering, 4 units); 'CHENG312' (Chemical Engineering Lab, credited but unit count unspecified in source, likely integrated); 'CHENG313' (Particle Technology, 3 units); 'CHENG314' (Separation Processes, 3 units); 'CHENG315' (Chemical Process Industries, 3 units); 'CHENG316' (Track Specialization 1: Paints and Coatings, 3 units); and 'GMELECHT' (Living in Information Technology Era, 3 units).\n\n**Summer Term (Total: 3 Units)**\nStudents must complete 'CENOTJOB' (On-the-Job Training), which consists of 300 hours of practical work experience, credited for 3 units.",
    "keywords": [
      "BSChE Curriculum",
      "Third Year Courses",
      "Heat and Mass Transfer",
      "Reaction Engineering",
      "Separation Processes",
      "Biotechnology",
      "OJT",
      "Specialization Track",
      "Paints and Coatings"
    ]
  },
  {
    "id": "earist_coe_bsche_curriculum_year_4",
    "source": "BSCHE.pdf",
    "category": "Academic Program - Bachelor of Science in Chemical Engineering",
    "topic": "Fourth Year Curriculum and Graduation Requirements",
    "content": "The final year of the BS Chemical Engineering program at EARIST emphasizes design, safety, process control, and advanced specialization tracks. The total number of units required to graduate is 200 units.\n\n**Fourth Year - First Semester (Total: 19 Units)**\nThe curriculum lists: 'CHENG417' (Chemical Engineering Design 1, 2 units); 'CHENG418' (Biochemical Engineering, 3 units); 'CHENG419' (Chemical Engineering Lab 2, 1 unit); 'CHENG420' (Chemical Process Lab, 1 unit); 'CVENG316' (Engineering Management, 2 units); 'GECONTWO' (The Contemporary World, 3 units); 'GEETHICS' (Ethics, 3 units); 'CHENG421' (Process Safety, 1 unit); and 'CHENG422' (Track Specialization 2: Air Pollution, 3 units).\n\n**Fourth Year - Second Semester (Total: 25 Units)**\nThe program concludes with: 'CHENG423' (Chemical Engineering Laws and Ethics, 3 units); 'CHENG424' (Chemical Engineering Design 2, 3 units); 'CHENG425' (Process Dynamics and Control, 3 units); 'CENTECNO' (Technopreneurship, 3 units); 'CHENG426' (Industrial Waste Management and Control, 3 units); 'CHENG427' (Field Trips and Seminars, 1 unit); 'CHENG428' (Quantitative Methods in Management, 3 units); 'CHENG429' (Track Specialization 3: Energy Engineering, 3 units); and 'CHENG430' (Course Integration, 3 units).",
    "keywords": [
      "BSChE Curriculum",
      "Fourth Year Courses",
      "Plant Design",
      "Process Safety",
      "Process Control",
      "Waste Management",
      "Energy Engineering",
      "Air Pollution",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_coe_bscpe_curriculum_years_1_and_2",
    "source": "BSCOE.pdf",
    "category": "Academic Program - Bachelor of Science in Computer Engineering",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Engineering, prescribes the following curriculum for the first two years of the Bachelor of Science in Computer Engineering (BSCpE) program, effective June 2018. \n\n**First Year - First Semester (Total: 26 Units)**\nThe introductory semester consists of: 'CENCAD 111' (Computer Aided Drafting, 1 unit); 'CENMAT01' (Differential Calculus, 3 units); 'CENMATH 111' (Mathematics for Engineers, 3 units); 'CPENG111' (Computer Engineering as a Discipline, 1 unit); 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino, 3 units); 'GEPEMOVE' (Movement Enhancement, 2 units); 'GEREADPH' (Readings in Philippine History, 3 units); 'GEUNDETS' (Understanding the Self, 3 units); 'NATSCI SP_102' (Chemistry for Engineers, 4 units); and 'NSTPROG1' (National Service Training Program 1, 3 units).\n\n**First Year - Second Semester (Total: 27 Units)**\nStudents proceed to: 'CPE 112' (Object Oriented Programming, 2 units, Prereq: CPENG111); 'CPE 113' (Programming Logic and Design, 2 units); 'GEFILDIS' (Filipino sa Iba't ibang Disiplina, 3 units); 'GEMATHMW' (Mathematics in the Modern World, 3 units); 'GEPEFITE' (Fitness Exercises, 2 units); 'MATH_104_5C' (Integral Calculus, 5 units, Prereq: CENMAT01); 'MATH 122' (Engineering Data Analysis, 3 units, Prereq: CENMAT01); 'NATSCI103A' (Physics for Engineers - Calculus Based, 4 units, Prereq: Chemistry for Engineers); and 'NSTPROG2' (NSTP 2, 3 units).\n\n**Second Year - First Semester (Total: 26 Units)**\nThe curriculum advances to: 'CPENG211' (Data Structures and Algorithm Analysis, 2 units, Prereq: CPE 112 & CPE 113); 'DIFFEQUA' (Differential Equations, 3 units, Prereq: MATH_104_5C); 'EEENG211' (Fundamentals of Electrical Circuits, 4 units); 'GEARTAPP' (Art Appreciation, 3 units); 'GEELECDS' (Practical Data Science, 3 units, Prereq: MATH 122); 'GEELECIT' (Living in Information Technology Era, 3 units); 'GEETHICS' (Ethics, 3 units); 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1, 2 units); and 'GEPURPCO' (Purposive Communication, 3 units.\n\n**Second Year - Second Semester (Total: 25 Units)**\nThe year concludes with: 'CENENECO' (Engineering Economy, 3 units); 'CPENG221' (Numerical Methods, 3 units, Prereq: DIFFEQUA); 'CPENG222' (Software Design, 4 units, Prereq: CPENG211); 'ECENG221' (Fundamentals of Electronic Circuits, 4 units); 'GECONTWO' (The Contemporary World, 3 units); 'GELIFEWR' (The Life and Works of Rizal, 3 units); 'GEPEHEF2' (Physical Activity Towards Health and Fitness II, 2 units); and 'GESCIETS' (Science, Technology and Society, 3 units.",
    "keywords": [
      "BSCpE Curriculum",
      "Computer Engineering",
      "Object Oriented Programming",
      "Data Structures",
      "Differential Equations",
      "Physics for Engineers",
      "Electrical Circuits",
      "Software Design",
      "EARIST College of Engineering"
    ]
  },
  {
    "id": "earist_coe_bscpe_curriculum_year_3_and_summer",
    "source": "BSCOE.pdf",
    "category": "Academic Program - Bachelor of Science in Computer Engineering",
    "topic": "Third Year Curriculum and Summer Internship",
    "content": "The Third Year curriculum for the Bachelor of Science in Computer Engineering at EARIST focuses on hardware design, networks, and operating systems, leading into a mandatory summer internship.\n\n**Third Year - First Semester (Total: 24 Units)**\nRequired courses include: 'CENENVIR' (Environmental Science and Engineering, 3 units); 'CPEELEC1' (Cognate/Elective Course 1, 3 units); 'CPENG311' (Logic Circuits and Design, 4 units, Prereq: ECENG221); 'CPENG312' (Data and Digital Communications, 3 units, Prereq: ECENG221); 'CPENG313' (CPE Drafting & Design, 1 unit, Prereq: CENCAD 111); 'CPENG314' (Operating Systems, 4 units, Prereq: CPENG222 & CPENG211); 'CPENG315' (Discrete Mathematics, 3 units, Prereq: CPENG221); and 'MXSIGSEN' (Fundamentals of Mixed Signal & Sensors, 3 units, Prereq: ECENG221.\n\n**Third Year - Second Semester (Total: 21 Units)**\nStudents undertake: 'CENTECNO' (Technopreneurship, 3 units); 'CPEELEC2' (Cognate/Elective Course 2, 3 units, Prereq: CPEELEC1); 'CPENG321' (Basic Occupational Health & Safety, 3 units); 'CPENG322' (Computer Network and Security, 4 units, Prereq: CPENG312 & CPENG314); 'CPENG323' (Microprocessors, 4 units, Prereq: CPENG311); 'CPENG324' (CpE Laws and Professional Practice, 2 units); and 'CVENG316' (Engineering Management, 2 units, Prereq: CENENECO) .\n\n**Summer Term (Total: 3 Units)**\nThe curriculum mandates 'CENOTJOB' (On-the-Job Training), consisting of 300 hours of practical work, credited for 3 units.",
    "keywords": [
      "BSCpE Curriculum",
      "Third Year Courses",
      "Logic Circuits",
      "Operating Systems",
      "Microprocessors",
      "Computer Networks",
      "OJT",
      "Technopreneurship",
      "Discrete Mathematics"
    ]
  },
  {
    "id": "earist_coe_bscpe_curriculum_year_4",
    "source": "BSCOE.pdf",
    "category": "Academic Program - Bachelor of Science in Computer Engineering",
    "topic": "Fourth Year Curriculum and Graduation Requirements",
    "content": "The final year of the BS Computer Engineering program at EARIST, prescribed by the College of Engineering, focuses on research, embedded systems, and capstone design projects. The total number of units required to graduate from the program is 183 units.\n\n**Fourth Year - First Semester (Total: 20 Units)**\nThe senior year begins with: 'CPENG411' (Methods of Research, 2 units, Prereq: MATH 122, GEELECDS, CPENG311); 'CPENG412' (Computer Architecture and Organization, 4 units, Prereq: CPENG323); 'CPENG413' (Embedded Systems, 4 units, Prereq: CPENG323); 'CPENG414' (Emerging Technologies in CpE, 3 units); 'CPENG415' (CpE Practice and Design 1, 1 unit, Prereq: CPENG323 & CPENG411); 'CPENG416' (Feedback and Control System, 3 units, Prereq: CPENG221 & EEENG 221); and 'GEELECCP' (Communicative Proficiency in Business Correspondence and Research Writing, 3 units).\n\n**Fourth Year - Second Semester (Total: 11 Units)**\nThe program concludes with: 'CPEELEC3' (Cognate/Elective Course 3, 3 units, Prereq: CPEELEC2); 'CPENG421' (CPE Practice and Design 2, 2 units, Prereq: CPENG415); 'CPENG422' (Digital Signal Processing, 4 units, Prereq: CPENG416); 'CPENG423' (Introduction to HDL, 1 unit, Prereq: CPENG311); and 'CPENG424' (Seminars and Field Trips, 1 unit).",
    "keywords": [
      "BSCpE Curriculum",
      "Fourth Year Courses",
      "Embedded Systems",
      "Capstone Design",
      "Computer Architecture",
      "Digital Signal Processing",
      "HDL",
      "Total Units 183",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_ccje_bscrim_curriculum_years_1_and_2",
    "source": "BSCRIM.pdf",
    "category": "Academic Program - Bachelor of Science in Criminology",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Criminal Justice Education, mandates the following curriculum for the first two years of the Bachelor of Science in Criminology program. This curriculum is effective as of June 2018. \n\n**First Year - First Semester (Total: 26 Units)**\nStudents are required to take the following courses: 'C1INTCRI' (Introduction to Criminology, 3 units); 'GEARTAPP' (Art Appreciation, 3 units); 'GEELECGS' (Gender and Society, 3 units); 'GEETHICS' (Ethics, 3 units); 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino, 3 units); 'GELIFEWR' (The Life and Works of Rizal, 3 units); 'GEMATHMW' (Mathematics in the Modern World, 3 units); 'GEPEFOMA' (Fundamentals of Martial Arts, 2 units); 'GEREADPH' (Readings in Philippine History, 3 units); and 'NSTPMTS1' (NSTP Military Training Service 1, 0 credited units). No prerequisites are listed for these introductory courses.\n\n**First Year - Second Semester (Total: 30 Units)**\nThe curriculum continues with: 'C2HUMBEV' (Human Behavior and Victimology, 3 units); 'CLIPCJS' (Introduction to Philippine Criminal Justice System, 3 units); 'GMELECHT' (Living in Information Technology Era, 3 units); 'GEFILDIS' (Filipino sa Iba't ibang Disiplina, 3 units); 'GEPEAADT' (Arnis and Disarming Techniques, 2 units); 'GEPURPCO' (Purposive Communication, 3 units); 'GESCIETS' (Science, Technology and Society, 3 units); 'GEUNDETS' (Understanding the Self, 3 units); 'LILAEOAD' (Law Enforcement Organization and Administration, 4 units); and 'NSTPMTS2' (NSTP Military Training Service 2, 3 units).\n\n**Second Year - First Semester (Total: 26 Units)**\nStudents advance to professional and general subjects including: 'C3THCACR' (Theories and Causes of Crime, 3 units); 'C4PECSTA' (Professional Conduct and Ethical Standards, 3 units); 'F1FORPHO' (Forensic Photography, 3 units); 'GEADCHEM' (General Chemistry - Organic, 3 units); 'GECONTWO' (The Contemporary World, 3 units); 'GEELECES' (Environmental Science, 3 units); 'GEPEFAWS' (First Aid and Water Safety, 2 units); 'L2CONOPO' (Comparative Models in Policing, 3 units); and 'L3LEPCMP' (Law Enforcement Operation and Planning with Crime Mapping, 3 units).\n\n**Second Year - Second Semester (Total: 23 Units)**\nThe second year concludes with: 'C5DRCIMA' (Dispute Resolution and Crises/Incidents Management, 3 units); 'CD1FCIN' (Fundamentals of Criminal Investigation and Intelligence, 4 units); 'CD2IRWP1' (Technical English 1 Investigative Report Writing and Presentation, 3 units); 'CL2CLBO1' (Criminal Law Book 1, 3 units); 'F2PEIDTE' (Personal Identification Techniques, 3 units); 'F3FOCHTO' (Forensic Chemistry and Toxicology, 5 units); and 'GEPEFUMM' (Fundamentals of Marksmanship, 2 units).",
    "keywords": [
      "BS Criminology Curriculum",
      "First Year Courses",
      "Second Year Courses",
      "Criminal Law",
      "Forensic Photography",
      "Forensic Chemistry",
      "Law Enforcement Administration",
      "Martial Arts",
      "EARIST CCJE"
    ]
  },
  {
    "id": "earist_ccje_bscrim_curriculum_years_3_and_4",
    "source": "BSCRIM.pdf",
    "category": "Academic Program - Bachelor of Science in Criminology",
    "topic": "Third and Fourth Year Curriculum, Internship, and Research",
    "content": "The advanced curriculum for the Bachelor of Science in Criminology at EARIST covers the Third and Fourth Years, focusing on specialized investigations, corrections, legal procedures, and research. The total number of units required to graduate from the program is 176 units.\n\n**Third Year - First Semester (Total: 28 Units)**\nThe required courses are: 'C6JDAJJS' (Juvenile Delinquency and Juvenile Justice System, 3 units); 'CA1INSCO' (Institutional Corrections, 3 units); 'CD3TELF2' (Technical English 2 - Legal Forms, 3 units); 'CD4TMAID' (Traffic Management and Accident Investigation with Driving, 3 units); 'CFLMINAP' (Character Formation 1 - Nationalism and Patriotism, 3 units); 'CL3CLBO2' (Criminal Law Book 2, 4 units); 'F4QUDOEX' (Questioned Documents Examination, 3 units); 'F5LIDETE' (Lie Detection Techniques, 3 units); and 'L4INSECO' (Introduction to Industrial Security Concepts, 3 units).\n\n**Third Year - Second Semester (Total: 27 Units)**\nStudents undertake: 'C7CRIMAS' (Criminological Research 1 - Research Methods with Applied Statistics, 3 units); 'CA2NOICO' (Non-Institutional Corrections, 3 units); 'CD5SCI1M' (Specialized Crime Investigation 1 with Legal Medicine, 3 units); 'CD7FPTAI' (Fire Protection and Arson Investigation, 3 units); 'CD8VDEAC' (Vice and Drug Education and Control, 3 units); 'CD9INCYB' (Introduction to Cybercrime and Environmental Laws and Protection, 3 units); 'CFLM2LDM' (Character Formation 2 - Leadership, Decision Making, Management and Administration, 3 units); 'CL4EVIDE' (Evidence, 3 units); and 'F6FORBAL' (Forensic Ballistics, 3 units).\n\n**Fourth Year - First Semester (Total: 16 Units)**\nThe final semester listed in the curriculum includes: 'C8CR2TWP' (Criminological Research 2 - Thesis Writing and Presentation, 3 units); 'CA3THEMO' (Therapeutic Modalities, 2 units); 'CD6SCI21' (Specialized Crime Investigation 2 with Simulation in Interrogation and Interview, 3 units); 'CL5CPCTE' (Criminal Procedure and Court Testimony, 3 units); 'CL6HURIE' (Human Rights Education, 3 units); and 'CP1IOJT1' (Internship / OJT 1 - 180 hours, 2 units). \n\nThis document was prepared by the Department Head and attested by the Dean of the College of Criminal Justice Education.",
    "keywords": [
      "BS Criminology Curriculum",
      "Third Year Courses",
      "Fourth Year Courses",
      "Criminological Research",
      "Thesis",
      "Internship",
      "OJT",
      "Criminal Law Book 2",
      "Ballistics",
      "Cybercrime",
      "Total Units 176"
    ]
  },
  {
    "id": "earist_cas_bscs_curriculum_years_1_and_2",
    "source": "BSCS.pdf",
    "category": "Academic Program - Bachelor of Science in Computer Science",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Arts and Sciences, prescribes the following curriculum for the first two years of the Bachelor of Science in Computer Science (BSCS) program, effective June 2018. \n\n**First Year - First Semester (Total: 26 Units)**\nStudents are required to take the following courses: 'FPROGLAB' and 'FPROGLEC' (Computer Programming 1 - Fundamentals of Programming, Laboratory and Lecture) credited for 3 units; 'GEARTAPP' (Art Appreciation) with 3 units; 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino) with 3 units; 'GELIFEWR' (The Life and Works of Rizal) with 3 units; 'GEMATHMW' (Mathematics in the Modern World) with 3 units; 'GEPEMOVE' (Movement Enhancement) with 2 units; 'GESCIETS' (Science, Technology and Society) with 3 units; 'NSTPROG1' (National Service Training Program 1) with 3 units; and 'INTROCOMP' (Introduction to Computing) with 3 units. No prerequisites are listed for these courses.\n\n**First Year - Second Semester (Total: 32 Units)**\nThe curriculum continues with: 'DBMGTLAB' and 'DBMGTLEC' (Database Management System Laboratory and Lecture) credited for 3 units total; 'DISSTRU1' (Discrete Structure 1) with 3 units; 'GEFILDIS' (Filipino sa Iba't ibang Disiplina) with 3 units; 'GEPANIPI' (Panitikan sa Pilipinas / Philippine Literature) with 3 units; 'GEPEFITE' (Fitness Exercises) with 2 units; 'GEPURPCO' (Purposive Communication) with 3 units; 'IPROGLAB' and 'IPROGLEC' (Computer Programming 2 - Intermediate Programming Laboratory and Lecture) credited for 3 units total; and 'NSTPROG2' (National Service Training Program 2) with 3 units. The NSTP requirement also includes a choice between CWTS, LTS, or MTS 2. Notably, 'IPROGLEC' requires 'CPROGLEC' (Logic Formulation) as a prerequisite.\n\n**Second Year - First Semester (Total: 20 Units)**\nStudents advance to: 'DIGDELAB' and 'DIGDELEC' (Digital Logic Design Laboratory and Lecture) with 3 units; 'DISSTRU2' (Discrete Structure 2) with 3 units; 'DSALGLAB' and 'DSALGLEC' (Data Structures and Algorithm Laboratory and Lecture) with 3 units; 'GEELECCP' (Communicative Proficiency in Business Correspondence and Research Writing) with 3 units; 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1) with 2 units; 'OOPRGLAB' and 'OOPRGLEC' (Object-Oriented Programming Laboratory and Lecture) with 3 units; and 'PHYCSLAB' and 'PHYCSLEC' (Physics for Computer Scientists Laboratory and Lecture) with 3 units.\n\n**Second Year - Second Semester (Total: 18 Units)**\nThe semester includes: 'CALCULUS' (Differential and Integral Calculus) with 3 units; 'GEPEHEF2' (Physical Activity Towards Health and Fitness II) with 2 units; 'GPXVCLAB' and 'GPXVCLEC' (Graphics and Visual Computing) with 3 units; 'INFOMGMT' (Information Management) with 3 units; 'MICROBOT' (Microprocessor & Introduction to Robotics) with 1 unit; 'NETCOMMS' (Networks and Communications) with 3 units; and 'PROGLLAB' and 'PROGLLEC' (Programming Language) with 3 units.",
    "keywords": [
      "BSCS Curriculum",
      "Computer Science",
      "Programming Courses",
      "First Year",
      "Second Year",
      "Data Structures",
      "Object Oriented Programming",
      "EARIST College of Arts and Sciences"
    ]
  },
  {
    "id": "earist_cas_bscs_curriculum_years_3_and_4",
    "source": "BSCS.pdf",
    "category": "Academic Program - Bachelor of Science in Computer Science",
    "topic": "Third and Fourth Year Curriculum, Thesis, and Internship",
    "content": "The advanced curriculum for the Bachelor of Science in Computer Science at EARIST covers the Third and Fourth Years, emphasizing software engineering, thesis writing, and industry immersion. The total number of units required to graduate from the BSCS program is 168 units.\n\n**Third Year - First Semester (Total: 19 Units)**\nThe curriculum requires: 'ALGCMPLX' (Algorithm and Complexity, 3 units); 'APDEVLAB' and 'APDEVLEC' (Application Development and Emerging Technology, 3 units total); 'ARCHIORG' (Architecture and Organization, 3 units); 'HUCOMINT' (Human Computer Interaction, 1 unit); 'INTELSYS' (Intelligent Systems, 3 units); 'OPERSYST' (Operating System, 3 units); and 'SOFTENG1' (Software Engineering 1, 3 units).\n\n**Third Year - Second Semester (Total: 18 Units)**\nStudents take: 'CSTHESI1' (Thesis 1, 3 units); 'GEELECDS' (Practical Data Science, 3 units); 'MOBAPLAB' and 'MOBAPLEC' (Mobile Application Development - iOS & Android, 3 units total); 'MOSIMLAB' and 'MOSIMLEC' (Modeling and Simulation, 3 units total); 'PARACOMP' (Parallel and Distributed Computing, 3 units); and 'SOFENGLA' and 'SOFTENG2' (Software Engineering 2, 3 units total).\n\n**Fourth Year - First Semester (Total: 20 Units)**\nThe senior year begins with: 'AUTOMATA' (Automata Theory and Formal Language, 3 units); 'CSTHESI2' and 'CSTHESL2' (Thesis 2 Lecture and Laboratory, 3 units total); 'GECONTWO' (The Contemporary World, 3 units); 'GEELECES' (Environmental Science, 3 units); 'GEUNDETS' (Understanding the Self, 3 units); 'INFOASEC' (Information Assurance and Security, 2 units); and 'SSUPPRAC' (Social Issues and Professional Practice, 3 units).\n\n**Fourth Year - Second Semester (Total: 15 Units)**\nThe final semester consists of: 'CSINTERN' (Practicum/Internship, 6 units); 'GEETHICS' (Ethics, 3 units); 'GEREADPH' (Readings in Philippine History, 3 units); and 'INDOBSFT' (Industry Observation & Field Trips, 3 units).",
    "keywords": [
      "BSCS Curriculum",
      "Third Year",
      "Fourth Year",
      "Software Engineering",
      "Thesis",
      "Internship",
      "Practicum",
      "Mobile Development",
      "Artificial Intelligence",
      "Total Units 168"
    ]
  },
  {
    "id": "earist_ced_bse_filipino_curriculum_years_1_and_2",
    "source": "BSE_FIL.pdf",
    "category": "Academic Program - Bachelor of Secondary Education (Filipino)",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Education, prescribes the following curriculum for the first two years of the Bachelor of Secondary Education (BSE) program, specifically for the Filipino Major. This curriculum is effective as of June 2018.\n\n**First Year - First Semester (Total: 32 Units)**\nThe introductory semester includes the following courses: 'FILINPWK' (Introduksyon sa Pag-aaral ng Wika) with 3 units; 'FILKRKLM' (Ang Filipino sa Kurikulum ng Batayang Edukasyon) with 3 units; 'FILPANLG' (Panimulang Linggwistika) with 3 units; 'GEARTAPP' (Art Appreciation) with 3 units; 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino) with 3 units; 'GELIFEWR' (The Life and Works of Rizal) with 3 units; 'GEMATHMW' (Mathematics in the Modern World) with 3 units; 'GEPEMOVE' (Movement Enhancement) with 2 units; 'GESCIENTS' (Science and Technology) with 3 units; 'NSTPLTS1' (NSTP Literacy Training Service 1) with 3 units; and 'NSTPROG1' (National Service Training Program 1) with 3 units.\n\n**First Year - Second Semester (Total: 32 Units)**\nThe curriculum continues with: 'FILESWKF' (Estruktura ng Wikang Filipino) with 3 units; 'FILPPMKP' (Pagturo at Pagtataya ng Makrong Kasanayan Pangwika) with 3 units; 'GEMELECHT' (Living in Information Technology Era) with 3 units; 'GEFILDIS' (Filipino sa Iba't ibang Disiplina) with 3 units; 'GEPEFITE' (Fitness Exercises) with 2 units; 'GEPURPCO' (Purposive Communication) with 3 units; 'GEREADPH' (Readings in Philippine History) with 3 units; 'GEUNDETS' (Understanding the Self) with 3 units; 'LITPANRE' (Panitikang Rehiyon) with 3 units; 'NSTPLTS2' (NSTP Literacy Training Service 2) with 3 units; and 'NSTPROG2' (National Service Training Program 2) with 3 units.\n\n**Second Year - First Semester (Total: 26 Units)**\nStudents advance to specialized and professional education courses: 'FILPGEBA' (Paghahanda at Ebalwasyon ng Kagamitang Panturo) with 3 units; 'FILUWKAL' (Ugnayan ng Wika, Kultura at Lipunan) with 3 units; 'GEADCPBR' (Communicative Proficiency in Business Correspondence and Research Writing) with 3 units; 'GECONTWO' (The Contemporary World) with 3 units; 'GEPANIPI' (Panitikan sa Pilipinas / Philippine Literature) with 3 units; 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1) with 2 units; 'LITKUPOP' (Kulturang Popular) with 3 units; 'PEDCALLP' (The Child and Adolescent Learners and Learning Principles) with 3 units; and 'PEDITPRO' (The Teaching Profession) with 3 units.\n\n**Second Year - Second Semester (Total: 26 Units)**\nThe second year concludes with: 'FILMASTL' (Masining na Talakayan) with 3 units; 'GEADDPS' (Practical Data Science) with 3 units; 'GEETHICS' (Ethics) with 3 units; 'GEPEHEF2' (Physical Activity Towards Health and Fitness II) with 2 units; 'LITMKNBF' (Maikling Kuwento at Nobelang Filipino) with 3 units; 'LITSANTA' (Sanaysay at Talumpati) with 3 units; 'LITSURIP' (Panunuring Pampanitikan) with 3 units; 'PEDTCSOL' (The Teacher and the Community, School Culture, and Organizational Leadership) with 3 units; and 'PEDTFTAL' (Technology for Teaching and Learning 1) with 3 units.",
    "keywords": [
      "BSE Filipino Curriculum",
      "First Year Courses",
      "Second Year Courses",
      "Wika at Panitikan",
      "Professional Education",
      "NSTP",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_ced_bse_filipino_curriculum_years_3_and_4",
    "source": "BSE_FIL.pdf",
    "category": "Academic Program - Bachelor of Secondary Education (Filipino)",
    "topic": "Third and Fourth Year Curriculum, Field Study, and Internship",
    "content": "The advanced curriculum for the Bachelor of Secondary Education (BSE) Major in Filipino at EARIST covers the Third and Fourth academic years. This includes advanced linguistics, literature, assessment strategies, and practical teaching experience. The total number of units required to complete the BSE Filipino program is 185 units.\n\n**Third Year - First Semester (Total: 27 Units)**\nStudents must complete: 'FILBBWKA' (Barayti at Baryasyon ng Wika) with 3 units; 'FILHAYAG' (Introduksyon sa Pamamahayag) with 3 units; 'FILNDWKP' (Mga Natatanging Diskurso sa Wika at Panitikan) with 3 units; 'FILSALIN' (Introduksyon sa Pagsasalin) with 3 units; 'FILSPWKP' (Introduksyon sa Pananaliksik-Wika at Panitikan) with 3 units; 'FILTCHLR' (Technology for Teaching and Learning 2 - Filipino) with 3 units; 'PEDASOL1' (Assessment of Learning 1) with 3 units; 'PEDFALCT' (Facilitating Learner-Centered Teaching) with 3 units; and 'PEDFOSIE' (Foundation of Special and Inclusive Education) with 3 units.\n\n**Third Year - Second Semester (Total: 24 Units)**\nThe curriculum requires: 'ELECFIGM' (Filipino Para sa Natanging Gamit) with 3 units; 'ELECFIWK' (Filipino bilang Ikalawang Wika) with 3 units; 'ELECWKPN' (Pananaliksik sa Wika at Panitikan) with 3 units; 'LITDULAF' (Dulang Filipino) with 3 units; 'LITULAFL' (Panulaang Filipino) with 3 units; 'PEDASOL2' (Assessment of Learning 2) with 3 units; 'PEDBELAC' (Building and Enhancing New Literacies Across the Curriculum) with 3 units; and 'PEDTSCUR' (The Teacher and The School Curriculum) with 3 units.\n\n**Fourth Year - First Semester (Total: 12 Units)**\nThe senior year focuses on field study and competency enhancement: 'ELECPIIK' (Paghahanda sa Iba't Ibang Kasanayan) with 3 units; 'PEDCOPRO' (Competencies Enhancement Program) with 3 units; 'PEDFSTDY1' (Field Study 1) with 3 units; and 'PEDFSTDY2' (Field Study 2) with 3 units.\n\n**Fourth Year - Second Semester (Total: 6 Units)**\nThe final requirement for graduation is 'PEDNTERN' (Teaching Internship), which is credited for 6 units. \n\nThis document is attested by the Dean of the College of Education.",
    "keywords": [
      "BSE Filipino Curriculum",
      "Third Year Courses",
      "Fourth Year Courses",
      "Field Study",
      "Teaching Internship",
      "Pananaliksik",
      "Assessment of Learning",
      "Total Units 185",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_ced_bse_math_curriculum_years_1_and_2",
    "source": "BSE_MATH.pdf",
    "category": "Academic Program - Bachelor of Secondary Education (Mathematics)",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, prescribes the following curriculum for the first two years of the Bachelor of Secondary Education (BSEd) program, specifically for the Mathematics Major. This curriculum is effective as of June 2018.\n\n**First Year - First Semester (Total: 29 Units)**\nThe introductory semester consists of the following courses: 'GEARTAPP' (Art Appreciation) with 3 units; 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino) with 3 units; 'GELIFEWR' (The Life and Works of Rizal) with 3 units; 'GEMATHMW' (Mathematics in the Modern World) with 3 units; 'GEPEMOVE' (Movement Enhancement) with 2 units; 'GESCIETS' (Science, Technology and Society) with 3 units; 'MATHCADA' (College and Advanced Algebra) with 3 units; 'MATHHIMA' (History of Mathematics) with 3 units; 'NSTPLTS1' (NSTP Literacy Training Service 1) with 3 units; and 'NSTPROG1' (National Service Training Program 1) with 3 units. No prerequisites are required for these subjects.\n\n**First Year - Second Semester (Total: 32 Units)**\nThe curriculum continues with: 'GEELECIT' (Living in Information Technology Era) with 3 units; 'GEFILDIS' (Filipino sa Iba't ibang Disiplina) with 3 units; 'GEPEFITE' (Fitness Exercises) with 2 units; 'GEPURPCO' (Purposive Communication) with 3 units; 'GEREADPH' (Readings in Philippine History) with 3 units; 'GEUNDETS' (Understanding the Self) with 3 units; 'MATHLOGC' (Logic and Set Theory) with 3 units; 'MATHPSGE' (Plane and Solid Geometry) with 3 units; 'MATHTRIG' (Trigonometry) with 3 units; 'NSTPLTS2' (NSTP Literacy Training Service 2) with 3 units; and 'NSTPROG2' (National Service Training Program 2) with 3 units.\n\n**Second Year - First Semester (Total: 27 Units)**\nStudents advance to more specialized math and professional education courses: 'GEADCPBR' (Communicative Proficiency in Business Correspondence and Research Writing) with 3 units; 'GECONTWO' (The Contemporary World) with 3 units; 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1) with 2 units; 'MATHCAG1' (Calculus 1 with Analytic Geometry) with 4 units; 'MATHESPR' (Elementary Statistics and Probability) with 3 units; 'MATHINVT' (Mathematics of Investment) with 3 units; 'MATHMODG' (Modern Geometry) with 3 units; 'PEDCALLP' (The Child and Adolescent Learners and Learning Principles) with 3 units; and 'PEDTTPRO' (The Teaching Profession) with 3 units.\n\n**Second Year - Second Semester (Total: 28 Units)**\nThe second year concludes with: 'GEELECDS' (Practical Data Science) with 3 units; 'GEETHICS' (Ethics) with 3 units; 'GEPANIPI' (Panitikan sa Pilipinas / Philippine Literature) with 3 units; 'GEPEHEF2' (Physical Activity Towards Health and Fitness II) with 2 units; 'MATHANA2' (Calculus 2) with 5 units; 'MATHLINA' (Linear Algebra) with 3 units; 'MATHNUMT' (Number Theory) with 3 units; 'PEDTCSOL' (The Teacher and the Community, School Culture, and Organizational Leadership) with 3 units; and 'PEDTFTAL' (Technology for Teaching and Learning 1) with 3 units.",
    "keywords": [
      "BSEd Math Curriculum",
      "Mathematics Major",
      "Calculus",
      "Linear Algebra",
      "Number Theory",
      "Geometry",
      "Professional Education",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_ced_bse_math_curriculum_years_3_and_4",
    "source": "BSE_MATH.pdf",
    "category": "Academic Program - Bachelor of Secondary Education (Mathematics)",
    "topic": "Third and Fourth Year Curriculum, Field Study, and Internship",
    "content": "The advanced curriculum for the Bachelor of Secondary Education (BSEd) Major in Mathematics at EARIST covers the Third and Fourth academic years. This stage focuses on advanced mathematical theories, pedagogical strategies, assessment methods, and practical teaching experience. The total number of units required to complete the BSEd Math program is 177 units.\n\n**Third Year - First Semester (Total: 25 Units)**\nThe required courses include: 'MATHADST' (Advance Statistics) with 3 units; 'MATHCAG3' (Calculus 3) with 3 units; 'MATHPSTM' (Principles and Strategies of Teaching Mathematics) with 3 units; 'MATHRESM' (Research in Mathematics) with 4 units; 'MATHSOME' (Solid Mensuration) with 3 units; 'PEDASOL.1' (Assessment of Learning 1) with 3 units; 'PEDFALCT' (Facilitating Learner-Centered Teaching) with 3 units; and 'PEDFOSIE' (Foundation of Special and Inclusive Education) with 3 units.\n\n**Third Year - Second Semester (Total: 21 Units)**\nStudents undertake: 'MATHABSA' (Abstract Algebra) with 3 units; 'MATHAEMA' (Assessment and Evaluation in Mathematics) with 3 units; 'MATHPSMI' (Problem Solving, Mathematical Investigation and Modelling) with 3 units; 'MATHTFTL' (Technology for Teaching and Learning 2 - Instrumentation and Technology in Mathematics) with 3 units; 'PEDASOL2' (Assessment of Learning 2) with 3 units; 'PEDBELAC' (Building and Enhancing New Literacies Across the Curriculum) with 3 units; and 'PEDTSCUR' (The Teacher and The School Curriculum) with 3 units.\n\n**Fourth Year - First Semester (Total: 9 Units)**\nThe senior year curriculum emphasizes field study and competency mastery: 'PEDCOPRO' (Competencies Enhancement Program) with 3 units; 'PEDFSTDY1' (Field Study 1) with 3 units; and 'PEDFSTDY2' (Field Study 2) with 3 units.\n\n**Fourth Year - Second Semester (Total: 6 Units)**\nThe final requirement for graduation is 'PEDNTERN' (Teaching Internship), which is credited for 6 units. \n\nThis curriculum document is prepared by the Department Head and attested by the Dean of the College of Education.",
    "keywords": [
      "BSEd Math Curriculum",
      "Third Year Courses",
      "Fourth Year Courses",
      "Calculus 3",
      "Abstract Algebra",
      "Field Study",
      "Teaching Internship",
      "Assessment of Learning",
      "Total Units 177",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_ced_bsed_science_curriculum_years_1_and_2",
    "source": "BSE_SCI.pdf",
    "category": "Academic Program - Bachelor of Secondary Education (Science)",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the administration of the College of Education, prescribes the following curriculum for the first two years of the Bachelor of Secondary Education (BSEd) program, specifically for the Science Major. This curriculum structure is effective as of June 2018.\n\n**First Year - First Semester (Total: 29 Units)**\nThe introductory semester mandates the following courses: 'ASTRONMY' (Astronomy) with 3 units; 'EARTHSCI' (Earth Science) with 3 units; 'GEARTAPP' (Art Appreciation) with 3 units; 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino) with 3 units; 'GELIFEWR' (The Life and Works of Rizal) with 3 units; 'GEMATHMW' (Mathematics in the Modern World) with 3 units; 'GEPEMOVE' (Movement Enhancement) with 2 units; 'GESCIETS' (Science, Technology and Society) with 3 units; 'NSTPLTS1' (NSTP Literacy Training Service 1) with 3 units; and 'NSTPROG1' (National Service Training Program 1) with 3 units. No prerequisites are indicated for this term.\n\n**First Year - Second Semester (Total: 29 Units)**\nThe curriculum continues with: 'ENVISCIE' (Environmental Science) with 3 units; 'GEELECIT' (Living in Information Technology Era) with 3 units; 'GEFILDIS' (Filipino sa Iba't ibang Disiplina) with 3 units; 'GEPEFITE' (Fitness Exercises) with 2 units; 'GEPURPCO' (Purposive Communication) with 3 units; 'GEREADPH' (Readings in Philippine History) with 3 units; 'GEUNDETS' (Understanding the Self) with 3 units; 'METORLGY' (Meteorology) with 3 units; 'NSTPLTS2' (NSTP Literacy Training Service 2) with 3 units; and 'NSTPROG2' (National Service Training Program 2) with 3 units.\n\n**Second Year - First Semester (Total: 29 Units)**\nStudents proceed to specialized science and professional education courses: 'CELLMBIO' (Cell and Molecular Biology) with 4 units; 'FLUIDMEC' (Fluid Mechanics) with 3 units; 'GEADCPBR' (Communicative Proficiency in Business Correspondence and Research Writing) with 3 units; 'GECONTWO' (The Contemporary World) with 3 units; 'GEPANIPI' (Panitikan sa Pilipinas / Philippine Literature) with 3 units; 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1) with 2 units; 'INORGCHM' (Inorganic Chemistry) with 5 units; 'PEDCALLP' (The Child and Adolescent Learners and Learning Principles) with 3 units; and 'PEDTTPRO' (The Teaching Profession) with 3 units.\n\n**Second Year - Second Semester (Total: 27 Units)**\nThe second year concludes with: 'ANALCHEM' (Analytical Chemistry) with 5 units; 'GEADDPDS' (Practical Data Science) with 3 units; 'GEETHICS' (Ethics) with 3 units; 'GENESCIE' (Genetics) with 4 units; 'GEPEHEF2' (Physical Activity Towards Health and Fitness II) with 2 units; 'PEDTCSOL' (The Teacher and the Community, School Culture, and Organizational Leadership) with 3 units; 'PEDTFTAL' (Technology for Teaching and Learning 1) with 3 units; and 'THERMODY' (Thermodynamics) with 4 units.",
    "keywords": [
      "BSEd Science Curriculum",
      "Science Major",
      "Astronomy",
      "Earth Science",
      "Inorganic Chemistry",
      "Analytical Chemistry",
      "Genetics",
      "Meteorology",
      "Professional Education",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_ced_bsed_science_curriculum_years_3_and_4",
    "source": "BSE_SCI.pdf",
    "category": "Academic Program - Bachelor of Secondary Education (Science)",
    "topic": "Third and Fourth Year Curriculum, Field Study, and Internship",
    "content": "The advanced curriculum for the Bachelor of Secondary Education (BSEd) Major in Science at EARIST covers the Third and Fourth academic years. This stage focuses on advanced scientific disciplines (Physics, Chemistry, Biology), pedagogical strategies, assessment methods, and practical teaching experience via field study and internship. The total number of units required to graduate from the BSEd Science program is 183 units.\n\n**Third Year - First Semester (Total: 25 Units)**\nThe required courses include: 'ELECMAGN' (Electricity and Magnetism) with 4 units; 'MICROPRA' (Microbiology and Parasitology) with 4 units; 'ORGACHEM' (Organic Chemistry) with 5 units; 'PEDASOL1' (Assessment of Learning 1) with 3 units; 'PEDFALCT' (Facilitating Learner-Centered Teaching) with 3 units; 'PEDFOSIE' (Foundation of Special and Inclusive Education) with 3 units; and 'TECTLSCI' (Technology for Teaching and Learning Science 2) with 3 units.\n\n**Third Year - Second Semester (Total: 29 Units)**\nStudents undertake: 'ANPHYSIO' (Anatomy and Physiology) with 4 units; 'BIOCHEMI' (Biochemistry) with 3 units; 'MODRNPHY' (Modern Physics) with 3 units; 'PEDASOL2' (Assessment of Learning 2) with 3 units; 'PEDBELAC' (Building and Enhancing New Literacies Across the Curriculum) with 3 units; 'PEDTSCUR' (The Teacher and The School Curriculum) with 3 units; 'RSRCHSCI' (Research in Teaching Science) with 3 units; 'TEACHSCI' (The Teaching of Science) with 3 units; and 'WAVESOPT' (Waves & Optics) with 4 units.\n\n**Fourth Year - First Semester (Total: 9 Units)**\nThe senior year curriculum emphasizes field study and competency mastery: 'PEDCOPRO' (Competencies Enhancement Program) with 3 units; 'PEDFSTDY1' (Field Study 1) with 3 units; and 'PEDFSTDY2' (Field Study 2) with 3 units.\n\n**Fourth Year - Second Semester (Total: 6 Units)**\nThe final requirement for graduation is 'PEDNTERN' (Teaching Internship), which is credited for 6 units.\n\nThis curriculum document is prepared by the Department Head and attested by the Dean of the College of Education.",
    "keywords": [
      "BSEd Science Curriculum",
      "Third Year Courses",
      "Fourth Year Courses",
      "Organic Chemistry",
      "Microbiology",
      "Biochemistry",
      "Modern Physics",
      "Field Study",
      "Teaching Internship",
      "Assessment of Learning",
      "Total Units 183",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_coe_bsece_curriculum_years_1_and_2",
    "source": "BSECE.pdf",
    "category": "Academic Program - Bachelor of Science in Electronics and Communication Engineering",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Engineering, prescribes the following curriculum for the first two years of the Bachelor of Science in Electronics and Communication Engineering (BSECE) program. This curriculum structure is effective as of June 2018.\n\n**First Year - First Semester (Total: 28 Units)**\nThe introductory semester consists of the following courses: 'CENCAD 111' (Computer Aided Drafting, 1 unit); 'CENMAT01' (Differential Calculus, 3 units); 'CENMATH 111' (Mathematics for Engineers, 3 units); 'GEARTAPP' (Art Appreciation, 3 units); 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino, 3 units); 'GEMATHMW' (Mathematics in the Modern World, 3 units); 'GEPEMOVE' (Movement Enhancement, 2 units); 'GESCIETS' (Science, Technology and Society, 3 units); 'NATSCI SP_102' (Chemistry for Engineers, 4 units); and 'NSTPROG1' (National Service Training Program 1, 3 units). No prerequisites are listed for this term.\n\n**First Year - Second Semester (Total: 29 Units)**\nThe curriculum continues with: 'CENENVIR' (Environmental Science and Engineering, 3 units); 'CENPHY2' (Physics 2, 4 units, Prereq: Chemistry); 'ECE 110L1' (ECE Workshop 1, 1 unit, Prereq: Math for Engineers); 'GEELECIT' (Living in Information Technology Era, 3 units); 'GEPANIPI' (Panitikan sa Pilipinas, 3 units); 'GEPEFITE' (Fitness Exercises, 2 units); 'GEREADPH' (Readings in Philippine History, 3 units); 'MATH 104' (Calculus II / Integral Calculus, 3 units, Prereq: Diff Calc & Math for Engineers); 'NATSCI103A' (Physics for Engineers - Calculus Based, 4 units); and 'NSTPROG2' (NSTP 2, 3 units).\n\n**Second Year - First Semester (Total: 26 Units)**\nStudents advance to core engineering subjects: 'CENMSE' (Material Science and Engineering, 3 units); 'CENPROG' (Computer Programming, 1 unit); 'DIFFEQUA' (Differential Equations, 3 units, Prereq: Calculus II); 'ECENG211' (Electronics 1: Electronics Devices and Circuits, 4 units, Prereq: Physics for Engineers & ECE Workshop); 'EECO 311' (Engineering Economy, 3 units); 'EEENG 211' (Electrical Circuits 1, 4 units, Prereq: Physics 2); 'GEADCPBR' (Communicative Proficiency in Business Correspondence and Research Writing, 3 units); 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1, 2 units); and 'MM16' (Engineering Data Analysis, 3 units).\n\n**Second Year - Second Semester (Total: 28 Units)**\nThe second year concludes with: 'CVENG316' (Engineering Management, 2 units); 'ECENG221B' (Electronics 2: Electronic Circuit Analysis and Design, 4 units, Prereq: Electronics 1); 'ECENG222' (Communications 1: Principles of Communication System, 4 units, Coreq: Electronics 2); 'EEENG 221' (Electrical Circuits 2, 4 units, Prereq: Electrical Circuits 1); 'EEN 323' (Electromagnetics, 3 units, Prereq: Diff Eq); 'GEADDPDS' (Practical Data Science, 3 units); 'GEPEHEF2' (Physical Activity Towards Health and Fitness II, 2 units); 'GEUNDETS' (Understanding the Self, 3 units); and 'MATH319B' (Advance Engineering Mathematics for ECE, 3 units, Prereq: Diff Eq).",
    "keywords": [
      "BSECE Curriculum",
      "Electronics Engineering",
      "First Year Courses",
      "Second Year Courses",
      "Differential Calculus",
      "Physics for Engineers",
      "Electrical Circuits",
      "Electronics Devices",
      "Electromagnetics",
      "EARIST College of Engineering"
    ]
  },
  {
    "id": "earist_coe_bsece_curriculum_year_3_and_summer",
    "source": "BSECE.pdf",
    "category": "Academic Program - Bachelor of Science in Electronics and Communication Engineering",
    "topic": "Third Year Curriculum and Summer Internship",
    "content": "The Third Year curriculum of the Bachelor of Science in Electronics and Communication Engineering at EARIST focuses on advanced electronic systems, digital logic, communications, and mandatory industry training.\n\n**Third Year - First Semester (Total: 25 Units)**\nThe required courses include: 'ECENG311' (Electronics 3: Electronic Systems and Design, 4 units, Prereq: Electronics 2); 'ECENG312' (Digital Electronics 1: Logic Circuits and Switching Theory, 4 units, Prereq: Electronics 1); 'ECENG313' (Signals, Spectra, and Signal Processing, 4 units, Prereq: Adv Math for ECE); 'ECENG314' (Communications 2: Modulation and Coding Techniques, 4 units, Prereq: Comms 1); 'GECONTWO' (The Contemporary World, 3 units); 'GEETHICS' (Ethics, 3 units); and 'GELIFEWR' (The Life and Works of Rizal, 3 units).\n\n**Third Year - Second Semester (Total: 22 Units)**\nStudents undertake specialized tracks: 'ECENG 321' (Communication 3: Transmission Media, Antenna System and Design, 4 units); 'ECENG322' (Communications 4: Data Communications, 4 units, Prereq: Comms 2); 'ECENG323' (Digital Electronics 2: Microprocessor & Microcontroller Systems & Design, 4 units, Prereq: Digital Electronics 1); 'ECENG324' (Feedback and Control Systems, 4 units, Prereq: Adv Math for ECE); 'ECENG325' (ECE Laws, Contracts, Ethics, Standards & Safety, 3 units); and 'GEPURPCO' (Purposive Communication, 3 units).\n\n**Summer Term (Total: 3 Units)**\nThe curriculum mandates 'CENOTJOB' (On-the-Job Training), which requires 300 hours of practical work experience and is credited for 3 units.",
    "keywords": [
      "BSECE Curriculum",
      "Third Year Courses",
      "Electronic Systems",
      "Digital Electronics",
      "Signal Processing",
      "Data Communications",
      "Microprocessor",
      "Feedback Control Systems",
      "OJT",
      "Internship"
    ]
  },
  {
    "id": "earist_coe_bsece_curriculum_year_4",
    "source": "BSECE.pdf",
    "category": "Academic Program - Bachelor of Science in Electronics and Communication Engineering",
    "topic": "Fourth Year Curriculum, Electives, and Capstone Project",
    "content": "The final year of the BSECE program at EARIST emphasizes research, specialized electives, licensure review, and the capstone design project. The total number of units required to graduate from this program is 198 units.\n\n**Fourth Year - First Semester (Total: 21 Units)**\nThe curriculum includes: 'CENTECNO' (Technopreneurship, 3 units); 'ECENG411' (Methods of Research, 3 units); 'ECENG412' (ECE Elective 1: Advanced Communication System and Design, 4 units, Prereq: Comms 4); 'ECENG413' (ECE Elective 2: Advanced Power Supply Systems, 4 units, Prereq: Circuits 2 & Electronics 3); 'ECENG414' (ECE Elective 3: Advanced Instrumentation & Control Systems, 4 units, Prereq: Feedback Control); 'ECENG415' (Design 1 / Capstone Project, 1 unit); and 'ECENG416' (Review 1: Mathematics & GEAS, 2 units).\n\n**Fourth Year - Second Semester (Total: 16 Units)**\nThe program concludes with: 'ECENG421' (Seminars/Colloquium, 1 unit); 'ECENG422' (Design 2 / Capstone Project 2, 1 unit, Prereq: Design 1); 'ECENG423' (ECE Elective 4: Advanced Networking, 4 units, Prereq: Comms 4 & Elective 1); 'ECENG424' (ECE Elective 5: Renewable Energy Systems, 4 units, Prereq: Elective 2 & Circuits 2); 'ECENG425' (ECE Elective 6: Robotics Technology, 4 units, Prereq: Elective 3 & Electronics 3); and 'ECENG426' (Review 2: Electronics & Communications / EST, 2 units).",
    "keywords": [
      "BSECE Curriculum",
      "Fourth Year Courses",
      "Technopreneurship",
      "ECE Electives",
      "Capstone Project",
      "Licensure Review",
      "Robotics Technology",
      "Renewable Energy",
      "Advanced Networking",
      "Total Units 198",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_coe_bsee_curriculum_years_1_and_2",
    "source": "BSEE.pdf",
    "category": "Academic Program - Bachelor of Science in Electrical Engineering",
    "topic": "First and Second Year Curriculum Structure",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), under the College of Engineering, prescribes the following curriculum for the first two years of the Bachelor of Science in Electrical Engineering (BSEE) program. This curriculum is effective as of June 2018.\n\n**First Year - First Semester (Total: 25 Units)**\nThe introductory semester consists of the following courses: 'CENCAD 111' (Computer Aided Drafting, 1 unit); 'CENMAT01' (Differential Calculus, 3 units); 'GEARTAPP' (Art Appreciation, 3 units); 'GEKOMFIL' (Kontekstwalisadong Komunikasyon sa Filipino, 3 units); 'GEMATHMW' (Mathematics in the Modern World, 3 units); 'GEPEMOVE' (Movement Enhancement, 2 units); 'GESCIETS' (Science, Technology and Society, 3 units); 'NATSCI_SP_102' (Chemistry for Engineers, 4 units); and 'NSTPROG1' (National Service Training Program 1, 3 units). No prerequisites are listed for this semester.\n\n**First Year - Second Semester (Total: 27 Units)**\nThe curriculum continues with: 'GEELECIT' (Living in Information Technology Era, 3 units); 'GEPANIPI' (Panitikan sa Pilipinas, 3 units); 'GEPEFITE' (Fitness Exercises, 2 units); 'GEPURPCO' (Purposive Communication, 3 units); 'GEREADPH' (Readings in Philippine History, 3 units); 'GEUNDETS' (Understanding the Self, 3 units); 'MATH_104' (Calculus II / Integral Calculus, 3 units, Prereq: Differential Calculus); 'NATSCI103A' (Physics for Engineers - Calculus Based, 4 units, Prereq: Differential Calculus); and 'NSTPROG2' (National Service Training Program 2, 3 units).\n\n**Second Year - First Semester (Total: 27 Units)**\nStudents advance to core engineering courses: 'CENPROG' (Computer Programming, 1 unit); 'DIFFEQUA' (Differential Equations, 3 units, Prereq: Calculus II); 'EEENG_211' (Electrical Circuits 1, 4 units, Prereq: Calculus II & Physics for Engineers); 'EEMCH 211' (Engineering Mechanics, 3 units, Prereq: Calculus II & Physics for Engineers); 'EEMEN 211' (Basic Thermodynamics, 2 units, Prereq: Physics for Engineers); 'GECONTWO' (The Contemporary World, 3 units); 'GEELECCP' (Communicative Proficiency in Business Correspondence and Research Writing, 3 units); 'GEETHICS' (Ethics, 3 units); 'GEPEHEF1' (Physical Activity Towards Health and Fitness 1, 2 units); and 'MM16' (Engineering Data Analysis, 3 units, Prereq: Calculus II).\n\n**Second Year - Second Semester (Total: 22 Units)**\nThe second year concludes with: 'ECENG 221' (Electronics Circuits: Devices and Analysis, 4 units, Prereq: Electrical Circuits 1); 'EEENG 221' (Electrical Circuits 2, 4 units, Prereq: Electrical Circuits 1); 'EEENG 222' (Engineering Math for EE, 3 units, Prereq: Differential Equations); 'EEENG_223' (Electromagnetics, 2 units, Prereq: Physics for Engineers & Differential Equations); 'EEMCH 221' (Fundamentals of Deformable Bodies, 2 units, Prereq: Engineering Mechanics); 'EEMCH 222' (Fluid Mechanics, 2 units, Prereq: Physics 1); 'GEELECDS' (Practical Data Science, 3 units); and 'GEPEHEF2' (Physical Activity Towards Health and Fitness II, 2 units).",
    "keywords": [
      "BSEE Curriculum",
      "Electrical Engineering",
      "First Year Courses",
      "Second Year Courses",
      "Differential Calculus",
      "Physics for Engineers",
      "Electrical Circuits",
      "Thermodynamics",
      "Electromagnetics",
      "EARIST College of Engineering"
    ]
  },
  {
    "id": "earist_coe_bsee_curriculum_year_3_and_summer",
    "source": "BSEE.pdf",
    "category": "Academic Program - Bachelor of Science in Electrical Engineering",
    "topic": "Third Year Curriculum and Summer Internship",
    "content": "The Third Year curriculum of the Bachelor of Science in Electrical Engineering at EARIST focuses on advanced electrical systems, machinery, and control systems, culminating in a summer internship.\n\n**Third Year - First Semester (Total: 22 Units)**\nRequired courses include: 'CENENECO' (Engineering Economy, 3 units, Prereq: Engineering Data Analysis); 'EEENG311' (Electrical Circuits 3 / Polyphase, 2 units, Prereq: Electrical Circuits 2); 'EEENG312' (Numerical Methods and Analysis, 3 units, Prereq: Engineering Math for EE); 'EEENG313' (Electrical Machines 1, 4 units, Prereq: Electrical Circuits 1 & Electromagnetics); 'EEFUNECO' (Fundamentals of Electronics Communication, 3 units, Prereq: Electronics Circuits); 'EEINELEC' (Industrial Electronics, 4 units, Prereq: Electronics Circuits); and 'EELOGCKT' (Logic Circuit and Switching Theory, 3 units, Prereq: Electronics Circuits).\n\n**Third Year - Second Semester (Total: 27 Units)**\nStudents undertake: 'CENENVIR' (Environmental Science and Engineering, 3 units); 'ECENG321' (Microprocessor System, 4 units); 'EEENG321' (EE Laws, Codes and Professional Ethics, 3 units, Prereq: Ethics); 'EEENG322' (Electrical Machines 2, 4 units, Prereq: Electrical Machines 1); 'EEENG323' (Electrical Apparatus and Devices, 3 units, Prereq: Electrical Circuits 2); 'EEENG324' (Basic Occupational Safety and Health, 3 units); 'EEENG325' (Feedback Control Systems, 4 units, Prereq: Engineering Math for EE); and 'EEENG326' (Management of Engineering Projects and Estimate, 3 units) .\n\n**Summer Term (Total: 3 Units)**\nThe curriculum mandates 'CENOTJOB' (On-the-Job Training), which requires 300 hours of practical work and is credited for 3 units.",
    "keywords": [
      "BSEE Curriculum",
      "Third Year Courses",
      "Electrical Machines",
      "Polyphase Circuits",
      "Industrial Electronics",
      "Feedback Control Systems",
      "EE Laws and Codes",
      "OJT",
      "Internship"
    ]
  },
  {
    "id": "earist_coe_bsee_curriculum_year_4",
    "source": "BSEE.pdf",
    "category": "Academic Program - Bachelor of Science in Electrical Engineering",
    "topic": "Fourth Year Curriculum, Electives, and Capstone Project",
    "content": "The final year of the BSEE program at EARIST emphasizes design, research, specialized electives, and licensure review. The total number of units required to graduate from this program is 196 units.\n\n**Fourth Year - First Semester (Total: 26 Units)**\nThe curriculum includes: 'CENMATSC' (Material Science and Engineering, 3 units, Prereq: Chemistry & Deformable Bodies); 'CENTECNO' (Technopreneurship, 3 units); 'EEENG411' (Electrical Standards and Practices, 1 unit, Prereq: EE Laws); 'EEENG412' (Electrical Systems and Illumination Design, 5 units, Prereq: Electrical Machines 2); 'EEENG413' (EE Elective 1: Power System Protection 1, 3 units); 'EEENG414' (Research Methods, 2 units, Prereq: Engineering Data Analysis); 'EEENG415' (Instrumentation and Control, 3 units, Prereq: Feedback Control Systems); 'EEENG416' (Review 1: ESAS & Mathematics, 2 units); 'EEENG417' (Adv. AutoCAD for EE, 1 unit, Prereq: Computer Aided Drafting); and 'GELIFEWR' (The Life and Works of Rizal, 3 units).\n\n**Fourth Year - Second Semester (Total: 17 Units)**\nThe program concludes with: 'EEENG421' (Power System Analysis, 5 units, Prereq: Electrical Standards); 'EEENG422' (EE Elective 2: Power System Protection 2, 3 units, Prereq: EE Elective 1); 'EEENG423' (Research Project or Capstone Design Project, 2 units, Prereq: Research Methods); 'EEENG424' (Seminars/Field Trip/Colloquia, 1 unit); 'EEENG425' (Fundamentals of Power Plant Design, 1 unit, Coreq: Power System Analysis); 'EEENG426' (Distribution Systems and Substation Design, 3 units, Coreq: Power System Analysis); and 'EEENG427' (Review 2: Electrical Engineering, 2 units).",
    "keywords": [
      "BSEE Curriculum",
      "Fourth Year Courses",
      "Power System Analysis",
      "Illumination Design",
      "Capstone Project",
      "Power Plant Design",
      "Substation Design",
      "Licensure Review",
      "Total Units 196",
      "Graduation Requirements"
    ]
  },
  {
    "id": "earist_bs_entrep_curriculum_years_1_and_2",
    "source": "BS Entrepreneurship Curriculum (June 2018)",
    "category": "Curriculum and Course Offerings",
    "topic": "First and Second Year Course Requirements",
    "content": "The Bachelor of Science in Entrepreneurship program offered by the College of Business and Public Administration at the Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST) establishes a specific academic roadmap for the first two years of study. \n\nFor the First Year, First Semester, the curriculum requires a total of 20 units consisting of the following courses: Movement Enhancement (GEPEMOVE, 2 units); Readings in Philippine History (GEREADPH, 3 units); Understanding the Self (GEUNDETS, 3 units); Human Resource Management (HURSMNGT, 3 units); Microeconomics (MICROECO, 3 units); National Service Training Program 1 (NSTPROG1, 3 units); and Opportunity Seeking (OPPOSEEK, 3 units). There are no prerequisites for these introductory courses.\n\nIn the First Year, Second Semester, students undertake a heavier load of 26 units. The courses include: Entrepreneurial Behavior (ENBEHAVE, 3 units) which requires OPPOSEEK; Art Appreciation (GEARTAPP, 3 units); Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL, 3 units); Mathematics in the Modern World (GEMATHMW, 3 units); Fitness Exercises (GEPEFITE, 2 units) requiring GEPEMOVE; Purposive Communication (GEPURPCO, 3 units); Science, Technology and Society (GESCIETS, 3 units); National Service Training Program 2 (NSTPROG2, 3 units); and Social Entrepreneurship (SOCIALEN, 3 units) which requires OPPOSEEK.\n\nMoving to the Second Year, First Semester, the curriculum mandates 20 units. Courses offered are: Business Law and Taxation (BUSLWTXN, 3 units); Business Plan Preparation (BUSPLNPR, 3 units) requiring SOCIALEN; The Contemporary World (GECONTWO, 3 units); Ethics (GEETHICS, 3 units); Filipino sa Iba't ibang Disiplina (GEFILDIS, 3 units); Physical Activity Towards Health and Fitness 1 (GEPEHEF1, 2 units) requiring GEPEMOVE; and Market Research and Consumer Behavior (MKTRESCH, 3 units) which requires ENBEHAVE.\n\nFinally, the Second Year, Second Semester consists of 20 units covering: The Life and Works of Rizal (GELIFEWR, 3 units); Panitikan sa Pilipinas / Philippine Literature (GEPANIPI, 3 units); Physical Activity Towards Health and Fitness II (GEPEHEF2, 2 units); Operations Management (TQM) (OPTNMNGT, 3 units); Program and Policies on Enterprise Development (PRGPOLED, 3 units) requiring BUSPLNPR; Pricing and Costing (PRICSTRA, 3 units); and Strategic Management (STRAMNGT, 3 units).",
    "keywords": [
      "BS Entrepreneurship",
      "freshman curriculum",
      "sophomore curriculum",
      "prerequisites",
      "OPPOSEEK",
      "BUSPLNPR",
      "course codes",
      "EARIST business program",
      "NSTP",
      "general education"
    ]
  },
  {
    "id": "earist_bs_entrep_curriculum_years_3_and_4",
    "source": "BS Entrepreneurship Curriculum (June 2018)",
    "category": "Curriculum and Course Offerings",
    "topic": "Third and Fourth Year Course Requirements and Program Totals",
    "content": "The advanced stages of the Bachelor of Science in Entrepreneurship at EARIST, under the College of Business and Public Administration, focus on specialized business tracks and practical implementation during the third and fourth years. \n\nThe Third Year, First Semester comprises 18 units with the following subjects: E-commerce (ECOMMERC, 3 units); Entrepreneurial Marketing Strategies (ENTMKSTR, 3 units) which requires PRGPOLED (Program and Policies on Enterprise Development); Events Management (EVNTMNGT, 3 units); Financial Management (FINLMNGT, 3 units); International Business and Trade (INTLBATT, 3 units); and Manufacturing (MFGTRAC1, 3 units). All courses in this semester aside from ENTMKSTR have no stated prerequisites in this document.\n\nFor the Third Year, Second Semester, the load is 15 units. The courses are specialized tracks including: Agribusiness (AGRTRAC3, 3 units) requiring MFGTRAC1; Distribution Management (DISTMNGT, 3 units); Franchising (FRANCHIS, 3 units); Innovation Management (INNOMNGT, 3 units) requiring ENTMKSTR; and Managing a Service Enterprise (MSETRAC2, 3 units) which requires MFGTRAC1.\n\nThe Fourth Year is dedicated exclusively to the capstone project, split into two semesters. The Fourth Year, First Semester consists of Business Plan Implementation I (BUSPLAN1), a 5-unit course (2 lecture, 3 lab) that requires BUSPLNPR (Business Plan Preparation). The Fourth Year, Second Semester follows with Business Plan Implementation II (BUSPLAN2), also a 5-unit course (2 lecture, 3 lab) requiring BUSPLAN1.\n\nSummary of Program Standards: The total number of units required to graduate with a Bachelor of Science in Entrepreneurship is 129 units. This curriculum effectivity date is listed as June 2018. The document is attested by the Dean and the Head of the College.",
    "keywords": [
      "BS Entrepreneurship",
      "junior curriculum",
      "senior curriculum",
      "graduation requirements",
      "total units",
      "Business Plan Implementation",
      "BUSPLAN1",
      "BUSPLAN2",
      "MFGTRAC1",
      "capstone project",
      "specialized tracks"
    ]
  },
  {
    "id": "earist_bsned_curriculum_years_1_2",
    "source": "EARIST BSNED Curriculum File",
    "category": "College of Education Curriculum",
    "topic": "Bachelor of Special Needs Education (Generalist) - First and Second Year Course Offerings",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), College of Education, offers the Bachelor of Special Needs Education (Generalist). The curriculum for the First and Second Years is structured as follows:\n\n**First Year - First Semester (Total: 26 Units)**\nThe courses required are:\n1. GEELECIT: Living in Information Technology Era (3 units).\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 units).\n3. GEPEMOVE: Movement Enhancement (2 units).\n4. GEPURPCO: Purposive Communication (3 units).\n5. GEREADPH: Readings in Philippine History (3 units).\n6. GEUNDETS: Understanding the Self (3 units).\n7. NSTPLTS1: NSTP Literacy Training Service 1 (3 units).\n8. NSTPROG1: National Service Training Program 1 (3 units).\n9. PEDCALLP: The Child and Adolescent Learners and Learning Principles (3 units).\n\n**First Year - Second Semester (Total: 26 Units)**\nThe courses required are:\n1. FOSPINED: Foundations of Special Education (3 units).\n2. GEARTAPP: Art Appreciation (3 units).\n3. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 units). Prerequisite: GEKOMFIL.\n4. GELIFEWR: The Life and Works of Rizal (3 units).\n5. GEMATHMW: Mathematics in the Modern World (3 units).\n6. GEPEFITE: Fitness Exercises (2 units).\n7. GESCIETS: Science, Technology and Society (3 units).\n8. NSTPLTS2: NSTP Literacy Training Service 2 (3 units). Prerequisite: NSTPLTS1.\n9. NSTPROG2: National Service Training Program 2 (3 units).\n\n**Second Year - First Semester (Total: 26 Units)**\nThe courses required are:\n1. GEADDPDS: Practical Data Science (3 units).\n2. GEETHICS: Ethics (3 units).\n3. GEPANIPI: Panitikan sa Pilipinas / Philippine Literature (3 units). Prerequisite: GEFILDIS.\n4. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 units).\n5. PEDTSCUR: The Teacher and The School Curriculum (3 units).\n6. PEDTTPRO: The Teaching Profession (3 units).\n7. SNEDLSPD: Learners with Sensory and Physical Disabilities (3 units).\n8. SNEDLWDD: Learners with Developmental Disabilities (3 units).\n9. SNLEBLCD: Learners with Emotional, Behavioral, Language and Communication Disabilities (3 units).\n\n**Second Year - Second Semester (Total: 26 Units)**\nThe courses required are:\n1. GEADCPBR: Communicative Proficiency in Business Correspondence and Research Writing (3 units).\n2. GECONTWO: The Contemporary World (3 units).\n3. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 units).\n4. PEDFALCT: Facilitating Learner-Centered Teaching (3 units).\n5. PEDTCSOL: The Teacher and the Community, School Culture, and Organizational Leadership (3 units).\n6. PEDTFTAL: Technology for Teaching and Learning 1 (3 units).\n7. SNEDCPIE: Curriculum and Pedagogy in Inclusive Education (3 units). Prerequisite: FOSPINED.\n8. SNEDEASA: Educational Assessment of Students with Additional Needs (3 units). Prerequisite: FOSPINED.\n9. SNEDGTLS: Gifted and Talented Learners (3 units).",
    "keywords": [
      "BSNED",
      "Special Needs Education",
      "Generalist",
      "Curriculum",
      "First Year",
      "Second Year",
      "NSTP",
      "General Education",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_bsned_curriculum_years_3_4",
    "source": "EARIST BSNED Curriculum File",
    "category": "College of Education Curriculum",
    "topic": "Bachelor of Special Needs Education (Generalist) - Third and Fourth Year Course Offerings",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), College of Education, outlines the advanced curriculum for the Bachelor of Special Needs Education (Generalist) for the Third and Fourth Years as follows:\n\n**Third Year - First Semester (Total: 21 Units)**\nThe courses required are:\n1. PEDASOL1: Assessment of Learning 1 (3 units).\n2. PEDBELAC: Building and Enhancing New Literacies Across the Curriculum (3 units).\n3. SNAPERMH: Adapted Physical Education and Recreation, Music, and Health (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n4. SNEDEMAM: Behavior Management and Modification (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n5. SNEDTRED: Transition Education (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n6. SNINALLI: Instructional Adaptations in Language and Literacy Instruction (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n7. SNINAMSI: Instructional Adaptations in Mathematics and Science Instruction (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n\n**Third Year - Second Semester (Total: 15 Units)**\nThe courses required are:\n1. PEDASOL2: Assessment of Learning 2 (3 units). Prerequisite: PEDASOL1.\n2. SNEDDIEP: Development of Individualized Education Plans (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n3. SNEDECIE: Early Childhood Inclusive Education (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n4. SNINATCA: Instructional Adaptations for Teaching the Content Areas (Social Sciences, Humanities) (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n5. SNRESNIE: Research in Special Needs and Inclusive Education (3 units). Prerequisite: SNEDTRED.\n\n**Fourth Year - First Semester**\nThe curriculum lists the following major courses:\n1. PEDCOPRO: Competencies Enhancement Program (3 units). This course has an extensive list of prerequisites covering nearly the entire program, including: SNRESNIE, PEDASOL2, GEPEHEF2, GEADCPBR, GECONTWO, GEPEHEF1, GEPANIPI, GEADDPDS, GEETHICS, GEPEFITE, GEFILDIS, GEARTAPP, GELIFEWR, GESCIETS, GEMATHMW, GEPEMOVE, GEKOMFIL, GEELECIT, GEUNDETS, GEREADPH, GEPURPCO, PEDTSCUR, PEDTTPRO, FOSPINED, PEDCALLP, SNEDLWDD, SNEDLSPD, SNLEBLCD, PEDFALCT, PEDTCSOL, PEDTFTAL, and SNEDGTLS.\n2. PEDFSTDY1: Field Study 1 (3 units). Prerequisite: PEDFSTDY1 requires completion of prerequisite major subjects.",
    "keywords": [
      "BSNED",
      "Special Needs Education",
      "Third Year",
      "Fourth Year",
      "Field Study",
      "Competencies Enhancement Program",
      "Prerequisites",
      "Research",
      "Inclusive Education"
    ]
  },
  {
    "id": "earist_bsned_curriculum_years_1_2",
    "source": "EARIST BSNED Curriculum File",
    "category": "College of Education Curriculum",
    "topic": "Bachelor of Special Needs Education (Generalist) - First and Second Year Course Offerings",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), College of Education, offers the Bachelor of Special Needs Education (Generalist). The curriculum for the First and Second Years is structured as follows:\n\n**First Year - First Semester (Total: 26 Units)**\nThe courses required are:\n1. GEELECIT: Living in Information Technology Era (3 units).\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 units).\n3. GEPEMOVE: Movement Enhancement (2 units).\n4. GEPURPCO: Purposive Communication (3 units).\n5. GEREADPH: Readings in Philippine History (3 units).\n6. GEUNDETS: Understanding the Self (3 units).\n7. NSTPLTS1: NSTP Literacy Training Service 1 (3 units).\n8. NSTPROG1: National Service Training Program 1 (3 units).\n9. PEDCALLP: The Child and Adolescent Learners and Learning Principles (3 units).\n\n**First Year - Second Semester (Total: 26 Units)**\nThe courses required are:\n1. FOSPINED: Foundations of Special Education (3 units).\n2. GEARTAPP: Art Appreciation (3 units).\n3. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 units). Prerequisite: GEKOMFIL.\n4. GELIFEWR: The Life and Works of Rizal (3 units).\n5. GEMATHMW: Mathematics in the Modern World (3 units).\n6. GEPEFITE: Fitness Exercises (2 units).\n7. GESCIETS: Science, Technology and Society (3 units).\n8. NSTPLTS2: NSTP Literacy Training Service 2 (3 units). Prerequisite: NSTPLTS1.\n9. NSTPROG2: National Service Training Program 2 (3 units).\n\n**Second Year - First Semester (Total: 26 Units)**\nThe courses required are:\n1. GEADDPDS: Practical Data Science (3 units).\n2. GEETHICS: Ethics (3 units).\n3. GEPANIPI: Panitikan sa Pilipinas / Philippine Literature (3 units). Prerequisite: GEFILDIS.\n4. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 units).\n5. PEDTSCUR: The Teacher and The School Curriculum (3 units).\n6. PEDTTPRO: The Teaching Profession (3 units).\n7. SNEDLSPD: Learners with Sensory and Physical Disabilities (3 units).\n8. SNEDLWDD: Learners with Developmental Disabilities (3 units).\n9. SNLEBLCD: Learners with Emotional, Behavioral, Language and Communication Disabilities (3 units).\n\n**Second Year - Second Semester (Total: 26 Units)**\nThe courses required are:\n1. GEADCPBR: Communicative Proficiency in Business Correspondence and Research Writing (3 units).\n2. GECONTWO: The Contemporary World (3 units).\n3. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 units).\n4. PEDFALCT: Facilitating Learner-Centered Teaching (3 units).\n5. PEDTCSOL: The Teacher and the Community, School Culture, and Organizational Leadership (3 units).\n6. PEDTFTAL: Technology for Teaching and Learning 1 (3 units).\n7. SNEDCPIE: Curriculum and Pedagogy in Inclusive Education (3 units). Prerequisite: FOSPINED.\n8. SNEDEASA: Educational Assessment of Students with Additional Needs (3 units). Prerequisite: FOSPINED.\n9. SNEDGTLS: Gifted and Talented Learners (3 units).",
    "keywords": [
      "BSNED",
      "Special Needs Education",
      "Generalist",
      "Curriculum",
      "First Year",
      "Second Year",
      "NSTP",
      "General Education",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_bsned_curriculum_years_3_4",
    "source": "EARIST BSNED Curriculum File",
    "category": "College of Education Curriculum",
    "topic": "Bachelor of Special Needs Education (Generalist) - Third and Fourth Year Course Offerings",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), College of Education, outlines the advanced curriculum for the Bachelor of Special Needs Education (Generalist) for the Third and Fourth Years as follows:\n\n**Third Year - First Semester (Total: 21 Units)**\nThe courses required are:\n1. PEDASOL1: Assessment of Learning 1 (3 units).\n2. PEDBELAC: Building and Enhancing New Literacies Across the Curriculum (3 units).\n3. SNAPERMH: Adapted Physical Education and Recreation, Music, and Health (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n4. SNEDEMAM: Behavior Management and Modification (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n5. SNEDTRED: Transition Education (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n6. SNINALLI: Instructional Adaptations in Language and Literacy Instruction (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n7. SNINAMSI: Instructional Adaptations in Mathematics and Science Instruction (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n\n**Third Year - Second Semester (Total: 15 Units)**\nThe courses required are:\n1. PEDASOL2: Assessment of Learning 2 (3 units). Prerequisite: PEDASOL1.\n2. SNEDDIEP: Development of Individualized Education Plans (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n3. SNEDECIE: Early Childhood Inclusive Education (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n4. SNINATCA: Instructional Adaptations for Teaching the Content Areas (Social Sciences, Humanities) (3 units). Prerequisites: SNEDCPIE and SNEDEASA.\n5. SNRESNIE: Research in Special Needs and Inclusive Education (3 units). Prerequisite: SNEDTRED.\n\n**Fourth Year - First Semester**\nThe curriculum lists the following major courses:\n1. PEDCOPRO: Competencies Enhancement Program (3 units). This course has an extensive list of prerequisites covering nearly the entire program, including: SNRESNIE, PEDASOL2, GEPEHEF2, GEADCPBR, GECONTWO, GEPEHEF1, GEPANIPI, GEADDPDS, GEETHICS, GEPEFITE, GEFILDIS, GEARTAPP, GELIFEWR, GESCIETS, GEMATHMW, GEPEMOVE, GEKOMFIL, GEELECIT, GEUNDETS, GEREADPH, GEPURPCO, PEDTSCUR, PEDTTPRO, FOSPINED, PEDCALLP, SNEDLWDD, SNEDLSPD, SNLEBLCD, PEDFALCT, PEDTCSOL, PEDTFTAL, and SNEDGTLS.\n2. PEDFSTDY1: Field Study 1 (3 units). Prerequisite: PEDFSTDY1 requires completion of prerequisite major subjects.",
    "keywords": [
      "BSNED",
      "Special Needs Education",
      "Third Year",
      "Fourth Year",
      "Field Study",
      "Competencies Enhancement Program",
      "Prerequisites",
      "Research",
      "Inclusive Education"
    ]
  },
  {
    "id": "earist_bsoa_curriculum_years_1_2",
    "source": "EARIST BSOA Curriculum File",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "Bachelor of Science in Office Administration - First and Second Year Course Offerings",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), College of Business and Public Administration, outlines the curriculum for the Bachelor of Science in Office Administration (BSOA). The course offerings for the First and Second Years are structured as follows:\n\n**First Year - First Semester (Total: 22 Units)**\nThe required courses are:\n1. ADOPMNGT: Administrative Office Procedure and Management (3 units).\n2. ADWOVAAC: Administrative Work Values and Accountability (3 units).\n3. FNDSTENO: Foundation of Shorthand (5 units).\n4. GEPEMOVE: Movement Enhancement (2 units).\n5. GEUNDETS: Understanding the Self (3 units).\n6. KEYDOCPR: Keyboarding and Documents Processing 1 (3 units).\n7. NSTPROG1: National Service Training Program 1 (3 units).\n\n**First Year - Second Semester (Total: 23 Units)**\nThe required courses are:\n1. ADVSTENO: Advanced Shorthand (3 units). Prerequisite: Foundation of Shorthand (listed as ENDSTENO).\n2. GECONTWO: The Contemporary World (3 units).\n3. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 units).\n4. GEMATHMW: Mathematics in the Modern World (3 units).\n5. GEPEFITE: Fitness Exercises (2 units). Prerequisite: GEPEMOVE (Movement Enhancement).\n6. GEREADPH: Readings in Philippine History (3 units).\n7. KEYDOCPR2: Keyboarding and Documents Processing 2 (3 units). Prerequisite: KEYDOCPR (Keyboarding and Documents Processing 1).\n8. NSTP-CWTS_2: NSTP Civic Welfare Training Service 2 (3 units). Prerequisite: NSTPROG1 (National Service Training Program 1).\n\n**Second Year - First Semester (Total: 17 Units)**\nThe required courses are:\n1. GEARTAPP: Art Appreciation (3 units).\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 units).\n3. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 units). Prerequisite: GEPEMOVE (Movement Enhancement).\n4. GEPURPCO: Purposive Communication (3 units).\n5. PRPROFDV: Personal and Professional Development (3 units). Prerequisite: ADOPMNGT (Administrative Office Procedure and Management).\n6. SPDTRANS: Speed Transcription (3 units). Prerequisite: ADVSTENO (Advanced Shorthand).\n\n**Second Year - Second Semester (Total: 17 Units)**\nThe required courses are:\n1. ACCOUNT2: Accounting for Merchandising Industry (3 units).\n2. BUSREPWR: Business Report Writing (3 units).\n3. GEETHICS: Ethics (3 units).\n4. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 units).\n5. GESCIENTS: Science and Technology (3 units).\n6. OAINTERN: Office Administration Internship (3 units / 300 Hours). Prerequisite: ADOPMNGT (Administrative Office Procedure and Management).",
    "keywords": [
      "BSOA",
      "Office Administration",
      "Shorthand",
      "Keyboarding",
      "Internship",
      "First Year",
      "Second Year",
      "Curriculum",
      "EARIST College of Business and Public Administration"
    ]
  },
  {
    "id": "earist_bsoa_curriculum_years_3_4",
    "source": "EARIST BSOA Curriculum File",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "Bachelor of Science in Office Administration - Third and Fourth Year Course Offerings",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), College of Business and Public Administration, details the advanced curriculum for the Bachelor of Science in Office Administration (BSOA) for the Third and Fourth Years. The total number of units for the entire program is 130.\n\n**Third Year - First Semester (Total: 15 Units)**\nThe required courses are:\n1. GELIFEWR: The Life and Works of Rizal (3 units).\n2. INTSOFAP: Integrated Software Applications (3 units).\n3. MACSHAN1: Fundamentals of Machine Shorthand 1 (3 units). Prerequisite: SPDTRANS (Speed Transcription).\n4. OABUSRS1: Internet Research for Business (BR1) (3 units). Prerequisite: ADOPMNGT (Administrative Office Procedure and Management).\n5. OPTNMNGT: Operations Management (TQM) (3 units).\n\n**Third Year - Second Semester (Total: 15 Units)**\nThe required courses are:\n1. ENBEHAVE: Entrepreneurial Behavior (3 units).\n2. EVNTMNGT: Events Management (3 units).\n3. GEPHILIT: Philippine Literature (3 units).\n4. MACSHAN2: Machine Shorthand 2 (3 units). Prerequisite: MACSHAN1 (Fundamentals of Machine Shorthand 1).\n5. OABUSRS2: Basic Research/Thesis Writing (BR2) (3 units). Prerequisite: OABUSRS1 (Internet Research for Business).\n\n**Fourth Year - First Semester (Total: 15 Units)**\nThe required courses are:\n1. BUSLWOBL: Business Law (Obligations & Contract) (3 units).\n2. CUSTRELA: Customer Relations (3 units).\n3. INCMTAXN: Income Taxation (3 units).\n4. PROJMNGT: Project Management (3 units).\n5. STRAMNGT: Strategic Management (3 units).\n\n**Fourth Year - Second Semester (Total: 6 Units)**\nThe required course is:\n1. OAPRACTI: Legal/Medical Office Procedure (6 units). This course serves as a practicum. Prerequisite: OABUSRS2 (Basic Research/Thesis Writing).",
    "keywords": [
      "BSOA",
      "Office Administration",
      "Third Year",
      "Fourth Year",
      "Machine Shorthand",
      "Thesis Writing",
      "Business Law",
      "Project Management",
      "Practicum"
    ]
  },
  {
    "id": "earist_cas_bs_psychology_curriculum_year_1",
    "source": "BSPSYCHOLOGY.pdf",
    "category": "College of Arts and Sciences - Program Offerings",
    "topic": "Bachelor of Science in Psychology First Year Curriculum",
    "content": "The Bachelor of Science in Psychology program under the College of Arts and Sciences at the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) mandates a specific curriculum for the First Year. \n\nDuring the First Semester, students are required to take the following courses totaling 25 credited units: Biological Science Laboratory (BIOSCLAB, 1 unit) and Lecture (BIOSCLEC, 4 units); Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL, 3 units); Movement Enhancement (GEPEMOVE, 2 units); Purposive Communication (GEPURPCO, 3 units); Readings in Philippine History (GEREADPH, 3 units); Understanding the Self (GEUNDETS, 3 units); Introduction to Psychology (INTROPSY, 3 units); and National Service Training Program 1 (NSTPROG1, 3 units). None of these courses have prerequisites.\n\nDuring the Second Semester, the curriculum requires 36 credited units consisting of: Anatomy and Physiology Laboratory (ANAPYLAB, 1 unit) and Lecture (ANAPYLEC, 4 units); Art Appreciation (GEARTAPP, 3 units); Mathematics in the Modern World (GEMATHMW, 3 units); Panitikan sa Pilipinas (GEPANIPI, 3 units); Fitness Exercises (GEPEFITE, 2 units); Science, Technology and Society (GESCIETS, 3 units); and Psychological Statistics (PSYCSTAT, 5 units). Additionally, students must complete the second component of the National Service Training Program (NSTPROG2, 3 units), choosing from Civic Welfare Training Service 2 (NSTP-CWTS_2), Literacy Training Service 2 (NSTP-LTS 2), or Military Training Service 2 (NSTP-MTS_2). No prerequisites are listed for these first-year courses.",
    "keywords": [
      "BS Psychology",
      "First Year Curriculum",
      "Biological Science",
      "Introduction to Psychology",
      "Psychological Statistics",
      "Anatomy and Physiology",
      "NSTP",
      "EARIST College of Arts and Sciences"
    ]
  },
  {
    "id": "earist_cas_bs_psychology_curriculum_year_2",
    "source": "BSPSYCHOLOGY.pdf",
    "category": "College of Arts and Sciences - Program Offerings",
    "topic": "Bachelor of Science in Psychology Second Year Curriculum",
    "content": "The Bachelor of Science in Psychology program under the College of Arts and Sciences at EARIST outlines the following course requirements for the Second Year level.\n\nThe First Semester consists of 20 credited units comprising: Biochemistry Laboratory (BIOCHLAB, 1 unit) and Lecture (BIOCHLEC, 4 units); Developmental Psychology (DEVPSYCH, 3 units); Practical Data Science (GEELECDS, 3 units); Living in Information Technology Era (GEELECIT, 3 units); Physical Activity Towards Health and Fitness 1 (GEPEHEF1, 2 units); Sinesosyedad/Pelikulang Panlipunan (GESINEPP, 3 units); and Physiological Psychology (PHYPSYCH, 1 unit). While specific prerequisites are listed as 'None' in the summary table, these courses build upon first-year foundational sciences.\n\nThe Second Semester curriculum comprises 21 credited units. The required courses are: Experimental Psychology Laboratory (EXPSYLAB, 2 units) and Lecture (EXPSYLEC, 3 units); The Contemporary World (GECONTWO, 3 units); Communicative Proficiency in Business Correspondence and Research Writing (GEELECCP, 3 units); Physical Activity Towards Health and Fitness II (GEPEHEF2, 2 units); Physics for Psychology Students Laboratory (PHYPSYLB, 1 unit) and Lecture (PHYPSYLC, 4 units); and Theories of Personality (THEOPERS, 3 units). This year focuses heavily on the scientific and experimental foundations of the discipline.",
    "keywords": [
      "BS Psychology",
      "Second Year Curriculum",
      "Biochemistry",
      "Developmental Psychology",
      "Experimental Psychology",
      "Physics for Psychology",
      "Theories of Personality",
      "Data Science"
    ]
  },
  {
    "id": "earist_cas_bs_psychology_curriculum_year_3",
    "source": "BSPSYCHOLOGY.pdf",
    "category": "College of Arts and Sciences - Program Offerings",
    "topic": "Bachelor of Science in Psychology Third Year Curriculum",
    "content": "The Bachelor of Science in Psychology program under the College of Arts and Sciences at EARIST defines the Third Year curriculum as the period where major professional psychology courses are concentrated.\n\nThe First Semester requires a total of 20 credited units including: Abnormal Psychology (ABNPSYCH, 3 units); Cognitive Psychology (COGPSYCH, 3 units); Field Methods Laboratory (FLDMETLB, 2 units) and Lecture (FLDMETLC, 3 units); Ethics (GEETHICS, 3 units); Industrial Organizational Psychology (INDPSYCH, 3 units which includes 2 lecture and 1 lab unit); and Social Psychology (SOCPSYCH, 3 units).\n\nThe Second Semester curriculum expands to 23 credited units and includes: The Life and Works of Rizal (GELIFEWR, 3 units); Human Behavior in Organizations (HUMBEORG, 3 units); Labor Laws and Labor Relations (LABORLAW, 3 units); Disaster and Mental Health (MNTLHLTH, 3 units); Psychological Assessment Laboratory (PSYASSLB, 2 units) and Lecture (PSYASSLC, 3 units); Research in Psychology I (PSYTHES1, 3 units); and Sikolohiyang Pilipino (SIKOLPIL, 3 units). This year introduces critical research and assessment methodologies required for the final year.",
    "keywords": [
      "BS Psychology",
      "Third Year Curriculum",
      "Abnormal Psychology",
      "Cognitive Psychology",
      "Industrial Organizational Psychology",
      "Psychological Assessment",
      "Research in Psychology",
      "Sikolohiyang Pilipino",
      "Mental Health"
    ]
  },
  {
    "id": "earist_cas_bs_psychology_curriculum_year_4_summary",
    "source": "BSPSYCHOLOGY.pdf",
    "category": "College of Arts and Sciences - Program Offerings",
    "topic": "Bachelor of Science in Psychology Fourth Year Curriculum and Program Summary",
    "content": "The Bachelor of Science in Psychology program under the College of Arts and Sciences at EARIST concludes with the Fourth Year curriculum, which focuses on advanced applications, research completion, and professional review.\n\nThe First Semester of the Fourth Year requires 18 credited units consisting of: Panitikan sa Pilipinas / Philippine Literature (GEPANIPI, 3 units); an Open Elective (OPENELEC, 3 units); Organizational Development (ORGLDVMT, 3 units); Positive Psychology (POSPSYCH, 3 units); Research in Psychology II (PSYTHES2, 3 units), which serves as the continuation of the thesis project; and Strategic Human Resource Management (STRATHRM, 3 units).\n\nThe Second Semester is the final academic term and consists of 10 credited units dedicated to professional preparation: Integrative Course in Psychology / Review Class (ICOPSYCH, 4 units) and the Practicum/Internship (PSYCHOJT, 6 units). \n\nAccording to the document prepared by the Department Head and attested by the Dean, the Total Number of Units required to graduate from the BS Psychology program is 173. The curriculum effectivity date is listed as June 2018.",
    "keywords": [
      "BS Psychology",
      "Fourth Year Curriculum",
      "Practicum",
      "Internship",
      "Research in Psychology II",
      "Integrative Course",
      "Review Class",
      "Total Units 173",
      "HR Management",
      "Positive Psychology"
    ]
  },
  {
    "id": "earist_chtm_bstm_curriculum_year_1",
    "source": "BSTOURISM.pdf",
    "category": "College of Hospitality and Tourism Management - Program Offerings",
    "topic": "Bachelor of Science in Tourism Management First Year Curriculum",
    "content": "The Bachelor of Science in Tourism Management program under the College of Hospitality and Tourism Management at the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) outlines the following curriculum for the First Year.\n\nDuring the First Semester, students are required to take courses totaling 23 credited units. These include: Living in Information Technology Era (GEELECIT, 3 units, 2 lecture/1 lab); Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL, 3 units); Movement Enhancement (GEPEMOVE, 2 units); Understanding the Self (GEUNDETS, 3 units); National Service Training Program 1 (NSTPROG1, 3 units); Macro Perspective of Tourism and Hospitality (THCMACPR, 3 units); Risk Management as Applied to Safety, Security and Sanitation (THCRISKM, 3 units); and Sustainable Tourism (TPCSUSTO, 3 units). None of these courses have prerequisites.\n\nThe Second Semester curriculum requires a total of 26 credited units (though the source table summation indicates 38, likely due to row merging in the source text). The courses include: Mathematics in the Modern World (GEMATHMW, 3 units); Panitikan sa Pilipinas (GEPANIPI, 3 units); Fitness Exercises (GEPEFITE, 2 units); Science, Technology and Society (GESCIETS, 3 units); and National Service Training Program 2 (NSTPROG2, 3 units), where students may choose between Civic Welfare (CWTS), Literacy Training (LTS), or Military Training (MTS). Major courses for this semester are: Micro Perspective of Tourism and Hospitality (THCMICPR, 3 units, Prerequisite: THCMACPR); Quality Service Management in Tourism and Hospitality (THCQUASM, 3 units, Prerequisite: THCMACPR); Global Culture and Tourism Geography (TPCGLCTG, 3 units); and Recreational and Leisure Management (TPECRELM, 3 units).",
    "keywords": [
      "BS Tourism Management",
      "First Year Curriculum",
      "Macro Perspective of Tourism",
      "Risk Management",
      "Sustainable Tourism",
      "Micro Perspective of Tourism",
      "Quality Service Management",
      "EARIST CHTM"
    ]
  },
  {
    "id": "earist_chtm_bstm_curriculum_year_2",
    "source": "BSTOURISM.pdf",
    "category": "College of Hospitality and Tourism Management - Program Offerings",
    "topic": "Bachelor of Science in Tourism Management Second Year Curriculum",
    "content": "The Bachelor of Science in Tourism Management program under the College of Hospitality and Tourism Management at EARIST prescribes the following courses for the Second Year level.\n\nThe First Semester consists of 23 credited units. The required courses are: Physical Activity Towards Health and Fitness 1 (GEPEHEF1, 2 units); Purposive Communication (GEPURPCO, 3 units); Readings in Philippine History (GEREADPH, 3 units); and Philippine Culture and Tourism Geography (THCPHCTG, 3 units). Several major courses require prerequisites from the first year: Tour and Travel Management (TPCTTMGT, 3 units) requires THCMACPR and THCMICPR; Eco Tourism Management (TPECECTM, 3 units) requires TPCSUSTO; Specialized Food and Beverage Service Operations (TPECSFBS, 3 units) requires THCRISKM; and Tourism Information Management (TPECTINM, 3 units) requires THCMACPR and THCMICPR.\n\nThe Second Semester curriculum also consists of 23 credited units. The General Education courses are World Literature and Humanities (GEADWOLH, 3 units), The Contemporary World (GECONTWO, 3 units), and Physical Activity Towards Health and Fitness II (GEPEHEF2, 2 units). The professional courses include: Operations Management in Tourism and Hospitality (BMECOPMN, 3 units); Entrepreneurship in Tourism and Hospitality (THCENTRE, 3 units); Legal Aspects in Tourism and Hospitality (THCLEGAS, 3 units, Prerequisite: THCMACPR); Transportation Management (TPCTRANM, 3 units, Prerequisites: THCMACPR, THCMICPR, TPCTTMGT); and The Ethics of Tour Guiding and Escorting (TPECETGE, 3 units, Prerequisites: THCMACPR, THCMICPR, TPCSUSTO, TPCGLCTG, TPCTTMGT, TPECTINM).",
    "keywords": [
      "BS Tourism Management",
      "Second Year Curriculum",
      "Eco Tourism Management",
      "Tour and Travel Management",
      "Transportation Management",
      "Legal Aspects in Tourism",
      "Ethics of Tour Guiding",
      "Specialized Food and Beverage"
    ]
  },
  {
    "id": "earist_chtm_bstm_curriculum_year_3",
    "source": "BSTOURISM.pdf",
    "category": "College of Hospitality and Tourism Management - Program Offerings",
    "topic": "Bachelor of Science in Tourism Management Third Year Curriculum",
    "content": "The Bachelor of Science in Tourism Management program under the College of Hospitality and Tourism Management at EARIST defines the Third Year curriculum as a period for advanced specialization and research.\n\nThe First Semester requires 24 credited units. Courses include: Practical Data Science (GEELECDS, 3 units); Ethics (GEETHICS, 3 units); and Multicultural Diversity in Workplace for the Tourism Professional (THCMULDI, 3 units). Specialized courses with prerequisites are: Tourism and Hospitality Marketing (THCMARKT, 3 units, Prerequisites: THCMACPR, THCMICPR); Foreign Language 1 (THPCFLA1, 3 units); Introduction to Meetings Incentives, Conferences and Events Management (THPCMICE, 3 units, Prerequisites: THCQUASM, THCMICPR, BMECOPMN, THCLEGAS); Research in Tourism 1 (TPCREST1, 3 units, 2 lec/1 lab); and Tourism Policy Planning and Development (TPCTPPAD, 3 units, Prerequisites: TPCSUSTO, TPCTTMGT, TPECECTM, TPECTINM, THCLEGAS).\n\nThe Second Semester also requires 24 credited units. The curriculum includes: Art Appreciation (GEARTAPP, 3 units); Professional Development and Applied Ethics (THCPDAET, 3 units); Applied Business Tools and Technologies (THPCABTT, 3 units); and Foreign Language 2 (THPCFLA2, 3 units, Prerequisite: THPCFLA1). Advanced major courses are: Research in Tourism 2 (TPCREST2, 3 units, Prerequisite: TPCREST1); Cruise Tourism (TPECCRTO, 3 units, Prerequisites: THCMACPR, THCMICPR); Destination Management and Marketing (TPECDESM, 3 units, Prerequisites: THCMARKT, TPCTTMGT, TPECTINM); and Tourism Product Development (TPECTPRD, 3 units, Prerequisite: TPCTPPAD).",
    "keywords": [
      "BS Tourism Management",
      "Third Year Curriculum",
      "MICE Management",
      "Research in Tourism",
      "Tourism Policy Planning",
      "Foreign Language",
      "Cruise Tourism",
      "Destination Management"
    ]
  },
  {
    "id": "earist_chtm_bstm_curriculum_year_4",
    "source": "BSTOURISM.pdf",
    "category": "College of Hospitality and Tourism Management - Program Offerings",
    "topic": "Bachelor of Science in Tourism Management Fourth Year Curriculum",
    "content": "The Bachelor of Science in Tourism Management program at EARIST concludes with the Fourth Year curriculum, focusing on strategic management and practical application through internship.\n\nThe First Semester consists of 15 credited units. The courses are: Strategic Management and Total Quality Management (BMECSTQM, 3 units); The Life and Works of Rizal (GELIFEWR, 3 units); Accommodation Operations and Management (TPECOROM/TPECACOM, 3 units, Prerequisites: THCMACPR, THCMICPR); Philippine Gastronomical Tourism (TPECPHGT, 3 units, Prerequisites: THCMICPR, THCMACPR); and Travel Writing and Photography (TPECTWAP, 3 units, Prerequisites: THCMACPR, THCMICPR).\n\nThe Second Semester is dedicated entirely to the Tourism Practicum (TPCTORPR), which is valued at 6 credited units and requires 600 hours of duty in Transportation, Tourism Offices, Travel Agencies, or Airports. This course has an extensive list of prerequisites that effectively includes all major subjects from the previous years: THCMACPR, TPCSUSTO, THCRISKM, TPCGLCTG, TPECRELM, THCQUASM, THCMICPR, TPCTTMGT, THCPHCTG, TPECECTM, TPECSFBS, TPECTINM, TPCTRANM, THCLEGAS, THCENTRE, TPECETGE, TPCTPPAD, THCMULDI, THPCMICE, and Foreign Language 1.",
    "keywords": [
      "BS Tourism Management",
      "Fourth Year Curriculum",
      "Tourism Practicum",
      "Strategic Management",
      "Accommodation Operations",
      "Philippine Gastronomical Tourism",
      "Travel Writing",
      "Internship 600 Hours"
    ]
  },
  {
    "id": "earist_coed_btled_he_curriculum_year_1",
    "source": "BTLED-HE.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Home Economics) First Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Home Economics) program under the College of Education at the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) outlines the following curriculum for the First Year.\n\nDuring the First Semester, students are required to take courses totaling 32 credited units. The General Education and minor subjects include: Art Appreciation (GEARTAPP, 3 units); Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL, 3 units); The Life and Works of Rizal (GELIFEWR, 3 units); Mathematics in the Modern World (GEMATHMW, 3 units); Movement Enhancement (GEPEMOVE, 2 units); Science, Technology and Society (GESCIETS, 3 units); NSTP Literacy Training Service 1 (NSTPLTS1, 3 units); and National Service Training Program 1 (NSTPROG1, 3 units). The major introductory courses are Home Economics Literacy (TLEEXHEL, 3 units); Introduction to Information and Communications Technology I (TLEEXITY, 3 units); and Consumer Education (TLEHECED, 3 units). None of these first-semester courses have prerequisites.\n\nThe Second Semester curriculum also consists of 32 credited units. The required courses are: Living in Information Technology Era (GEELECIT, 3 units, 2 lecture/1 lab); Filipino sa Iba't ibang Disiplina (GEFILDIS, 3 units); Fitness Exercises (GEPEFITE, 2 units); Purposive Communication (GEPURPCO, 3 units); Readings in Philippine History (GEREADPH, 3 units); and Understanding the Self (GEUNDETS, 3 units). The National Service Training Program continues with NSTP Literacy Training Service 2 (NSTPLTS2, 3 units, Prerequisite: NSTPLTS1) and National Service Training Program 2 (NSTPROG2, 3 units). The major courses for this semester include: Entrepreneurship (TLEEXENT, 3 units, Prerequisite: TLEEXHEL); Family and Consumer Life Skills (TLEEXFCL, 3 units, Prerequisite: TLEHECED); and Introduction to Information and Communications Technology II (TLEEXIT2, 3 units, Prerequisite: TLEEXIT1/TLEEXITY).",
    "keywords": [
      "BTLED Home Economics",
      "First Year Curriculum",
      "Home Economics Literacy",
      "Consumer Education",
      "ICT",
      "NSTP",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_coed_btled_he_curriculum_year_2",
    "source": "BTLED-HE.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Home Economics) Second Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Home Economics) program under the College of Education at EARIST prescribes the following courses for the Second Year level.\n\nThe First Semester consists of 29 credited units. The curriculum includes: Communicative Proficiency in Business Correspondence and Research Writing (GEADCPBR, 3 units); The Contemporary World (GECONTWO, 3 units); Panitikan sa Pilipinas (GEPANIPI, 3 units); and Physical Activity Towards Health and Fitness 1 (GEPEHEF1, 2 units). Professional Education courses introduced in this term are The Child and Adolescent Learners and Learning Principles (PEDCALLP, 3 units) and The Teaching Profession (PEDTTPRO, 3 units). The major TLE courses are: Introduction to Agri-Fishery Arts 1 (TLEEXAF1, 3 units); Introduction to Industrial Arts I (TLEEXIA1, 3 units); Household Resource Management (TLEHEHRM, 3 units, 1 lecture/2 lab); and Principles of Food Preparation (TLEHEPFP, 3 units, 1 lecture/2 lab). No specific prerequisites are listed for this semester's courses in the provided table.\n\nThe Second Semester curriculum comprises 29 credited units. General Education requirements include Practical Data Science (GEADDPDS, 3 units), Ethics (GEETHICS, 3 units), and Physical Activity Towards Health and Fitness II (GEPEHEF2, 2 units). Professional Education courses include The Teacher and the Community, School Culture, and Organizational Leadership (PEDTCSPT, 3 units) and Technology for Teaching and Learning 1 (PEDTFTAL, 3 units). The specialized TLE courses with prerequisites are: Introduction to Agri-Fishery Arts II (TLEEXAF2, 3 units, Prerequisite: TLEEXAF1); Introduction to Industrial Arts II (TLEEXIA2, 3 units, Prerequisite: TLEEXIA1); Bread and Pastry Arts (TLEHEBPA, 3 units, Prerequisite: TLEHEPFP); Food and Nutrition (TLEHEFAN, 3 units, Prerequisite: TLEHEPFP); and School Food Service Management (TLEHESFM, 3 units, Prerequisite: TLEHEHRM), which notably includes a 150-hour Practicum Component.",
    "keywords": [
      "BTLED Home Economics",
      "Second Year Curriculum",
      "Agri-Fishery Arts",
      "Industrial Arts",
      "Bread and Pastry Arts",
      "School Food Service Management",
      "Food and Nutrition",
      "Professional Education"
    ]
  },
  {
    "id": "earist_coed_btled_he_curriculum_year_3",
    "source": "BTLED-HE.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Home Economics) Third Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Home Economics) program at EARIST outlines the Third Year curriculum, focusing heavily on pedagogy and specialized home economics skills.\n\nThe First Semester requires 27 credited units. Professional Education courses include: Assessment of Learning 1 (PEDASLT1, 3 units); Facilitating Learner-Centered Teaching Approaches w/ Emphasis on Trainers Methodology I (PEDFLTM1, 3 units); Foundation of Special and Inclusive Education (PEDFOSIE, 3 units); and Technology for Teaching & Learning 2 (TLEEXTTL, 3 units, Prerequisite: PEDTFTAL). The research component begins with Research I: Research In Home Economics 1 (RESINHE1, 3 units). Major courses include: Arts in Daily Living (TLEHEADL, 3 units); Child and Adolescent Development (TLEHECAD, 3 units); Clothing Selection, Purchase & Care (TLEHECSP, 3 units); and Fundamentals of Food Technology (TLEHEFFT, 3 units).\n\nThe Second Semester consists of 24 credited units. The Professional Education component covers Assessment of Learning 2 w/ Focus on Trainer's Methodology I & II (PEDAL2TM, 3 units, Prerequisite: PEDASOL1/PEDASLT1); Building and Enhancing New Literacies Across the Curriculum (PEDBELAC, 3 units); and Curriculum Development and Evaluation w/ Emphasis on Trainers Methodology II (PEDCDTM2, 3 units). The research track continues with Research II: Research in Home Economics II (RESINHE2, 3 units, Prerequisite: RESINHE1). Specialized skills courses include Beauty Care with Health & Wellness (TLEHEBCH, 3 units); Clothing Construction (TLEHECCD, 3 units, Prerequisite: TLEHECSP); Crafts Design (TLEHECDH, 3 units); and Marriage and Family Relationships (TLEHEMFR, 3 units).",
    "keywords": [
      "BTLED Home Economics",
      "Third Year Curriculum",
      "Trainers Methodology",
      "Assessment of Learning",
      "Research in Home Economics",
      "Clothing Construction",
      "Beauty Care",
      "Special Education"
    ]
  },
  {
    "id": "earist_coed_btled_he_curriculum_year_4",
    "source": "BTLED-HE.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Home Economics) Fourth Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Home Economics) program at EARIST culminates in the Fourth Year with a focus on field study and competency enhancement.\n\nThe First Semester lists two primary courses totaling 6 credited units. The first is Competencies Enhancement Program (PEDCOPRO, 3 units), which has no prerequisites. The second is Field Study 1 (PEDFSTDY1, 3 units). \n\nField Study 1 (PEDFSTDY1) serves as a capstone requirement and has an extensive list of prerequisites encompassing nearly the entire program curriculum. Students must have completed: Assessment of Learning 2 (PEDAL2TM); Assessment of Learning 1 (PEDASOL1); Building and Enhancing New Literacies (PEDBELAC); Child and Adolescent Learners (PEDCALLP); Curriculum Development (PEDCDTM2); Facilitating Learner-Centered Teaching (PEDFLTM1); Special and Inclusive Education (PEDFOSIE); Teacher and the Community (PEDTCSPT); Technology for Teaching 1 (PEDTFTAL); The Teaching Profession (PEDTTPRO); Introduction to Agri-Fishery Arts 1 & 2 (TLEEXAF1, TLEEXAF2); Entrepreneurship (TLEEXENT); Family and Consumer Life Skills (TLEEXFCL); Home Economics Literacy (TLEEXHEL); Introduction to Industrial Arts 1 & 2 (TLEEXIA1, TLEEXIA2); ICT 1 & 2 (TLEEXIT1, TLEEXIT2); Technology for Teaching 2 (TLEEXTTL); Arts in Daily Living (TLEHEADL); Bread and Pastry Arts (TLEHEBPA); Beauty Care (TLEHEBCH); Child and Adolescent Development (TLEHECAD); Clothing Construction (TLEHECCD); Crafts Design (TLEHECDH); Consumer Education (TLEHECED); and Clothing Selection (TLEHECSP).",
    "keywords": [
      "BTLED Home Economics",
      "Fourth Year Curriculum",
      "Field Study 1",
      "Competencies Enhancement Program",
      "Capstone",
      "Prerequisites",
      "Teaching Internship Preparation"
    ]
  },
  {
    "id": "earist_coed_btled_ia_curriculum_year_1",
    "source": "BTLED-IA.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Industrial Arts) First Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Industrial Arts) program under the College of Education at the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) outlines the curriculum for the First Year.\n\nThe First Semester requires a total of 32 credited units. The courses include: Art Appreciation (GEARTAPP, 3 units); Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL, 3 units); The Life and Works of Rizal (GELIFEWR, 3 units); Mathematics in the Modern World (GEMATHMW, 3 units); Movement Enhancement (GEPEMOVE, 2 units); Science, Technology and Society (GESCIETS, 3 units); NSTP Literacy Training Service 1 (NSTPLTS1, 3 units); National Service Training Program 1 (NSTPROG1, 3 units); Home Economics Literacy (TLEEXHEL, 3 units); Introduction to Information and Communications Technology I (TLEEXITI, 3 units); and Graphic Arts (TLEIAGHA, 3 units). All courses in this semester have no prerequisites.\n\nThe Second Semester curriculum consists of 35 credited units. The required courses are: Living in Information Technology Era (GEELECIT, 3 units, 2 lec/1 lab); Filipino sa Iba't ibang Disiplina (GEFILDIS, 3 units); Fitness Exercises (GEPEFITE, 2 units); Purposive Communication (GEPURPCO, 3 units); Readings in Philippine History (GEREADPH, 3 units); Understanding the Self (GEUNDETS, 3 units); NSTP Literacy Training Service 2 (NSTPLTS2, 3 units); National Service Training Program 2 (NSTPROG2, 3 units); Entrepreneurship (TLEEXENT, 3 units); Family and Consumer Life Skills (TLEEXFCL, 3 units); and Introduction to Information and Communications Technology II (TLEEXIT2, 3 units).",
    "keywords": [
      "BTLED Industrial Arts",
      "First Year Curriculum",
      "Industrial Arts",
      "Graphic Arts",
      "ICT",
      "Home Economics Literacy",
      "NSTP",
      "EARIST College of Education"
    ]
  },
  {
    "id": "earist_coed_btled_ia_curriculum_year_2",
    "source": "BTLED-IA.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Industrial Arts) Second Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Industrial Arts) program at EARIST prescribes the following courses for the Second Year level.\n\nThe First Semester consists of 29 credited units. The General Education and Professional Education courses are: Communicative Proficiency in Business Correspondence and Research Writing (GEADCPBR, 3 units); The Contemporary World (GECONTWO, 3 units); Panitikan sa Pilipinas (GEPANIPI, 3 units); Physical Activity Towards Health and Fitness 1 (GEPEHEF1, 2 units); The Child and Adolescent Learners and Learning Principles (PEDCALLP, 3 units); and The Teaching Profession (PEDTTPRO, 3 units). The major Industrial Arts courses are: Introduction to Agri-Fishery Arts 1 (TLEEXAF1, 3 units); Introduction to Industrial Arts I (TLEEXIA1, 3 units); Civil Technology I (TLEIACT1, 3 units, 1 lec/2 lab); and Fundamentals of Automotive Technology (TLEIAFAT, 3 units, 1 lec/2 lab).\n\nThe Second Semester curriculum comprises 26 credited units. The courses include: Practical Data Science (GEADDPDS, 3 units); Ethics (GEETHICS, 3 units); Physical Activity Towards Health and Fitness II (GEPEHEF2, 2 units); The Teacher and the Community, School Culture, and Organizational Leadership w/ Focus on the Philippine TVET System (PEDTCSPT, 3 units); Technology for Teaching and Learning 1 (PEDTFTAL, 3 units); Introduction to Agri-Fishery Arts II (TLEEXAF2, 3 units); Introduction to Industrial Arts II (TLEEXIA2, 3 units); Applied Automotive Technology (TLEIAAAT, 3 units, 1 lec/2 lab); and Civil Technology II (TLEIACT2, 3 units, 1 lec/2 lab).",
    "keywords": [
      "BTLED Industrial Arts",
      "Second Year Curriculum",
      "Automotive Technology",
      "Civil Technology",
      "Agri-Fishery Arts",
      "Industrial Arts",
      "Teaching Profession"
    ]
  },
  {
    "id": "earist_coed_btled_ia_curriculum_year_3",
    "source": "BTLED-IA.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Industrial Arts) Third Year Curriculum",
    "content": "The Bachelor of Technology and Livelihood Education (Industrial Arts) program at EARIST outlines the Third Year curriculum, emphasizing advanced technical skills and pedagogy.\n\nThe First Semester requires a total of 27 credited units. Professional Education courses include: Assessment of Learning 1 (PEDASLT1, 3 units); Facilitating Learner-Centered Teaching Approaches w/ Emphasis on Trainers Methodology I (PEDFLTM1, 3 units); Foundation of Special and Inclusive Education (PEDFOSIE, 3 units); and Technology for Teaching & Learning 2 (TLEEXTTL, 3 units). The research component is Research I: Research In Industrial Arts 1 (RESINIA1, 3 units). Specialized technical courses are: Domestic Refrigeration and Air-Conditioning (TLEIADRA, 3 units, 1 lec/2 lab); Fundamentals of Electronics Technology (TLEIAFEE, 3 units, 1 lec/2 lab); Fundamentals of Electrical Technology (TLEIAFET, 3 units, 1 lec/2 lab); and Metal Works (TLEIAMWS, 3 units, 1 lec/2 lab).\n\nThe Second Semester consists of 24 credited units. Courses include: Assessment of Learning 2 w/ Focus on Trainer's Methodology I & II (PEDAL2TM, 3 units); Building and Enhancing New Literacies Across the Curriculum (PEDBELAC, 3 units); Curriculum Development and Evaluation w/ Emphasis on Trainers Methodology II (PEDCDTM2, 3 units); Research II: Research in Industrial Arts II (RESINIA2, 3 units); Applied Electrical Technology (TLEIAAET, 3 units, 1 lec/2 lab); Crafts Design / Handicraft (TLEIACDH, 3 units, 1 lec/2 lab); Commercial Refrigeration and Air-Conditioning (TLEIACRA, 3 units, 1 lec/2 lab); and Digital Electronics Technology (TLEIADET, 3 units, 1 lec/2 lab).",
    "keywords": [
      "BTLED Industrial Arts",
      "Third Year Curriculum",
      "Electronics Technology",
      "Electrical Technology",
      "Refrigeration and Air-Conditioning",
      "Metal Works",
      "Trainers Methodology"
    ]
  },
  {
    "id": "earist_coed_btled_ia_curriculum_year_4_summary",
    "source": "BTLED-IA.pdf",
    "category": "College of Education - Program Offerings",
    "topic": "Bachelor of Technology and Livelihood Education (Industrial Arts) Fourth Year Curriculum and Program Summary",
    "content": "The Bachelor of Technology and Livelihood Education (Industrial Arts) program at EARIST concludes with the Fourth Year curriculum, which focuses on field study and internship.\n\nThe First Semester requires 9 credited units, consisting of the Competencies Enhancement Program (PEDCOPRO, 3 units), Field Study 1 (PEDFSTDY1, 3 units), and Field Study 2 (PEDFSTDY2, 3 units). \n\nThe Second Semester consists solely of the Teaching Internship (PEDNTERN), which is valued at 6 credited units.\n\nThe document indicates a Total Number of Units of 188 for the entire program, with an effectivity date of June 2018. It is prepared by the Head and attested by the Dean of the College of Education.",
    "keywords": [
      "BTLED Industrial Arts",
      "Fourth Year Curriculum",
      "Teaching Internship",
      "Field Study",
      "Competencies Enhancement",
      "Total Units 188"
    ]
  },
  {
    "id": "earist_cafa_bs_interior_design_complete_curriculum",
    "source": "BSID.pdf - Effective June 2018",
    "category": "Academic Programs - College of Architecture and Fine Arts",
    "topic": "Bachelor of Science in Interior Design (BSID) Complete Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Architecture and Fine Arts, offers the Bachelor of Science in Interior Design. The program has a total of 186 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n3. GEPURPCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDES111: Interior Design 1A (1 Lec, 3 Lab, 4 Units). Prerequisite: None.\n6. INDESIDD: Interior Design Drafting (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n7. INDESTID: Theory of Interior Design (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. INDESVST: Visual Techniques (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n9. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDES121: Interior Design 1B (1 Lec, 3 Lab, 4 Units). Prerequisite: None.\n6. INDESCTH: Color Studies 1 (Color Theory) (1 Lec, 2 Lab, 4 Units). Prerequisite: None.\n7. INDESHPA: History of Philippine Art (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. INDESPER: Perspective (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n9. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, First Semester:\n1. 2DDRAWNG: 2-Dimensional Drawing (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n2. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESINEPP: Sinesosyedad/Pelikulang Panlipunan (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDES211: Interior Design 2A (1 Lec, 3 Lab, 4 Units). Prerequisite: None.\n7. INDESCRD: Color Studies II (Color Rendering) (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n8. INDESHD1: History of Interior Design 1 (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n9. INDESMR1: Materials and Resources 1 (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. 3DDRAWNG: 3-Dimensional Drawing (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n2. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPANIPI: Panitikan sa Pilipinas / Philippine Literature (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. INDES221: Interior Design 2B (1 Lec, 3 Lab, 3 Units). Prerequisite: None.\n6. INDES223: Renaissance Art (3 Lec, 0 Lab, 4 Units). Prerequisite: None.\n7. INDESHD2: History of Interior Design 2 (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n8. INDESLID: Lighting Design (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n9. INDESMR2: Materials and Resources 2 (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. COMRENDG: Computer Rendering (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDES311: Interior Design 3A (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDESCMU: Construction Materials and Utilities (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. INDESFD1: Furniture Design 1 (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n8. INDESHD3: History of Interior Design 3 (Oriental Arts) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. FASHNDES: Costume and Fashion (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n2. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. INDES321: Interior Design 3B (1 Lec, 3 Lab, 4 Units). Prerequisite: None.\n4. INDESBUT: Building Utilities (ID Elec 5) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDESFD2: Furniture Design 2 (1 Lec, 3 Lab, 4 Units). Prerequisite: None.\n6. INDESICD: Int. Const. and Detailing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. INDESPCT: Plant/Cul.Tours & Sem. (ID Elec. 4) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. INDESRID: Research Met. in Int. Des. (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Summer:\n1. INDESPRAC: Practicum/Internship (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INDES411: Interior Design 7 (Thesis/Research) (2 Lec, 4 Lab, 6 Units). Prerequisite: None.\n2. INDESBMD: Business Management in Interior Design (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. INDESIFP: Interior Floral Design and Plantscaping (1 Lec, 2 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INDES421: Interior Design 8 (Actual Construction) (2 Lec, 8 Lab, 6 Units). Prerequisite: None.\n2. INDESISP: Interior Styling and Photography (2 Lec, 3 Lab, 3 Units). Prerequisite: None.\n3. INDESPPE: Professional Practice and Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.",
    "keywords": [
      "BSID",
      "Interior Design Curriculum",
      "EARIST",
      "College of Architecture and Fine Arts",
      "Course Checklist",
      "INDES",
      "Furniture Design",
      "Thesis",
      "Practicum",
      "Color Theory",
      "History of Interior Design"
    ]
  },
  {
    "id": "earist_cas_bsit_complete_curriculum",
    "source": "BSINFOTECH.pdf - Effective June 2018",
    "category": "Academic Programs - College of Arts and Sciences",
    "topic": "Bachelor of Science in Information Technology (BSIT) Complete Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Arts and Sciences, offers the Bachelor of Science in Information Technology. The program has a total of 157 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. FPROGLAB: Computer Programming 1 (Fundamentals of Programming) Lab (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n2. FPROGLEC: Computer Programming 1 (Fundamentals of Programming) Lec (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n6. GEPURPCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n9. INTCOMLB: Introduction to Computing (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n10. INTCOMLC: Introduction to Computing (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n11. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. DBMSLAB1: Database Management System 1 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n2. DBMSLEC1: Database Management System 1 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n3. DISCMATH: Discrete Mathematics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPANIPI: Panitikan sa Pilipinas / Philippine Literature (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. IPROGLAB: Computer Programming 2 (Intermediate Programming) Laboratory (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n9. IPROGLEC: Computer Programming 2 (Intermediate Programming) Lecture (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n10. NSTP Options (Select One): NSTP-CWTS 2 (Civic Welfare), NSTP-LTS 2 (Literacy Training), or NSTP-MTS 2 (Military Training) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, First Semester:\n1. BUSANALY: Business Analytics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. WEBDVLB1: Web Development 1 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n5. WEBDVLC1: Web Development 1 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. DBMSLAB2: Database Management System 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n2. DBMSLEC2: Database Management System 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n3. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. INTHCILB: Introduction to Human Computer Interaction (Laboratory) (0 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n6. INTHCILC: Introduction to Human Computer Interaction (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. IPATLAB1: Integrative Programming and Technologies 1 (Laboratory) (0 Lec, 2 Lab, 2 Units). Prerequisite: None.\n8. IPATLEC1: Integrative Programming and Technologies 1 (Lecture) (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n9. NETWKLB1: Networking 1 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n10. NETWKLC1: Networking 1 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n11. WEBDVLB2: Web Development 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n12. WEBDVLC2: Web Development 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. APDEVLAB: Application Development and Emerging Technology (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n2. APDEVLEC: Application Development and Emerging Technology (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n3. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. MMDIALAB: Multimedia (Laboratory) (0 Lec, 2 Lab, 2 Units). Prerequisite: None.\n5. MMDIALEC: Multimedia (Lecture) (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n6. NETWKLB2: Networking 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n7. NETWKLC2: Networking 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n8. SYSARCH1: Systems Integration and Architecture 1 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n9. SYSARLB1: Systems Integration and Architecture 1 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n10. WEBDVLB3: Web Development 3 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n11. WEBDVLC3: Web Development 3 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. GEELECES: Environmental Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. IAASLAB1: Information Assurance and Security 1 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n4. IAASLEC1: Information Assurance and Security 1 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. ITTHESI1: Capstone Project and Research 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MOBAPLAB: Mobile Application Development (iOS & Android) Laboratory (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n7. MOBAPLEC: Mobile Application Development (iOS & Android) Lecture (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n8. OOPRGLAB: Object-Oriented Programming (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n9. OOPRGLEC: Object-Oriented Programming (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n10. QUANMETH: Quantitative Methods (including Modeling and Simulation) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. IAASLAB2: Information Assurance and Security 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n3. IAASLEC2: Information Assurance and Security 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. ITTHESI2: Capstone Project and Research 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. ITTHESL2: Capstone Project and Research 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n6. SPISSUES: Social and Professional Issues (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. SYSADMLB: Systems Administration and Maintenance (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n8. SYSADMLC: Systems Administration and Maintenance (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n9. SYSARCH2: Systems Integration and Architecture 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n10. SYSARLB2: Systems Integration and Architecture 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. ITINTERN: Practicum/Internship (10 Lec, 0 Lab, 10 Units). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Information Technology Curriculum",
      "EARIST",
      "College of Arts and Sciences",
      "Web Development",
      "Database Management",
      "Networking",
      "Capstone Project",
      "Mobile Application Development",
      "Systems Administration"
    ]
  },
  {
    "id": "earist_cit_bsit_automotive_curriculum",
    "source": "BSIT-AT.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Automotive Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Automotive Technology. The program has a total of 168 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. AUTOTEC1: Basic SMAW and GMAW, Soldering and Joining Operation for Automotive Application (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURPCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. AUTOTEC2: Automotive Engine Overhauling, Rebuilding, Basic Power Conversion and Electrical Assembly (3 Lec, 3 Lab, 6 Units). Prerequisite: AUTOTEC1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: GEKOMFIL.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: GEPEMOVE.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1. (Includes components: NSTP-CWTS 2 or NSTP-MTS 2).\n\nSecond Year, First Semester:\n1. AUTOTEC3: Automotive Air-conditioning System: Servicing, Repair and Maintenance (3 Lec, 3 Lab, 6 Units). Prerequisite: AUTOTEC2.\n2. ELCAUTO1: Basic Automotive Electronics Engine Management System (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. AUTOTEC4: Motorcycle and Small Engine Servicing and Maintenance (3 Lec, 3 Lab, 6 Units). Prerequisite: AUTOTEC3.\n2. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. ELCAUTO2: Automotive Electronic Instrumentation & Electronic Climate Control Systems Servicing and Maintenance (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. AUTOTEC5: Advanced Electronic Engine Management for Petrol/Gasoline Engine (3 Lec, 3 Lab, 6 Units). Prerequisite: AUTOTEC4.\n2. ELCAUTO3: Automotive Body Computer System Diagnosis and Electronically Controlled Powertrain System (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. AUTOTEC6: Advanced Electronic Engine Management for Common Rail Direct Injection Diesel Engine (3 Lec, 3 Lab, 6 Units). Prerequisite: AUTOTEC5.\n2. ELCAUTO4: Elective 4: Simulated Safety Driving and Troubleshooting (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: METORES1.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Automotive Technology",
      "AUTOTEC",
      "Engine Overhauling",
      "In-Plant Training",
      "EARIST",
      "College of Industrial Technology",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cit_bsit_drafting_curriculum",
    "source": "BSIT-DT.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Drafting Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Drafting Technology. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. DRAFTEC1: Advanced Mechanical Drafting (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. DRAFTEC2: Advance Machine and Furniture Drafting (3 Lec, 3 Lab, 6 Units). Prerequisite: DRAFTEC1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. DRAFTEC3: Advanced Architectural Drafting 1 (3 Lec, 3 Lab, 6 Units). Prerequisite: DRAFTEC2.\n2. ELCDRAF1: Auto CAD Drawing (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. DRAFTEC4: Advanced Architectural Drafting 2 (3 Lec, 3 Lab, 6 Units). Prerequisite: AUTOTEC3 (Note: Source indicates Automotive Tech course, likely a typo for DRAFTEC3).\n3. ELCDRAF2: Sketch-up with Vray (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. DRAFTEC5: CAD Architectural Renderings (3 Lec, 3 Lab, 6 Units). Prerequisite: DRAFTEC4.\n2. ELCDRAF3: Revit Architecture (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. DRAFTEC6: 3D Architectural Modeling and Construction Materials and Estimate (3 Lec, 3 Lab, 6 Units). Prerequisite: DRAFTEC5.\n2. ELCDRAF4: Elective 4: Photoshop (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Drafting Technology",
      "DRAFTEC",
      "Architectural Drafting",
      "CAD",
      "Revit",
      "Sketch-up",
      "In-Plant Training",
      "EARIST"
    ]
  },
  {
    "id": "earist_cit_bsit_electrical_curriculum",
    "source": "BSIT-ELECTRICAL.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Electrical Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Electrical Technology. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. ELECTRI1: Philippine Electrical Code (PEC) and Its Application (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. ELECTRI2: Transformer, DC Rotating Machine and Alternative Sources of Energy (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCELCT1: Domestic Refrigeration and Air-conditioning System (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRI3: AC Rotating Machine, Single Phase and Three Phase Motors (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI2.\n3. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCELCT2: Basic Electronics (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. ELECTRI4: Basic Motor Control Circuits (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCELCT3: Logic Circuit and Solid State Motor Controller (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRI5: Advanced Motor Control Circuits (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI4.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCELCT4: Elective 4: Preventive Maintenance (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRI6: Programmable Logic Circuits, Automation and Mechatronics (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI5.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Electrical Technology",
      "ELECTRI",
      "Motor Control",
      "PLC",
      "In-Plant Training",
      "EARIST",
      "College of Industrial Technology",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cit_bsit_electrical_curriculum",
    "source": "BSIT-ELECTRICAL.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Electrical Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Electrical Technology. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. ELECTRI1: Philippine Electrical Code (PEC) and Its Application (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. ELECTRI2: Transformer, DC Rotating Machine and Alternative Sources of Energy (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCELCT1: Domestic Refrigeration and Air-conditioning System (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRI3: AC Rotating Machine, Single Phase and Three Phase Motors (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI2.\n3. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCELCT2: Basic Electronics (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. ELECTRI4: Basic Motor Control Circuits (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCELCT3: Logic Circuit and Solid State Motor Controller (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRI5: Advanced Motor Control Circuits (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI4.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCELCT4: Elective 4: Preventive Maintenance (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRI6: Programmable Logic Circuits, Automation and Mechatronics (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRI5.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Electrical Technology",
      "ELECTRI",
      "Motor Control",
      "PLC",
      "In-Plant Training",
      "EARIST",
      "College of Industrial Technology",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cit_bsit_electronics_curriculum",
    "source": "BSIT-ELECTRONICS.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Electronics Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Electronics Technology. The program has a total of 165 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. ELECTRO1: Electronics Communication Systems (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTP-LTS 1: NSTP Literacy Training Service 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. ELECTRO2: Industrial Communication Systems (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRO1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCELXT1: Basic Welding (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRO3: Digital Home Integration (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRO2.\n3. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCELXT2: Introduction to Motor Control (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. ELECTRO4: Microcontrollers and Digital Signal Processors (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRO3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCELXT3: Basic Refrigeration and Air-conditioning (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRO5: Instrumentation and Industrial Electronics (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRO4.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCELXT4: Elective 4: Automotive Electronics Accessories (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELECTRO6: Biomedical Equipment Technology (3 Lec, 3 Lab, 6 Units). Prerequisite: ELECTRO5.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: METORES1.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Electronics Technology",
      "ELECTRO",
      "Communication Systems",
      "Microcontrollers",
      "Biomedical Equipment Technology",
      "In-Plant Training",
      "EARIST",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cit_bsit_fashion_apparel_curriculum",
    "source": "BSIT-FAT.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Fashion and Apparel Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Fashion and Apparel Technology. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. FASHTEC1: Clothing Fundamentals and Apparel Construction (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. FASHTEC2: Men's Clothing and Advanced Apparel Construction (3 Lec, 3 Lab, 6 Units). Prerequisite: FASHTEC1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCFASH1: Textile Study (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. FASHTEC3: Fashion Studies and Design Development 1 (3 Lec, 3 Lab, 6 Units). Prerequisite: FASHTEC2.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCFASH2: Costume Details and Fashion Accesories (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. FASHTEC4: Fashion Design and Development 2 (3 Lec, 3 Lab, 6 Units). Prerequisite: FASHTEC3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCFASH3: Garment Alteration and Repair Services (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FASHTEC5: Apparel Production and Operation Analysis (3 Lec, 3 Lab, 6 Units). Prerequisite: FASHTEC4.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCFASH4: Elective 4: Home Details and Interior Accessories (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FASHTEC6: Apparel Production and Fashion Merchandizing (3 Lec, 3 Lab, 6 Units). Prerequisite: FASHTEC5.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Fashion and Apparel Technology",
      "FASHTEC",
      "Fashion Design",
      "Apparel Construction",
      "Textile Study",
      "In-Plant Training",
      "EARIST",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cit_bsit_food_technology_curriculum",
    "source": "BSIT-FT.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Food Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Food Technology. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. FOODTEC1: Food Selection and Preparation (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. FOODTEC2: Quantity Food Production (3 Lec, 3 Lab, 6 Units). Prerequisite: FOODTEC1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCFOOD1: Food Safety and Sanitation with Food Laws (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. FOODTEC3: Advanced Baking and Pastry Production (3 Lec, 3 Lab, 6 Units). Prerequisite: FOODTEC2. (Note: Source text contains a typo listing 36 units; context confirms 6 units).\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCFOOD2: Food Science (Food Chemistry) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. FOODTEC4: Food Processing and Packaging (3 Lec, 3 Lab, 6 Units). Prerequisite: FOODTEC3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCFOOD3: Food Science (Culinary Nutrition) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FOODTEC5: Experimental Cookery with Objective Evaluation of Food (3 Lec, 3 Lab, 6 Units). Prerequisite: FOODTEC4.\n3. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCFOOD4: Elective 4: Subjective Evaluation of Food (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FOODTEC6: Asian and Western Cuisine (3 Lec, 3 Lab, 6 Units). Prerequisite: FOODTEC5.\n3. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Food Technology",
      "FOODTEC",
      "Food Selection",
      "Baking and Pastry",
      "Food Processing",
      "Culinary Nutrition",
      "In-Plant Training",
      "EARIST",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cit_bsit_industrial_chemistry_curriculum",
    "source": "BSIT-IC.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Industrial Chemistry) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Industrial Chemistry. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. INDCHEM1: Wine and Other Beverages (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. INDCHEM2: Food Preservation and Processing (3 Lec, 3 Lab, 6 Units). Prerequisite: INDCHEM1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCCHEM1: Basic Industrial and Testing Techniques (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. INDCHEM3: Oils, Fats Soap and Detergent Industry (3 Lec, 3 Lab, 6 Units). Prerequisite: INDCHEM2.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCCHEM2: Packaging Methods and Techniques (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. INDCHEM4: Color Chemistry and Cosmetic Industry (3 Lec, 3 Lab, 6 Units). Prerequisite: INDCHEM3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCCHEM3: Green Chemistry (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDCHEM5: Pulp and Paper Industry (3 Lec, 3 Lab, 6 Units). Prerequisite: INDCHEM4.\n6. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCCHEM4: Elective 4: Waste Management and Basic Process (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. INDCHEM6: Plastic Industry (3 Lec, 3 Lab, 6 Units). Prerequisite: INDCHEM5.\n4. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Industrial Chemistry",
      "INDCHEM",
      "Food Preservation",
      "Cosmetic Industry",
      "Soap and Detergent Industry",
      "Green Chemistry",
      "Waste Management",
      "In-Plant Training",
      "EARIST"
    ]
  },
  {
    "id": "earist_cit_bsit_machine_shop_practice_curriculum",
    "source": "BSIT-MSP.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Machine Shop Practice) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Machine Shop Practice. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. MECHTEC1: Metrology and Bench Work Practices (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n7. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. MECHTEC2: Lathe Machine Operation 1 (3 Lec, 3 Lab, 6 Units). Prerequisite: MECHTEC1.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n7. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n\nSecond Year, First Semester:\n1. ELCMSPR1: Applied Mechanical Mathematics (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. MECHTEC3: Milling and Grinding Machine Operations (3 Lec, 3 Lab, 6 Units). Prerequisite: MECHTEC2.\n4. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n5. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCMSPR2: Corrective and Preventive Maintenance (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. MECHTEC4: Electric Arc and Gas Welding (3 Lec, 3 Lab, 6 Units). Prerequisite: MECHTEC3.\n4. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. ELCMSPR3: Introduction to CNC (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MECHTEC5: Tool and Die Making (3 Lec, 3 Lab, 6 Units). Prerequisite: MECHTEC4.\n7. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. ELCMSPR4: Elective 4: Blueprint Reading (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. MECHTEC6: Jigs and Fixtures Design (3 Lec, 3 Lab, 6 Units). Prerequisite: MECHTEC5.\n5. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Machine Shop Practice",
      "MECHTEC",
      "Lathe Machine",
      "Milling and Grinding",
      "Tool and Die",
      "Jigs and Fixtures",
      "In-Plant Training",
      "EARIST"
    ]
  },
  {
    "id": "earist_cit_bsit_refrigeration_air_conditioning_curriculum",
    "source": "BSIT-RA.pdf - Effective June 2018",
    "category": "Academic Programs - College of Industrial Technology",
    "topic": "Bachelor of Science in Industrial Technology (Refrigeration and Air-Conditioning Technology) Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Industrial Technology, offers the Bachelor of Science in Industrial Technology with a major in Refrigeration and Air-Conditioning Technology. The program has a total of 162 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n3. GEPURCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDRACA1: Industrial Drawing with CAD 1 (2D) (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n6. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. RACTECH1: Special Refrigeration, Systems, Principles, Installation and Servicing (3 Lec, 3 Lab, 6 Units). Prerequisite: None.\n\nFirst Year, Second Semester:\n1. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDRACA2: Industrial Drawing with CAD 2 (3D) (2 Lec, 1 Lab, 3 Units). Prerequisite: INDRACA1.\n6. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1.\n7. RACTECH2: Light and Heavy Transport Air-Conditioning Systems, Installation and Servicing (3 Lec, 3 Lab, 6 Units). Prerequisite: RACTECH1.\n\nSecond Year, First Semester:\n1. ELCRACT1: Electronics and Power Inverter Application in HVAC/R System (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. ENTNCOOP: Entrepreneurship and Cooperatives (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n4. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n6. PLAVISEM: Plant Visit and Seminar (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. RACTECH3: Packed HVAC Units and Commercial Refrigeration System Servicing (3 Lec, 3 Lab, 6 Units). Prerequisite: RACTECH2.\n\nSecond Year, Second Semester:\n1. COMPPROG: Computer Programming (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. ELCRACT2: Industrial HVAC/R Motor Controller (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n3. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n7. RACTECH4: Air-Duct System, Design, Fabrication, Installation and Servicing (3 Lec, 3 Lab, 6 Units). Prerequisite: RACTECH3.\n\nThird Year, First Semester:\n1. ELCRACT3: Industrial Heating System (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. FORELANG: Foreign Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEELECDS: Practical Data Science (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. INDORMAN: Industrial Organization & Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. METORES1: Methodology of Research 1 (Feasibility Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. RACTECH5: Industrial Chiller Systems, Servicing and Preventive Maintenance (3 Lec, 3 Lab, 6 Units). Prerequisite: RACTECH4.\n\nThird Year, Second Semester:\n1. ELCRACT4: Elective 4: Marine Refrigeration and Cold Storage Plant System (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. LABRELTN: Labor Relation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. METORES2: Methodology of Research 2 (Project Study) (3 Lec, 0 Lab, 3 Units). Prerequisite: METORES1.\n5. OHASSTAN: Occupational Health and Safety Standards (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. PROOPMAN: Production Operation Management (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. RACTECH6: Ice Plant Design and Installation (3 Lec, 3 Lab, 6 Units). Prerequisite: RACTECH5.\n\nFourth Year, First Semester:\n1. INPLTRN1: In-Plant Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL: Student Training Evaluation 1 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. INPLTRN2: Supervised Industrial Training (0 Lec, 10 Lab, 10 Units). Prerequisite: None.\n2. STTREVL2: Student Training Evaluation 2 (1 Lec, 0 Lab, 1 Unit). Prerequisite: None.",
    "keywords": [
      "BSIT",
      "Industrial Technology",
      "Refrigeration and Air-Conditioning",
      "RACTECH",
      "HVAC",
      "Chiller Systems",
      "Ice Plant Design",
      "In-Plant Training",
      "EARIST",
      "Curriculum"
    ]
  },
  {
    "id": "earist_cas_bs_math_complete_curriculum",
    "source": "BSMATH.pdf - Effective June 2018",
    "category": "Academic Programs - College of Arts and Sciences",
    "topic": "Bachelor of Science in Mathematics (BS Math) Complete Curriculum",
    "content": "The Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST), College of Arts and Sciences, offers the Bachelor of Science in Mathematics. The program has a total of 182 units and the curriculum is effective as of June 2018. The complete course offerings by year and semester are listed below.\n\nFirst Year, First Semester:\n1. GEARTAPP: Art Appreciation (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEKOMFIL: Kontekstwalisadong Komunikasyon sa Filipino (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEMATHMW: Mathematics in the Modern World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEMOVE: Movement Enhancement (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GESCIETS: Science, Technology and Society (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MATHANA1: Calculus 1 (5 Lec, 0 Lab, 5 Units). Prerequisite: None.\n7. MATHFUND: Fundamental Concepts of Mathematics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. NSTPROG1: National Service Training Program 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None. (Includes CWTS, LTS, or MTS options).\n\nFirst Year, Second Semester:\n1. COMPLAB1: Fundamentals of Computing 1 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: MATHFUND. Corequisite: COMPLEC1.\n2. COMPLEC1: Fundamentals of Computing 1 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: MATHFUND. Corequisite: COMPLAB1.\n3. GEPANIPI: Panitikan sa Pilipinas / Philippine Literature (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEPEFITE: Fitness Exercises (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n5. GEUNDETS: Understanding the Self (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. GPMAHLAB: General Physics 1 (Mechanics and Heat) Laboratory (0 Lec, 1 Lab, 1 Unit). Prerequisite: MATHANA1. Corequisite: GPMAHLEC.\n7. GPMAHLEC: General Physics 1 (Mechanics and Heat) Lecture (3 Lec, 0 Lab, 3 Units). Prerequisite: MATHANA1. Corequisite: GPMAHLAB.\n8. MATHANA2: Calculus 2 (5 Lec, 0 Lab, 5 Units). Prerequisite: MATHANA1.\n9. NSTPROG2: National Service Training Program 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: NSTPROG1. (Includes CWTS, LTS, or MTS options).\n\nSecond Year, First Semester:\n1. COMPLAB2: Fundamentals of Computing 2 (Laboratory) (0 Lec, 1 Lab, 1 Unit). Prerequisite: COMPLAB1. Corequisite: COMPLEC2.\n2. COMPLEC2: Fundamentals of Computing 2 (Lecture) (2 Lec, 0 Lab, 2 Units). Prerequisite: COMPLEC1. Corequisite: COMPLAB2.\n3. GECONTWO: The Contemporary World (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. GEELECCP: Communicative Proficiency in Business Correspondence and Research Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEPEHEF1: Physical Activity Towards Health and Fitness 1 (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n6. GPEAMLAB: General Physics 2 (Electricity and Magnetism) Laboratory (0 Lec, 1 Lab, 1 Unit). Prerequisite: GPMAHLAB. Corequisite: GPEAMLEC.\n7. GPEAMLEC: General Physics 2 (Electricity and Magnetism) Lecture (3 Lec, 0 Lab, 3 Units). Prerequisite: GPMAHLEC. Corequisite: GPEAMLAB.\n8. MATHABSA: Abstract Algebra (3 Lec, 0 Lab, 3 Units). Prerequisite: MATHFUND.\n9. MATHANA3: Calculus 3 (3 Lec, 0 Lab, 3 Units). Prerequisite: MATHANA2.\n\nSecond Year, Second Semester:\n1. GEELECIT: Living in Information Technology Era (2 Lec, 1 Lab, 3 Units). Prerequisite: None.\n2. GEETHICS: Ethics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GEPEHEF2: Physical Activity Towards Health and Fitness II (2 Lec, 0 Lab, 2 Units). Prerequisite: None.\n4. GEPURPCO: Purposive Communication (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. GEREADPH: Readings in Philippine History (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MATHADVC: Advanced Calculus (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. MATHLINA: Linear Algebra (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. MATHPROB: Probability (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, First Semester:\n1. AUTOMATA: Automata Theory and Formal Language (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. DIFFEQUA: Differential Equations (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. GELIFEWR: The Life and Works of Rizal (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. MATHGRAP: Graph Theory and Applications (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. MATHINTE: Theory of Interest (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MATHNUMT: Number Theory (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. MATHSTAT: Statistical Theory (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n8. OPERSRES: Operations Research (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nThird Year, Second Semester:\n1. GEELECEM: The Entrepreneurial Mind (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. MATHACTU: Actuarial Mathematics (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. MATHMODE: Mathematical Modeling (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. MATHMODG: Modern Geometry (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. MATHNUMA: Numerical Analysis (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MTFELEC1: Free Elective 1 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n7. MTTHES11: Seminar in Thesis Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, First Semester:\n1. BASICACC: Basic Accounting (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n2. GEFILDIS: Filipino sa Iba't ibang Disiplina (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n3. MATHCMPX: Complex Analysis (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n4. MATHREAL: Real Analysis (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n5. MTFELEC2: Free Elective 2 (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n6. MITHESI2: Thesis Writing (3 Lec, 0 Lab, 3 Units). Prerequisite: None.\n\nFourth Year, Second Semester:\n1. MTINTERN: Practicum/Internship (9 Lec, 0 Lab, 9 Units). Prerequisite: None.",
    "keywords": [
      "BS Mathematics",
      "BS Math",
      "Mathematics Curriculum",
      "Calculus",
      "Abstract Algebra",
      "Actuarial Mathematics",
      "EARIST",
      "College of Arts and Sciences"
    ]
  }
]

