[
  {
    "id": "admission_reqs_2025_tech_eng_design_official",
    "source": "EARIST Admission Posters A.Y. 2025-2026 & Social Media Directory",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "Requirements for Engineering, Computing, Industrial Tech, and Architecture (CEN, CCS, CIT, CAFA)",
    "content": "According to the EARIST Admission Posters for Academic Year 2025-2026, the University has established specific grade and general weighted average (GWA) requirements for its technical, engineering, and design colleges. \n\nThe College of Engineering (CEN) enforces the most rigorous admission standards. Applicants for the Bachelor of Science degrees in Chemical Engineering (BSChE), Electrical Engineering (BSEE), Civil Engineering (BSCE), Mechanical Engineering (BSME), Computer Engineering (BSCoE), and Electronics and Communication Engineering (BSECE) must possess a General Weighted Average (GWA) of 90% or above and must have no grades lower than 88 in all subjects. For official inquiries, the College of Engineering operates via https://www.facebook.com/CENSGEARIST.\n\nThe College of Computing Studies (CCS) offers the Bachelor of Science in Computer Science (BSCS) and the Bachelor of Science in Information Technology (BS INFO.TECH). The admission policy mandates that applicants must have no grades lower than 80 in all subjects and must achieve a GWA of 90% or above. The official communication channel for CCS is https://www.facebook.com/tatakComsa.\n\nThe College of Architecture and Fine Arts (CAFA) has distinct criteria for its programs. The Bachelor of Science in Architecture (BS ARCHI.) and Bachelor of Science in Interior Design (BSID) require no grades lower than 85 in all subjects and a GWA of 90%. Alternatively, the Bachelor of Fine Arts (BFA), offering majors in Painting and Visual Communication, requires a GWA of 85%. The official CAFA page is located at https://www.facebook.com/cafaearistofficial.\n\nThe College of Industrial Technology (CIT) offers the Bachelor of Industrial Technology with a wide range of majors including Apparel and Fashion Technology, Automotive Technology, Computer Technology, Drafting Technology, Electrical Technology, Electronics Technology, Food Trades, Industrial Chemistry, Mechanical Technology, and Heating, Ventilating and Air-Conditioning Technology. The unified qualification for all CIT majors is that applicants must have no grades lower than 80 in all subjects. The official CIT page is accessible at https://www.facebook.com/profile.php?id=100076321872710&sk=about.",
    "keywords": [
      "Engineering admission 2025",
      "Architecture requirements",
      "Computing Studies GWA",
      "Industrial Technology majors",
      "CEN",
      "CCS",
      "CAFA",
      "CIT",
      "BSCE",
      "BSCS",
      "BSIT"
    ]
  },
  {
    "id": "admission_reqs_2025_business_arts_service_official",
    "source": "EARIST Admission Posters A.Y. 2025-2026 & Social Media Directory",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "Requirements for Business, Arts, Education, Criminology, and Hospitality (CBPA, CAS, CED, CCJE, CHTM)",
    "content": "According to the EARIST Admission Posters for Academic Year 2025-2026, the University has updated the admission criteria for its business, social science, and service-oriented programs. \n\nThe College of Business and Public Administration (CBPA) offers the Bachelor of Science in Office Administration (BSOA), Bachelor of Science in Business Administration (Majors in Marketing Management, Human Resource Management), Bachelor of Science in Entrepreneurship (BSEntrep), and Bachelor of Science in Public Administration (BPA). Applicants to these programs must have no grades lower than 80 in all subjects and a General Weighted Average (GWA) of 90% or above. The official CBPA page is https://www.facebook.com/earist.cbpa.\n\nThe College of Criminal Justice Education (CCJE) offers the Bachelor of Science in Criminology (BSCrim). This program has strict physical and academic requirements: applicants must have no grades lower than 85 in all subjects, a GWA of 90% or above, and must meet the height requirement of 5'0\" for females and 5'2\" for males. The official CCJE page is https://www.facebook.com/EARIST.CCJE.\n\nThe College of Hospitality and Tourism Management (CHTM) offers the Bachelor of Science in Tourism Management (BST) and Bachelor of Science in Hospitality Management (BSHM). Admission requires no grades lower than 80 in all subjects, a GWA of 85% or above, and a height requirement of 5'4\" for females and 5'6\" for males. The official CHTM page is https://www.facebook.com/CHTMOfficial.\n\nThe College of Arts and Sciences (CAS) requires a GWA of 90% or above and no grades lower than 85 for the Bachelor of Science in Psychology (preferably HUMSS or STEM strands). The Bachelor of Science in Applied Physics and Bachelor of Science in Mathematics require no grades lower than 80 in all subjects. The official CAS page is https://www.facebook.com/amazingcas.\n\nThe College of Education (CED) offers the Bachelor of Secondary Education (BSE) with majors in Filipino, Mathematics, and Science; the Bachelor of Technology and Livelihood Education (BTLEd) with majors in Home Technology and Industrial Arts; and the Bachelor of Special Needs Education (BSNed). The universal qualification for CED is no grades lower than 80 in all subjects. The official CED page is https://www.facebook.com/EARIST.CED.Official.",
    "keywords": [
      "Business Administration admission",
      "Criminology height requirement",
      "Tourism and Hospitality requirements",
      "Psychology GWA",
      "Education majors",
      "CBPA",
      "CCJE",
      "CHTM",
      "CAS",
      "CED"
    ]
  }
]