[
  {
    "id": "admission_reqs_2025_tech_eng_design_official",
    "source": "EARIST Admission Posters A.Y. 2025-2026 & Social Media Directory",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "Admission Requirements and Official Facebook Pages for Engineering, Computing, Industrial Tech, and Architecture (CEN, CCS, CIT, CAFA)",
    "content": "According to the EARIST Admission Posters for Academic Year 2025-2026, the University has established specific grade requirements and designated official social media channels for its technical colleges.\n\nFor the College of Engineering (CEN), which includes BS Chemical, Electrical, Civil, Mechanical, Computer, and Electronics Engineering, applicants need a GWA of 90% and no grade lower than 88. The official Facebook page for CEN is https://www.facebook.com/CENSGEARIST.\n\nFor the College of Computing Studies (CCS), offering BS Computer Science and BS Info Tech, applicants need a GWA of 90% and no grade lower than 80. The official Facebook page for CCS is https://www.facebook.com/tatakComsa.\n\nFor the College of Architecture and Fine Arts (CAFA), Architecture and Interior Design applicants need a GWA of 90% (no grade lower than 85), while Fine Arts requires a GWA of 85%. The official Facebook page for CAFA is https://www.facebook.com/cafaearistofficial.\n\nFor the College of Industrial Technology (CIT), covering all industrial technology majors, applicants must have no grades lower than 80. The official Facebook page for CIT is https://www.facebook.com/profile.php?id=100076321872710&sk=about.",
    "keywords": [
      "CEN Facebook page",
      "CCS Facebook page",
      "CAFA Facebook page",
      "CIT Facebook page",
      "Official social media",
      "Engineering admission",
      "Architecture requirements"
    ]
  },
  {
    "id": "admission_reqs_2025_business_arts_service_official",
    "source": "EARIST Admission Posters A.Y. 2025-2026 & Social Media Directory",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "Admission Requirements and Official Facebook Pages for Business, Arts, Education, Criminology, and Hospitality (CBPA, CAS, CED, CCJE, CHTM)",
    "content": "According to the EARIST Admission Posters for Academic Year 2025-2026, the University has updated the admission criteria and contact channels for business and service programs.\n\nFor the College of Business and Public Administration (CBPA), offering Entrepreneurship, Public Admin, and Business Admin, applicants need a GWA of 90% and no grade lower than 80. The official Facebook page for CBPA is https://www.facebook.com/earist.cbpa.\n\nFor the College of Criminal Justice Education (CCJE), offering BS Criminology, applicants need a GWA of 90% (no grade lower than 85) and must meet height requirements. The official Facebook page for CCJE is https://www.facebook.com/EARIST.CCJE.\n\nFor the College of Hospitality and Tourism Management (CHTM), offering Tourism and Hospitality Management, applicants need a GWA of 85% (no grade lower than 80) and must meet height requirements. The official Facebook page for CHTM is https://www.facebook.com/CHTMOfficial.\n\nFor the College of Arts and Sciences (CAS), Psychology applicants need a GWA of 90%, while Math and Physics applicants need no grade lower than 80. The official Facebook page for CAS is https://www.facebook.com/amazingcas.\n\nFor the College of Education (CED), offering Secondary Ed, Special Needs Ed, and BTLEd, applicants must have no grades lower than 80. The official Facebook page for CED is https://www.facebook.com/EARIST.CED.Official.",
    "keywords": [
      "CBPA Facebook page",
      "CCJE Facebook page",
      "CHTM Facebook page",
      "CAS Facebook page",
      "CED Facebook page",
      "Business Administration admission",
      "Criminology requirements"
    ]
  },
  {
    "id": "earist_registrar_document_procedures_2025",
    "source": "Student Experience Guide (2025 Update)",
    "category": "Academic Records & Registrar Services",
    "topic": "Procedures for Requesting Certified Documents (COR, COG, CTC)",
    "content": "According to the 2025 Student Experience Guide regarding Academic Record Requests at the Manila Campus, specific updated procedures, fees, and logistical constraints exist for securing certified academic documents. This guidance pertains to the Student Academic Records Management System (SARRMS), located at the Office of the Registrar on the Ground Floor of the Main Building. While grades are viewable via the Pinnacle Student Portal, official use for scholarships or employment requires on-site requests for signed documents. Students must be aware of specific acronyms: 'SARRMS' refers to the Registrar's Office, 'COR' is the Certificate of Registration, 'COG/ROG' is the Certificate/Report of Grades, and 'CTC' stands for Certified True Copy.\n\nOperational Logistics and Time Warnings\nStudents are strongly advised to avoid visiting the Registrar around 12:00 PM . The office observes a strict lunch break around 12:00 PM, and the cut-off for accepting new requests or payments typically occurs by 1:00 PM. The standard processing time for COR with CTC and ROG with CTC documents is estimated between 1 to 2 hours.\n\nProcedure for Obtaining a COR with CTC\nTo obtain an authenticated Certificate of Registration, the total estimated cost is ₱40.00 (₱20.00 for the reprint and ₱20.00 for the CTC seal). The process involves four distinct steps. First, the student must request a 'COR with CTC' at the SARRMS window and obtain a Request Slip. Second, the student proceeds to the Cashier's Office to pay the ₱40.00 fee and secure an Official Receipt. Third, the student returns to the Registrar to retrieve the printed Original COR. Fourth, and most critically, the student must sign the 'Student's Signature' line on the Original COR immediately and then make a clear photocopy of the signed document at a nearby facility. Finally, the student submits both the signed Original COR and the photocopy to the Registrar for verification and the application of the CTC seal.\n\nProcedure for Obtaining a COG/ROG with CTC\nTo obtain an official list of grades, the cost is calculated at ₱40.00 per semester requested (₱20.00 for the Grade Sheet plus ₱20.00 for the CTC Seal). For example, a request for two semesters incurs a fee of ₱80.00. The student must request a 'Copy of Grades with CTC' at the SARRMS window, explicitly stating the specific Academic Year and Semester required (e.g., 1st Year, 2nd Sem, A.Y. 2023-2024). After paying the total amount at the Cashier, the student returns the Request Slip and Official Receipt to the Registrar. The student must then wait for their name to be called to claim the printed Report of Grades (ROG), which will be released with the Certified True Copy seal already stamped. Note that fees and procedures are based on student experiences as of 2025 and are subject to administrative changes.",
    "keywords": [
      "SARRMS",
      "Registrar",
      "COR",
      "COG",
      "ROG",
      "CTC",
      "certified true copy",
      "transcript",
      "fees",
      "Manila Campus",
      "procedure",
      "cut-off time",
      "Pinnacle Portal",
      "2025 update"
    ]
  }
]