[
  {
    "id": "earist_library_committee_composition_and_general_functions",
    "source": "Library Manual",
    "category": "Library Services - Organization and General Functions",
    "topic": "Library Committee Governance and General Librarian Responsibilities",
    "content": "Under the Library Services organizational structure defined in the EARIST Student Handbook, the administration and operation of the library are governed by specific committees and functional groups. The Library Board Committee is headed by a Chairman appointed by the President of the institution. The Director of the Library serves as the secretary of the committee and disseminates information on the activities done by the committee. The members of the committee are composed of the Deans of different colleges, the Director of Instruction, and a student representative from the student government.\n\nThe Library Committee serves as the Technical Working Group (TWG) in charge of the review and revision of the Library Manual. It performs monitoring and coordinating tasks to ensure smooth operation and efficient delivery of service by the Institute Library. These functions include reviewing the status of library holdings for the purpose of selecting materials, disseminating information pertaining to policies and operations of the library, participating in the Annual Library Budget Preparation, keeping abreast with recent innovations and developments in instruction, and initiating resource-sharing activities or projects to meet the needs of the library.\n\nIn addition to the committee, the Handbook outlines the distinct functions of Professional Librarians and Paraprofessional Librarians. Professional Librarians are responsible for selection and acquisition for collection development, cataloging and classification, provision of bibliographic tools and indexes, and updating current awareness services. They handle information dissemination activities for notices, announcements, and latest news through bulletin boards, signage, newsletters, and media boards. Furthermore, Professional Librarians handle accreditation requirements by preparing needed documents for each program under evaluation, and they manage clearance requirements by signing clearances for student records, enrollment, faculty leaves, transfers, resignations, or retirements. They also facilitate referrals and accommodate endorsements both coming in and going out of the libraries.\n\nParaprofessional Librarians, acting as support staff, manage circulation works to facilitate use and access to the collection. They provide reading guidance to assist users with proper materials and locations. Their preservation activities include repairing and mending materials for longer use. They handle the mechanical and technical preparation of library materials, including accessioning, labeling, catalog cards, and book card production. Paraprofessional staff also prepare documents for physical inventory, maintain the strictest implementation of rules and regulations for discipline and order, and assist with accreditation and clearance requirements similar to professional staff.",
    "keywords": [
      "Library Board Committee",
      "Technical Working Group",
      "Professional Librarians",
      "Paraprofessional Librarians",
      "accreditation",
      "library budget",
      "library governance"
    ]
  },
  {
    "id": "earist_library_personnel_specific_roles_and_descriptions",
    "source": "Library Manual",
    "category": "Library Services - Personnel Roles",
    "topic": "Specific Job Descriptions of Library Staff and Officers",
    "content": "Under the Library Services section of the EARIST Student Handbook, specific roles and responsibilities are mandated for library staff to ensure efficient performance of tasks. The Director of Library Services maintains an adequate collection that supports the objectives and programs of the school, submits annual program budget proposals and annual reports, supervises library personnel in proper record maintenance and management, evaluates staff job performance, and leads the staff in inventory, cataloging, and classifying books. The Director takes full responsibility for determining policies and procedures in the selection of books in coordination with the library committee and participates in professional organizations.\n\nThe Chief of Operations or Assistant Chief of Library Services oversees the technical, operational, and administrative activities of the library. This role involves implementing policies on library use, acquiring reading materials for students and faculty, organizing materials for maximum use, attending seminars for professional growth, conducting book inventory at the end of the school year, developing good reading habits among students, and working cooperatively with academic and administrative staff.\n\nThe College Librarian is responsible for selecting, developing, cataloging, and classifying library resources. They answer library users’ queries, ensure services meet the needs of specific user groups, assist readers with computer equipment and literature searches, promote library resources, maintain proper decorum inside the library, and perform other duties assigned by the library head.\n\nSupport Staff members are responsible for the overall operations of service desks depending on their assignments. They maintain statistical records such as client usage frequencies, update information files, perform annual physical inventories, encode library documents, shelf-read books, and maintain the preservation and upkeep of library materials.\n\nStudent Assistants and OJT Trainees are tasked with updating shelf-list cards and bibliographic records, repairing slightly mutilated materials, maintaining cleanliness and orderliness, assisting inquiries, helping users with access tools, retrieving books, and maintaining the book collection in all sections.\n\nFinally, Library Coordinators are faculty or personnel designated via Special Order (S.O.) to serve as coordinators for each program. These designations run for a certain period until superseded by another appointment issued by the Office of the President.",
    "keywords": [
      "Director of Library Services",
      "Chief of Operations",
      "College Librarian",
      "Student Assistants",
      "Library Coordinators",
      "job descriptions",
      "roles and responsibilities"
    ]
  },
  {
    "id": "earist_library_materials_classification_organization",
    "source": "Library Manual",
    "category": "Library Services - Collection & Organization",
    "topic": "Types of Materials, Classification Systems, and Cataloging",
    "content": "Under the Library Services guidelines regarding the Library Collection, materials are categorized into specific types and organized using standardized systems. The collection includes General Reference Books (encyclopedias, dictionaries, almanacs, atlases, handbooks) which are for room use only. Circulation Books cover broad subjects such as Philosophy, Religion, Social Sciences, Language, Arts, Pure Science, Applied Science, Literature, History, and Geography. Periodicals consist of local and foreign journals, magazines, newspapers, government publications, and vertical files like pamphlets; these are strictly for room use. Electronic Resources include e-books, e-journals, online databases, and digital formats like PDF or HTML accessible via hardware or the internet.\n\nThe library organizes its holdings according to the Dewey Decimal Classification (DDC) System, which divides knowledge into ten major classes: 000 (General works/Computer Science), 100 (Philosophy/Psychology), 200 (Religion), 300 (Social Sciences), 400 (Language), 500 (Pure Science), 600 (Technology), 700 (Arts & Recreation), 800 (Literature), and 900 (History & Geography). Under this system, books with the same call number are classified as the same subject.\n\nThe library operates on an open-shelf system where materials are arranged by section. Books are labeled with place marks or location symbols on top of the call number to indicate their section. For example, the General Circulation collection uses the 'C' symbol. Undergraduate and graduate theses are labeled by their respective courses. To assist users in locating materials, the Union Card Catalog serves as an alphabetical index. It utilizes an Author Card, Title Card, and Subject Card for each book, interfiled following a word-by-word alphabetical arrangement.",
    "keywords": [
      "Dewey Decimal Classification",
      "DDC",
      "Card Catalog",
      "Electronic Resources",
      "General Reference",
      "Circulation Books",
      "Periodicals"
    ]
  },
  {
    "id": "earist_library_sections_locations_facilities",
    "source": "Library Manual",
    "category": "Library Services - Facilities",
    "topic": "Library Sections, Locations, and Floor Plan",
    "content": "According to the Library Sections and Locations guide in the Student Handbook, the library is distributed across multiple floors with specific functions for each area. \n\nThe Ground Floor houses the Museum, which contains memorabilia and vital documents pertaining to 'Amang' and his contributions to EARIST. \n\nThe Second Floor contains the General Collection/Circulation Section, comprising the bulk of materials for undergraduate general education courses (psychology, economics, arts, etc.). The Filipiniana Section is also located on the second floor within the circulation area, housing publications by Filipino authors or foreign authors writing about the Philippines. The Technical Section, responsible for processing and labeling books, operates on both the second and third floors.\n\nThe Third Floor houses the General Reference Section, containing encyclopedias, dictionaries, and yearbooks intended for specific information retrieval rather than continuous reading. The Periodical Section is joined with the Graduate School Section on this floor. It provides current and past newspapers, journals, and magazines. The Graduate School Section caters to graduate students and faculty immersed in research, housing theses and dissertations which are strictly for room use and cannot be reproduced. \n\nThe Fourth Floor contains the EARIST Learning Commons (formerly the ICT Room). This section provides access to internet browsing for research work and offers an environment for open communication and collaboration. \n\nAdditionally, the library defines specific 'Readers Services' roles for these sections: The Reference Section assists researchers in book choice; the Filipiniana Section handles local history and culture materials; and the Circulation Section manages the charging and discharging of books.",
    "keywords": [
      "General Circulation",
      "Filipiniana Section",
      "Graduate School Section",
      "Learning Commons",
      "Museum",
      "Reference Section",
      "Periodicals",
      "floor plan"
    ]
  },
  {
    "id": "earist_collection_development_acquisition_policy",
    "source": "Library Manual",
    "category": "Library Services - Administration",
    "topic": "Collection Development Policy and Acquisition Guidelines",
    "content": "The EARIST Library Collection Development Policy outlines the objectives and processes for selecting and acquiring library materials. The primary objective is to assist clientele in academic development by providing updated resources that support instruction, research, and extension programs. Selection is a collaborative responsibility involving Deans, faculty, library staff, and students. Faculty recommendations form the basis for acquisitions, while library staff ensure a balanced collection by covering areas not included in recommendations.\n\nAcquisition guidelines prioritize knowledge of the book trade, wide selection, and proper recording. Limitations on acquisition include prioritizing current publications of scholarly value over older materials. Duplicate copies are purchased only upon justification of heavy and continuous use. Variant editions are acquired only if they are standard editions or contain substantial changes needed for research. Hardbound books are preferred over paperbacks for durability, with paperbacks purchased only if no other edition exists or demand is high.\n\nThe library maintains specific policies for different material types. For Serials, the library acquires holdings in major fields, public affairs, and research values within financial capabilities. For Filipiniana, the library acquires materials published in or about the Philippines, including government agency publications and university research. The library also engages in Exchanges with other institutions to augment resources.\n\nThe policy for Examination Copies dictates that book dealers send materials for inspection. These are reviewed by Deans, Department Chairs, and Library Committee Representatives, who are given one to two weeks to recommend books for purchase.",
    "keywords": [
      "Collection Development Policy",
      "Acquisition Guidelines",
      "Selection Responsibility",
      "Book Duplication",
      "Serials",
      "Filipiniana Acquisition",
      "Examination Copies"
    ]
  },
  {
    "id": "earist_library_cataloging_technical_processes",
    "source": "Library Manual",
    "category": "Library Services - Technical Operations",
    "topic": "Cataloging, Classification Procedures, and Library Systems",
    "content": "The Student Handbook details the Cataloging and Classification procedures used to organize library materials. A catalog main entry is created for every document, containing class numbers and subject headings. Adequate added entries (author, title, series, editor) are provided to create multiple access points for users. The library utilizes the Anglo-American Cataloging Rules (AACR2) and the Dewey Decimal Classification (DDC) system. Tools used in this process include the Sears List of Subject Headings, DDC, Cutter’s Table, and AACR2.\n\nThe procedure for cataloging books involves classifying the book, identifying the entry point, providing a process slip, encoding the slip for student use, and providing access codes. The purpose of these records is to allow clientele to find information via author, title, subject, series, or illustrator. \n\nTo modernize access, the library employs an Online Public Access Catalog (OPAC). This system is supported by Koha, an open-source, web-based integrated library system used for circulation, cataloging, acquisition, serials, patron management, and reporting. The Technical Section is responsible for the mechanical preparation of materials, including classifying, cataloging, and labeling before items are circulated.",
    "keywords": [
      "AACR2",
      "Koha",
      "OPAC",
      "Sears List",
      "Cataloging Procedures",
      "Integrated Library System",
      "Cutter's Table"
    ]
  },
  {
    "id": "earist_library_maintenance_weeding_procedures",
    "source": "Library Manual",
    "category": "Library Services - Collection Maintenance",
    "topic": "Binding, Mending, and Weeding Procedures",
    "content": "The EARIST Library enforces specific procedures for the maintenance and weeding of its collection to ensure materials remain relevant and in good condition. \n\nFor physical maintenance, the degree of damage determines whether a book is mended, rebound, or replaced. Simple mending is applied to torn pages, while re-binding is considered for worn books with important, unobtainable content. If binding or mending is not feasible, the library adopts weeding procedures for textbooks without permanent value, books beyond repair, and out-of-date reference books.\n\nWeeding is defined as the process of removing unneeded materials to keep the collection fresh and responsive. While factors such as the 'sanctity' of the collection or professional work pressure may discourage weeding, the library mandates it due to space limitations and storage costs. \n\nThe criteria for weeding are based on four main factors: \n1. **Last Date of Circulation:** Items not used in ten years (or less depending on type) are candidates for weeding. \n2. **Physical Condition:** Items in bad condition are weeded unless a decision is made to repair or replace them. \n3. **Timeliness:** This includes out-of-date materials (especially in science and technology, where the rule of thumb is 3-5 years), obsolete textbooks, and materials that no longer support the curriculum. \n4. **Reliability and Language:** Materials reflecting outdated viewpoints or in foreign languages that are no longer taught or used by the community are discarded. Translations should be checked periodically.",
    "keywords": [
      "Weeding Procedures",
      "Book Binding",
      "Book Mending",
      "Collection Maintenance",
      "Deselection Criteria",
      "Obsolete Materials"
    ]
  },
  {
    "id": "earist_library_history_vision_mission_objectives",
    "source": "Earist.Edu.Ph",
    "category": "Library Background and Strategic Direction",
    "topic": "History, Vision, Mission, and Objectives of the EARIST Library",
    "content": "According to the institutional records regarding the EARIST Library History, the facility began as the 'Amang' Foundation Library with a limited collection of books and 'Amang' Memorabilia. It originally occupied a room on the third floor of the Apilado Building under the supervision of Ms. Corazon P. Villafania. In 1986, the library transferred to a larger space on the second floor of the Regala Building to accommodate the growing student population, serving as the central library supervised by Chief Librarian Dr. Flocerfida M. Doña and Ms. Erlinda P. Natal. In 2002, per the directive of President Dr. Maura V. Bautista, the central library was devolved to different colleges to align with the vertical structure policy.\n\nFollowing AACCUP recommendations and accreditation visits, a four-story building was constructed in 2006. The ground floor houses the EARIST Museum. From 2015 to the present, the second floor functions as the General Circulation and Filipiniana Section Library, while the third floor accommodates the Graduate School, Periodicals Section, and Theses Section. The fourth floor serves as the Information Technology Center (ITC), Audio Visual or Multimedia Center, and Learning Commons. The institute remains committed to developing the library to meet modern standards.\n\nThe Library Vision envisions the facility as a resource center of quality information serving stakeholders in the pursuit of academic excellence. The Library Mission is to provide services and materials that are accessible, significant, and appropriate for library users. The stated Objectives of the library are to support the institute's program in instructional research and information needs, provide adequate information resources and facilities to the EARIST academic community to achieve school goals, and to develop, enrich, and maintain the library collection to meet the needs of the school's curriculum and programs.",
    "keywords": [
      "Amang Foundation Library",
      "history",
      "vision",
      "mission",
      "objectives",
      "Regala Building",
      "Apilado Building",
      "library facilities"
    ]
  },
  {
    "id": "earist_library_services_operations_contacts",
    "source": "Earist.Edu.Ph",
    "category": "Library Services and Operations",
    "topic": "Comprehensive List of Physical and Online Library Services",
    "content": "The EARIST Library offers a specific suite of services and operates under defined hours. Library Online Services Hours are from Monday to Thursday, 8:00 AM to 5:00 PM, with no online services available on Saturdays, Sundays, holidays, or school breaks.\n\nThe core Library Services include the Circulation Service, which handles the checking out and returning of materials, and the Reference and Information Service, where librarians assist with book choices to encourage effective time use. The Referral Service assists enrolled students, faculty, and staff who wish to use other libraries and accommodates referrals from external institutions. The Computer and Internet Access Service provides computers or laptops for internet access. Library Orientation is conducted weeks after classes start to introduce services and facilities. The Current Awareness Service disseminates the latest information on acquisitions and activities via bulletin boards, newsletters, and the website.\n\nAdditional Online Reference and Research Support Services are available via Facebook Messenger, Email, Phone calls, and the website. Document Delivery Services allow for document request pick-up either personally, through a representative, or via courier. A Drop Box for Book Returns is available, requiring the completion of a Google Form, use of the designated box, and an acknowledgment email for confirmation. Remote Access for e-resources is available for both on-site and off-site usage. Online Library Instruction is also provided.\n\nRegarding the Reservation for Use of Equipment and Facilities, requests to reserve the library or equipment for research must be made at least three days in advance to avoid conflicts. The Faculty in charge must inform the librarian and submit a letter of request. The library can be contacted via telephone at 8243-9466 to 68 loc. 122 or email at library@earist.ph.education. The main campus is located at Nagtahan St, Sampaloc, Manila.",
    "keywords": [
      "online services",
      "circulation service",
      "reference service",
      "document delivery",
      "remote access",
      "reservation policy",
      "contact information"
    ]
  },
  {
    "id": "earist_library_general_rules_conduct_access",
    "source": "Earist.Edu.Ph",
    "category": "Library Rules and Conduct",
    "topic": "General Rules, Authorized Users, and Behavioral Regulations",
    "content": "The EARIST Library enforces strict General Rules and Regulations to maintain order and security. Authorized Users include enrolled EARIST students, faculty members, administrators, and staff. Incoming users, visitors, or alumni are also authorized provided they present a referral letter from their respective library and a valid ID.\n\nUnder the General Rules, a student must possess a validated school ID to enter. To borrow materials, a student must possess an original Certificate of Registration (COR) valid for the current year. The COR is non-transferable; any misrepresentation or passing of the COR to another student makes the owner liable, and borrowing must be done personally. Bags must be surrendered at the baggage counter, though valuable items like cellphones and wallets should be exempted and kept with the owner.\n\nBehavioral protocols dictate that silence must be observed; idle conversations, loud laughter, and unnecessary noise are prohibited. Students are not allowed to eat, sleep, litter, or loiter inside the library. Library facilities must be kept in order, and chairs must be pushed back before leaving. Charging of laptops, cell phones, and other gadgets is strictly prohibited inside the library.\n\nRegarding the handling of materials, leaning or writing on books is prohibited. Students must refrain from hiding or stealing books. Tearing out pages or forging signatures will result in disciplinary actions. Misbehavior risks the suspension of library privileges or suspension from the library at the librarian's discretion, with repeated cases reported to the discipline officer.\n\nAccess for Graduate and undergraduate students and researchers from other schools is limited to room-use only on Fridays, with a maximum of three students per school, upon presentation of a valid ID and referral letter. EARIST Alumni may use the library upon presentation of a valid Alumni ID.",
    "keywords": [
      "authorized users",
      "Certificate of Registration",
      "COR",
      "library etiquette",
      "disciplinary actions",
      "visitor access",
      "baggage counter"
    ]
  },
  {
    "id": "earist_library_circulation_loans_penalties",
    "source": "Earist.Edu.Ph",
    "category": "Library Circulation Policy",
    "topic": "Borrowing Procedures, Loan Periods, and Penalties",
    "content": "The EARIST Library Circulation Policy defines the procedures for borrowing, loan limits, and penalties for infractions. To borrow books, a student must present a valid Certificate of Registration (COR). Students may refer to the card catalog or OPAC for titles or request librarian assistance.\n\nLoan privileges vary by user type. Students are allowed to borrow a maximum of two (2) books for overnight use only. Books for overnight or weekend use may be borrowed one hour before closing time and must be returned on or before 10:00 AM the following service day. Staff and full-time faculty may borrow a maximum of five (5) books every semester, while part-time faculty may borrow a maximum of three (3) books every semester, provided they present valid identification cards. Faculty loans may extend until the end of the semester.\n\nThe Loan Period varies by material type. Filipiniana books and general collection books are for overnight use only (Monday to Friday). Fiction books can be borrowed for one week. General references, newspapers, magazines, journals, clippings, theses, and dissertations are strictly for room use only. Reproduction of theses and dissertations in whole or in part is prohibited.\n\nRegarding Penalties, failure to return borrowed books results in the confiscation of the valid COR for a period of 3 days to 1 week (excluding weekends and class suspensions due to inclement weather). The librarian reserves the discretion to suspend library privileges for habitual offenders. For Lost and Damaged Materials, a lost book must be reported immediately to avoid sanctions. Lost books must be replaced with the latest edition of the same title; if unavailable, a related title of the latest edition is acceptable.",
    "keywords": [
      "borrowing limits",
      "loan period",
      "overnight use",
      "penalties",
      "lost books",
      "replacement policy",
      "faculty loans"
    ]
  }
]