[
  {
    "id": "ced_faculty_staff_directory_complete",
    "source": "College of Education Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Services of the College of Education",
    "content": "The College of Education is administered by Dean Dr. Evangeline M. Sangalang, Associate Dean Dr. Ailene R. Tuzon, and College Secretary Jayson P. Payte, MAEd. The college is organized into various academic departments and service units, each led by specific heads and coordinators.\n\nThe academic departments and their respective faculty are as follows:\n\n**BSE – Science:** Headed by Raffy A. Murilla. Faculty members include Dr. Eleonor T. Salvador, Felisa M. Villanoy, Benjamin A. Haboc, and Arjay Advincula.\n\n**BSNED – Generalist:** Headed by Mathew N. Gamboa. Faculty members include Raymond D. Cansino and Daisy Lyn M. Dela Rosa.\n\n**BSE – Filipino:** Headed by Joseph C. Anggot. Faculty members include Dr. Eriberto R. Astorga Jr., Dr. Babylin J. Conti, Jayson P. Payte, and Emmanuel H. Montoya.\n\n**BSE – Mathematics:** Headed by Dr. Ailene R. Tuzon. Faculty members include Dr. Evangeline M. Sangalang, Daisy Mae R. Bongitwon, Elsa R. Cagatan, Lawrence C. Durban, Dr. Allan G. Quismundo, and Meriam L. Tria.\n\n**BTLED – Industrial Arts (I.A.):** Headed by Ernie M. Cabalu. Faculty members include Dr. Josie R. Sonio, Centrey L. Ramos, Ernesto C. Pacheco Jr., and Andre R. Gabumpa.\n\n**BTLED – Home Economics (H.E.):** Headed by Roselle Ghee E. Aranez. Faculty members include Renz Robert E. Salvador, Lara May G. Cornel, and Jessa Marie L. Sanchez.\n\n**General Education:** Headed by Dr. Conrado B. Blando. Faculty members include Angela M. Caaya, Virgel E. Diamante, Dr. Ruth Lareza A. Morales, and Evelyn M. Polison.\n\n**Professional Science:** Headed by Raffy A. Murilla. Faculty members include Jayson P. Payte, Renz Robert E. Salvador, Felisa M. Villanoy, Dr. Ernie M. Cabalu, and Mercy M. Mejica.\n\n**Teaching Internship:** The Faculty Coordinators for the internship program are Dr. Babylin J. Conti, Joseph C. Anggot, Dr. Ailene R. Tuzon, Raffy A. Murilla, Mathew N. Gamboa, and Dr. Ernie M. Cabalu.\n\nIn addition to academic roles, the College of Education manages specific Program Services led by the following Chairs:\n* **Student Government Services:** Dr. Conrado B. Blando.\n* **Alumni Affairs Services:** Raymond D. Cansino.\n* **Interfaith Services and Extension and Community Services:** Dr. Babylin J. Conti.\n* **Institute Review Center and Management Information System:** Lawrence C. Durban.\n* **Linkages, Career and Job Placement Services, and Guidance and Counselling Services:** Mathew N. Gamboa.\n* **Physical and Sports Development Services:** Raffy A. Murilla.\n* **Gender and Development Services:** Jayson P. Payte.\n* **Quality Assurance, COPCO:** Cintrey L. Ramos.\n* **Library Services:** Jessa Marie L. Sanchez.\n* **Research Development Services:** Dr. Ailene A. Tuzon.\n* **Building Administration and Property Custodian:** Dr. Josie R. Sonio.",
    "keywords": [
      "College of Education",
      "Dean Sangalang",
      "BSE Science",
      "BSNED Generalist",
      "BSE Filipino",
      "BSE Mathematics",
      "BTLED",
      "Faculty List",
      "Department Heads",
      "Program Chairs"
    ]
  },
  {
    "id": "cbpa_faculty_staff_directory_complete",
    "source": "College of Business and Public Administration Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Departments of the College of Business and Public Administration",
    "content": "According to the provided faculty list for the College of Business and Public Administration (CBPA), the college administration is led by Dean Willy O. Gapasin, DBA. The administrative team includes Associate Dean Chanda R. Tingga, DBA, and College Secretary Shiela C. Castillo, MBA.\n\nThe college is divided into several academic departments, each with specific leadership and faculty rosters. The BSBA Human Resource Management Department is headed by Charlene U. Escario, Ph.D. Its faculty members include Emerson G. Cabudol, DBA, Ronaldo F. Doroteo, DBA, Jeffrey E. Falogme, DBA, Cirni B. Gecosala, Ph.D., Michael F. Gibaga, DBA, Isaac O. Ochotorena, MBA, JD, and Hernan M. Oliveros, DBA.\n\nThe BSBA Marketing Management Department is led by Department Head Jane S. Isla, DBA. The faculty consists of Martin T. Aguilar, BA, Benigno A. Castillo, DPA, Belinda L. Cumpas, MBA, Michael Darwin D. Domingo, DBA, Hiromi T. Kikuchi, DBA, Joel D. Reyes, Ph.D., and Christian Andre M. Viril, MBA.\n\nThe Bachelor in Public Administration Department is headed by Marlenel Monterona, Ed.D., Ph.D., DEA. The faculty roster includes Eugene S. Abdon, DPA, Florinda DC. Bautista, MPA, Evelyn R. Celestial, DPA, Diana P. Dela Cruz, MPA, Manolo N. Delos Reyes, DPA, Yolanda A. Lara, DPA, Arci V. Manangan, DPA, Erick P. Mante, MPA, Keiven M. Marcelo, DPA, Jackylin G. Pido, MPA, and Christiane Villanueva, MPA.\n\nThe BS in Office Administration Department is headed by Chanda R. Tingga, DBA. Faculty members include Analiza G. Asistol, MPA, Aguida V. Cabreros, DBA, Shiela C. Castillo, MBA, Noemi D. Cruz, MBA, Irma F. Filler, MBA, Jolly Joey B. Flora, MBA, Estrellita S. Glodo, MBA, JD, and Marvin P. Honrado, MBA.\n\nThe BS in Entrepreneurship Department is led by Department Head Jhon Ven Saint L. Pasahol, DBA. Its faculty includes Rommel DG. Aquino, MAT, Melba S. Asuncion, DBA, Annalyn A. Buenaseda, MBA, Gonzalo G. David III, DBA, Ma. Lourdes H. Gomez, DBA, Ma. Theresa G. Maddagan, DBA, Cynthia A. Manalad, DBA, and Maria Teresa F. Modesto, PhD.\n\nThe General Education Department within the college is headed by Ana May A. Pagaling, Ed.D. The faculty members are Sofia Del A. Cruz, MAEd, Cesar Garcia, Ed.D., Dasha Marie G. Reodica, Ed.D., and Fernando Filler, MAEd.",
    "keywords": [
      "College of Business and Public Administration",
      "CBPA Faculty",
      "Dean Gapasin",
      "BSBA Human Resource Management",
      "BSBA Marketing Management",
      "Public Administration",
      "Office Administration",
      "Entrepreneurship",
      "General Education",
      "Department Heads"
    ]
  },
  {
    "id": "chtm_faculty_staff_directory_complete",
    "source": "College of Hospitality and Tourism Management Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Departments of the College of Hospitality and Tourism Management",
    "content": "According to the provided faculty list for the College of Hospitality and Tourism Management (CHTM), the college is led by Dean Maria Rhoda D. Dinaga, DBA, with Tenie P. Lirazan, MBA serving as the College Secretary. The college is organized into two main departments: Hospitality Management and Tourism Management, supported by General Education faculty.\n\nThe Hospitality Management Department is headed by Loida R. Banzuelo, DBA. The core faculty includes Romeo D. Lim, DBA, Joselito D. Mabansag, DBA, and Jovan L. Yosa. Several faculty members hold specific administrative or coordinator roles: Jocelyn L. Aguas, MBA serves as the Adviser for Student Government; Dulce B. Aurelio, MAIE is the HRM Program Chair responsible for OJT and Job Placement; Tenie P. Lirazan, MBA acts as the Program Chair for Extension; Evan Join S. Magno, MBA is on the faculty; and Robert P. Mallon, MAEd serves as the Program Chair for Alumni Services.\n\nThe General Education Faculty associated with the college includes several Program Chairs: Jeffrey B. Villena, EL.D (Filipino & Research), Vircel E. Diamante, MAIP (Guidance and Counseling), Jonjon V. Pantaleon, MAT (Sports Development), and Matthew N. Gamboa (Library Services). Additional General Education faculty members are Arnold M. Bautista, MAE (EM), Edwin V. Tendero, Ed.D (EM), Angela Micaaya, MPA, and Dennis P. Ordovez, Ed.D (EA).\n\nThe Tourism Management Department is headed by Perlita M. Mallarimba. The core faculty consists of Percy Ann Elaine P. Jimenez, Ph.D, Moresa Joy V. Gregana, MIHTM, Mary Grace C. Santos, MPA, and Kristine Joy P. Castro. Additionally, Glessie M. Basa, MBA serves as the Program Chair for Gender And Development within this department.",
    "keywords": [
      "CHTM Faculty",
      "Hospitality Management",
      "Tourism Management",
      "Dean Dinaga",
      "Loida Banzuelo",
      "Perlita Mallarimba",
      "Program Chairs",
      "General Education Faculty"
    ]
  },
  {
    "id": "ccs_faculty_staff_directory_complete",
    "source": "College of Computing Studies Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty and Administration of the College of Computing Studies",
    "content": "The College of Computing Studies is led by Dean Dr. Jesus S. Paguigan. The college is organized into two primary departments: Information Technology and Computer Science, each with its own program chair and faculty roster.\n\nThe Information Technology Department is headed by Program Chair Prof. Hazel F. Anuncio, MIT. The faculty members include Instructor II Prof. Joevelyn W. Fajardo, MIT, and several Instructor I members: Prof. Larry T. Rutaquio Jr., MIT, Prof. Ernanie M. Carlos Jr., MIT, Prof. Edgardo R. Sison, MIT, Prof. Melody L. Gabas, Prof. Dhani San Jose, and Prof. Ma. Jasmine Rose D. Macasil, MIT. Additionally, the department employs Part-Time Instructors Prof. Jonnifer C. Mandigma and Prof. Erwinaldgeriko F. Lagda.\n\nThe Computer Science Department is headed by Program Chair Prof. Al F. Santiago, MSCS. The faculty includes senior members such as Associate Professor III Dr. Shiela Marie M. Matias, Assistant Professor I Dr. Arlene P. Evangelista, and Assistant Professor II Dr. Jefferson A. Costales. The instructor staff consists of Prof. Merlita Latip (Instructor III), Prof. James Darryl L. Bungay, MSCS (Instructor I), Prof. Arjo Ladia (Instructor I), Prof. Jovel O. Advincula (Instructor I), and Prof. Kathleen M. Dimaano (Instructor I). Prof. John Kenneth A. Gabas serves as a Part-Time Instructor.",
    "keywords": [
      "College of Computing Studies",
      "CCS Faculty",
      "Dean Paguigan",
      "Information Technology Department",
      "Computer Science Department",
      "Program Chairs",
      "Hazel Anuncio",
      "Al Santiago",
      "Faculty List"
    ]
  },
  {
    "id": "ccje_faculty_staff_directory_complete",
    "source": "College of Criminal and Justice Education Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty and Administration of the College of Criminal and Justice Education (CCJE)",
    "content": "The College of Criminal and Justice Education (CCJE) has established its official faculty and staff directory, which outlines the administrative leadership, professional course instructors, general education faculty, and student support personnel. \n\nThe administration of the college is led by Dean Dr. Anabele Del Mundo-Riva. She is supported by Associate Dean Dr. May Liza Nera Cañas. Additionally, Dr. Juan Leonardo B. Britanico holds the position of Library and Extension Coordinator.\n\nThe faculty for Professional Courses is composed of both full-time and part-time instructors. Dr. Hassanour P. Cali serves as a Full-Time faculty member and holds the specific role of CSG Adviser. The department employs a significant number of Part-Time faculty members, including Dr. Dondon B. Maribbay, Prof. Braulio S. Basco, Prof. Edwin Brandon Gener, Prof. Daniel D. Garcia, Prof. Gonzalo Ricaplaza, and Prof. Marcelino Villanueva. Several attorneys also serve as Part-Time instructors, specifically Atty. Manolyn Collado, Atty. Georgian D. Pascua, and Atty. Jenalyn T. Baccay.\n\nThe General Education department within the CCJE includes a core team of Full-Time professors: Prof. Leonel S. Salvador, Prof. Esperanza M. Villena, Prof. Ma. Teresa Modesto, and Prof. Eugene Bayotas. Complementing the full-time staff are Part-Time instructors Prof. Godofredo Fajardo, Prof. Angelita S. Parlan, and Prof. Russie Perez. \n\nFor Student Support services, Ms. Chescka Jane Vitto is designated as the Student Assistant.",
    "keywords": [
      "College of Criminal and Justice Education",
      "CCJE Faculty",
      "Dean Del Mundo-Riva",
      "Criminology Instructors",
      "Professional Courses",
      "General Education Faculty",
      "College Administration"
    ]
  },
  {
    "id": "cit_faculty_staff_directory_complete",
    "source": "CIT Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty and Administration of the College of Industrial Technology (CIT)",
    "content": "The College of Industrial Technology (CIT) has released its official directory of administration, department heads, and faculty members. The college is led by Dean Dr. Erwin P. Ordovez and Associate Dean Prof. Evelyn A. Gabas. The academic structure encompasses various specialized technology departments and a General Education unit.\n\nThe Automotive Technology Department is headed by Jordan A. Datu, with faculty members Jay C. Bernardo and Irving E. Bucao. The Mechanical Technology Department is led by Department Head Eldon P. Perez, supported by part-time faculty Erwin C. Barba. The Drafting Technology Department is headed by Reynante T. Tonido, with Cynthia M. Reblando serving as full-time faculty and Rolito A. Alcantara as part-time faculty.\n\nThe Electronics Technology Department is headed by Allan A. Sandoval. Its faculty roster includes Ferdinand P. Alvaro, Ryan Alexie L. Bairan, Ivan F. Castillano, and Dr. Erwin P. Ordovez. The Electrical Technology Department is led by Rolf Irwin C. Dangla Cruz, with faculty members Mario Manuel B. Doctor III and Roberto E. Reynoso. The Industrial Chemistry Department is headed by Ariel E. Tobias, with faculty member Evelyn A. Gabas and part-time instructor Merelyn A. Marcelo.\n\nThe Computer Technology Department is led by Department Head Joseph Angelo C. Tanuecoz, with faculty members Sherwin Keith T. Rivera and Dennis P. Ordovez. The HVAC-R (Heating, Ventilation, Air Conditioning, and Refrigeration) Department is headed by Luvisminda Marcelo, with Nacho B. Amac serving as part-time faculty.\n\nThe Food Trades Department is headed by Rhyca Mae C. San Juan. The faculty includes Rodita M. Buencuchillo, Maureen D. Basi, Marivir M. Pielago, and Mithos Arth M. Pielago. The Apparel and Fashion Technology Department is led by Desiree Joyce L. Bedia, with Janice P. Mangahas as faculty.\n\nThe General Education Department is headed by Derrick O. Peralta. The faculty members are Edwin Anglo, Sofia Dela Cruz, Daniel D. Dineros, Felipe K. Jamero, Richard K. Jamero, and Rowena M. Valladolid.",
    "keywords": [
      "College of Industrial Technology",
      "CIT Faculty",
      "Dean Ordovez",
      "Automotive Technology",
      "Electronics Technology",
      "Industrial Chemistry",
      "Food Trades",
      "Apparel and Fashion Technology",
      "General Education"
    ]
  },
  {
    "id": "ce_dept_faculty_roster",
    "source": "CE Department Faculty List ",
    "category": "College Directory",
    "topic": "Faculty Roster of the Civil Engineering (CE) Department",
    "content": "The College of Engineering has released the faculty roster for the Civil Engineering (CE) Department. This department is comprised of a diverse group of professionals, including Doctors, Professors, and Engineers. The faculty list includes the following individuals:\n\n**Doctoral Faculty:**\n* Dr. Nerissa M. De Guzman\n* Dr. Bryan V. Bantayan\n\n**Professors:**\n* Prof. Meriam L. Tria\n\n**Engineering Faculty:**\nThe department is heavily staffed by engineers, including Engr. Jorge P. Bautista, Engr. Luvisminda D. Marcelo, and Engr. Dianlyn P. Espirtu (also listed as Engr. Dinalyn Espirtu). Other key faculty members include Engr. Antonio Carmelito Lizada, Engr. Jan Vicent Ku, Engr. Nelson P. Duyan, Engr. Ronald Baral, and Engr. Samuel Manatad.\n\nThe roster also lists Engr. Luigi Rr. Busa, Engr. Apolinario S. Sollano, Engr. Emmanuel M. Morales, Engr. Allen Yap, Engr. Allen Grey Carlos, Engr. Jerome Saltorio, Engr. Romeo Fernandez, and Engr. Sinifroso Roque. \n\nAdditional faculty members include Engr. Minerva C. Zoleta, Engr. Ador G. Utulo, Engr. Bernard C. Fabro, Engr. Jose C. Felipe, Engr. Caroline J. Agaab, Engr. John Andrew A. Tiria, Engr. Mary Jane L. Gabriel, and Engr. Jes Andre Trillana.\n\nFurther rounding out the department are Engr. Jay-R H. Menenes, Engr. Allan Q. Quismundo, Engr. Roberto M. Liwanag, Engr. Mark Niño B. Javier, Engr. Luisito Tolentino, Engr. Bernadito L. Fabro, Engr. Robel A. Nomorosa, Engr. John Dennice C. Ganotisi, Engr. Lydia N. Era, Engr. Jerrymias G. Avergonzado, Engr. Jose P. Labayna, Engr. Efren Pantoja, Engr. Winifredo Gonzales, Engr. Ket Chua, Engr. John Kelly Josue, and Engr. Romeo Tolentino.",
    "keywords": [
      "Civil Engineering Department",
      "CE Faculty",
      "College of Engineering",
      "Engr. Jorge P. Bautista",
      "Dr. Nerissa M. De Guzman",
      "Faculty Roster"
    ]
  },
  {
    "id": "cas_faculty_staff_directory_complete",
    "source": "College of Arts and Sciences Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Departments of the College of Arts and Sciences",
    "content": "The College of Arts and Sciences (CAS) has established its official directory of administration, program coordinators, and faculty across its various departments. The college leadership is headed by College Dean Dr. Rodora T. Oliveros and Associate Dean Prof. Dolores A. Nieto. Administrative support is provided by College Secretary Mr. Eleazar B. Bernales.\n\nThe college utilizes a team of Program Coordinators to manage specific functional areas:\n* **Research:** Dr. Roel P. Balayan\n* **Scientific Computing Research Laboratory:** Dr. Raymund M. Bolalin\n* **On-the-Job Training:** Dr. Jinamarlyn B. Doctor\n* **Guidance and Counseling, Gender and Development:** Prof. Ruth Lareza A. Morales\n* **Computer Laboratories:** Mr. Raynald C. Redondo\n* **Alumni Affairs:** Mr. Joneil G. Ponteros\n* **College Student Government:** Mr. Reenier Ledesma\n* **Extension Services:** Prof. Nerissa B. Capili\n\nThe academic structure of the College of Arts and Sciences is organized into four primary departments: General Education, Psychology, Applied Physics, and Mathematics.\n\nThe **General Education Department** faculty roster includes Dr. Joseph T. Moraca, Prof. Romeo B. Capucao Jr., Prof. Nerissa B. Capili, Prof. Dennis D. Mangubat, Dr. Carlito C. Biares, Mrs. Rosario U. Tanuecoz, Mr. Ricky G. Tebang, and Dr. Eugene S. Abdon.\n\nThe **Psychology Department** is led by Department Head Dr. Jinamarlyn B. Doctor. The faculty members include Dr. Lourdes B. Jusay, Prof. Ruth Lareza A. Morales, Dr. Rosel O. Cipriano, Ms. Devorah Ann V. Cornell, Prof. Myrtle P. Macam, and Ms. Jazmin B. Lasam.\n\nThe **Applied Physics Department** is led by Department Head Prof. Lester D. Bernardino. The faculty members include Dr. Raymund M. Bolalin, Mr. Hiromi Rivas, and Mr. Reenier Ledesma.\n\nThe **Mathematics Department** is led by Department Head Prof. Larex B. Tagalog. The faculty members include Dr. Roel P. Balayan, Dr. Jayson D. Tolentino, Mr. Raynald C. Redondo, Mr. Mark Ronoele R. Gonzalvo, Mr. Joneil G. Ponteros, and Mr. Eleazar B. Bernales.",
    "keywords": [
      "College of Arts and Sciences",
      "CAS Faculty",
      "Dean Oliveros",
      "General Education Department",
      "Psychology Department",
      "Applied Physics Department",
      "Mathematics Department",
      "Program Coordinators",
      "Faculty Directory"
    ]
  },
  {
    "id": "caefa_faculty_staff_directory_complete",
    "source": "CAEFA Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty and Administration of the College of Architecture and Fine Arts (CAEFA)",
    "content": "According to the provided faculty directory, the College of Architecture and Fine Arts (CAEFA) is administered by Dean Ar. Diane A. Jose. Supporting the administration are College Secretary Prof. Jay-Ar Flores and Administrative Assistant Prof. Louie Pereira. The college is organized into five distinct academic sections: Interior Design, Painting, Visual Communication, Architecture, and General Education.\n\nThe **BS Interior Design Department** is led by Department Head Dr. Esmeralda Ayag. The faculty members in this department include Dr. Gladys Bungar-Espejo, Dr. Mary Ann Capilitan, Dr. Jayson Chavez, and Dr. Ma. Kristhel Mangaring.\n\nThe **BFA Painting Department** is headed by Prof. Teresa Herrera. The faculty roster consists of Full-Time instructors Prof. Michael Jay Ramos and Prof. Roger Ramos, alongside Part-Time instructor Prof. Wendel Candawan.\n\nThe **BFA Visual Communication Department** is also headed by Prof. Teresa Herrera. The Full-Time faculty members are Prof. Aldwin Amorin, Prof. John Renzi Gamilla, Prof. Rowena Jasmin-Macahiya, Prof. Louie Pereira, and Prof. Blue Archimedes Santos. The department also employs Part-Time instructors Prof. Cesar Evangelista and Prof. Denver Page.\n\nThe **BS Architecture Department** lists Ar. Gerald Allan Adane as the Dean (serving as the department lead). The Full-Time faculty includes Ar. Rolan Alamillo, Ar. Maria Lourdes De Vera - Francisco, Ar. Setien Herrera, Ar. Diane Jose, Ar. John Vincent Lopez, and Ar. Joey Tan. The Part-Time faculty members are Ar. John Arvin Chua, Ar. Maundelito Florendo, and Ar. Christian Joy Recio.\n\nThe **General Education Department** within the college includes Full-Time faculty members Prof. Jay-Ar Flores and Prof. Juan Lauro Magugat. They are supported by Part-Time faculty members Prof. Carina Garcia and Prof. Edwin Jambre Jr.",
    "keywords": [
      "College of Architecture and Fine Arts",
      "CAEFA Faculty",
      "Dean Diane Jose",
      "BS Interior Design",
      "BFA Painting",
      "BFA Visual Communication",
      "BS Architecture",
      "General Education",
      "Faculty Directory"
    ]
  },
  {
    "id": "sas_organizational_structure_2025",
    "source": "SAS Organizational Structure 2025",
    "category": "Student Affairs and Services",
    "topic": "Complete Organizational Structure and Leadership",
    "content": "According to the official Student Affairs and Services (SAS) Organizational Structure for the year 2025, the department operates under a defined hierarchy starting with the central institute leadership. At the executive level, Dr. Rogelio T. Mamaradlo serves as the Institute President, while Dr. Eric C. Mendoza holds the position of Vice President for Academic Affairs. Ms. Agnes F. Amorin serves as the Director of Student Affairs and Services (SAS), directly overseeing the various specialized units dedicated to student support.\n\nThe specific service divisions and their respective leadership are designated as follows:\n\n**Scholarship Services:** This unit is led by Program Chair Mr. Martin T. Aguilar, supported by staff member Mr. Ivan Franz E. Dino.\n\n**Culture and Faith:** Mr. Evan John S. Magno holds dual responsibilities as the Chief of the Culture and Arts Division and the Chief of Inter Faith Services.\n\n**Sports and Physical Education:** The athletic programs are managed by Mr. Christopher T. Bunag, who serves as the Chief of Sports Development and Physical Education.\n\n**Admissions and Media:** Mr. Ferdinand DP. Alvarro is the Chief of Admission Services and Audio-Visual Services.\n\n**Career Services:** Professional development and employment support are led by Ms. Mercy M. Medica, the Chief of Career, Education, and Job Placement Services.\n\n**Counseling and Testing:** Mental health and psychological assessment services are headed by Chief Dr. Georgia P. Ramirez, RGC. She is assisted by Guidance Counselor Ms. Rodalyn S. Mamaclay, RGC.\n\n**Leadership Development:** The Leadership Division is directed by Program Head Ms. Patricia Anne P. Delina, with Ms. Hyacinth Joy C. Tolmulto serving as Staff.\n\n**Publications:** Mr. Virgel E. Diamante serves as the Chief of Student Publication and Yearbook.",
    "keywords": [
      "Agnes Amorin",
      "SAS Director",
      "Scholarship Services",
      "Guidance Counselor",
      "Sports Development",
      "Admission Services",
      "Student Publication",
      "Leadership Division",
      "Career Placement",
      "Organizational Chart"
    ]
  }
]