[
    {
    "id": "ulnayan_bookstore_inventory_price_list",
    "source": "ULNAYAN CONSUMER GOODS TRADING & BOOKSTORE Price List",
    "category": "Student Services - Bookstore",
    "topic": "Complete Textbook Price List and Store Hours",
    "content": "According to the official price list from ULNAYAN CONSUMER GOODS TRADING & BOOKSTORE, the store operates from Monday to Thursday between 8:00 AM and 4:00 PM. The bookstore offers a wide range of textbooks categorized into Business & Management and General Education.\n\nUnder the **Business & Management** category, the available titles and their corresponding prices are: 'Accounting the Language of Business' at 400; 'Administrative and Office Management' at 480; 'Business Principles and Merchandising' at 400; 'Business Laws and Regulation' at 700; 'Business Opportunities' at 460; 'Business Plan' at 450; 'Entrepreneurial Behavior Growth Mindset' at 420; 'Financial Management' at 610; 'Global Ventures: A Guide to International Business and Trades' at 420; 'Human Resource Management' at 420; 'Income Taxation' at 620; 'Introduction to Consumer Behavior' at 420; 'Laws on Obligations and Contracts' at 550; 'Legal Frameworks Navigating Business Law' at 510; 'Marketing Research' at 400; 'Mastering Pricing and Costing Strategies' at 370; 'Navigating the Landscape of Marketing Research' at 370; 'Obligations and Contracts' at 670; 'Operations Management' at 750; 'Principles of Total Quality Management' at 370; 'Project Mastery' at 440; 'Retail Management' at 490; 'Strategic Management' at 700; 'Strategic Management Philippine Business Landscape' at 370; 'The Guide for Managing Logistics' at 500; 'The Guidebook for Managing Logistics' at 520; 'The Ultimate Guide to E-Commerce' at 540; 'Worktext in Basic and Advanced Keyboarding' at 320; and 'Worktext in Shorthand Machine' at 330.\n\nUnder the **General Education** category, the available titles and prices are: 'Algebra–Trigonometry' at 340; 'Art Appreciation for Tertiary Education' at 360; 'Communicative Proficiency for Business Correspondence & Research Writing' at 360; 'Contemporary World' at 300; 'Differential Calculus' at 340; 'Discovering Knowledge in Information Technology Era' at 380; 'Entrepreneurship & Cooperatives' at 320; 'Environmental Science' at 340; 'Ethics for College Students' at 300; 'Filipino sa Ibat Ibang Disiplina' at 280; 'Integral Calculus' at 340; 'Kontekstuwalisadong Filipino' at 390; 'Mathematics in the Modern World' at 350; 'Panitikan ng Pilipinas' at 350; 'Practical Data Science' at 340; 'Purposive Communication' at 360; 'Readings in Philippine History' at 350; 'Rizal Life Works & Writings' at 360; 'Science, Technology & Society' at 320; 'Social Responsibilities and Good' at 350; and 'Understanding the Self' at 370.",
    "keywords": [
      "ULNAYAN Bookstore",
      "Textbook Prices",
      "Business Textbooks",
      "General Education Textbooks",
      "Store Hours",
      "Accounting Books",
      "Management Books"
    ]
  },
  {
    "id": "uniform_shop_price_list_complete",
    "source": "Uniform Price List ",
    "category": "Student Services - Uniform Shop",
    "topic": "Complete Price List for Institutional and P.E. Uniforms",
    "content": "According to the official Uniform Price List provided by the institution, the pricing structure for student uniforms is categorized by type—Institutional Male, Institutional Female, and Physical Education (P.E.)—and further broken down by specific size ranges. \n\nFor the **Male Institutional Uniform**, the pricing is as follows: The cost for Small and Medium sizes is set at ₱1,050.00. For students requiring Large or Extra Large (XL) sizes, the price increases to ₱1,100.00. The larger sizes of 2XL and 3XL are priced at ₱1,150.00, while the largest available sizes, 4XL and 5XL, are sold for ₱1,200.00.\n\nThe **Female Institutional Uniform** follows a slightly different pricing tier. For female students, the Small and Medium sizes are available at a cost of ₱950.00. The Large and XL sizes are priced at ₱1,000.00. For those requiring 2XL or 3XL sizes, the cost is ₱1,050.00, and the largest sizes of 4XL and 5XL are priced at ₱1,150.00.\n\nRegarding the **P.E. Uniform**, which is applicable to students across the board, the price list designates the following costs based on size: Small and Medium P.E. uniforms are priced at ₱900.00. The Large and XL sizes cost ₱950.00. For 2XL and 3XL sizes, the price is ₱1,000.00. The 4XL and 5XL sizes are available for ₱1,050.00. Additionally, the P.E. uniform offers extended sizing options, with 6XL and 7XL sizes available for ₱1,100.00.",
    "keywords": [
      "Uniform Prices",
      "Male Uniform Cost",
      "Female Uniform Cost",
      "PE Uniform Cost",
      "Uniform Sizes",
      "Student Services"
    ]
  },
  {
    "id": "earist_institutional_uniform_components_list",
    "source": "Uniform Requirements List",
    "category": "Student Services - Uniform Policy",
    "topic": "Detailed Composition of Male and Female Institutional Uniforms",
    "content": "The official uniform guidelines for the Eulogio 'Amang' Rodriguez Institute of Science & Technology (EARIST) mandate specific components for the Institutional Uniform, differentiated by gender. \n\nFor the **Male Institutional Uniform**, the attire consists of a Maroon Short Sleeves Polo as the upper garment, paired with Beige Slacks as the lower garment. To ensure proper institutional identification, the uniform must include the Earist Logo Pin and the Earist Logo Patch. Furthermore, male students are required to wear the official College I.D. Lace and display their I.D. Card at all times.\n\nFor the **Female Institutional Uniform**, the requirements feature an inverted color scheme regarding the garments. Female students must wear a Beige Short Sleeves Blouse as the upper garment, paired with Maroon Slacks. Similar to the male requirements, the female uniform includes mandatory accessories: the Earist Logo Pin and the Earist Logo Patch. The standard requirement for student identification also applies, necessitating the use of the College I.D. Lace and the I.D. Card.\n\nIn summary, while both uniforms share the same mandatory accessories (Logo Pin, Logo Patch, I.D. Lace, and I.D. Card), the clothing components differ significantly in color and cut: males wear a maroon top with beige bottoms, whereas females wear a beige top with maroon bottoms.",
    "keywords": [
      "Male Uniform Components",
      "Female Uniform Components",
      "Maroon Polo",
      "Beige Slacks",
      "Beige Blouse",
      "Maroon Slacks",
      "Logo Pin",
      "ID Lace"
    ]
  },
  {
    "id": "campus_directory_buildings_and_offices",
    "source": "Student Handbook 2021",
    "category": "General Information - Campus Map",
    "topic": "Complete Office and College Directory by Building",
    "content": "This section outlines the complete Office Directory by Building within the EARIST campus. \n\n**Regala Building Directory**\nThe Regala Building primarily houses academic colleges. The College of Hospitality Management is located on the 1st Floor. The College of Public Administration and Criminology is situated on the 2nd Floor. The College of Education occupies the 3rd Floor.\n\n**Apilado Building Directory**\nThe Apilado Building is a hub for student and administrative services. The 1st Floor contains the Cash and Disbursement Services (Cashier's Office), the National Service Training Program Security Services, the Office of the Extension & External Affairs Services, the Office of the Student, Admission, Registration and Records Management Services, and the Counseling & Testing Service. The Mezzanine level houses the Information and Public Affairs Services, the Office of the Administrative Services, and the Office of the Property Management Services.\n\n**CEAFA Building Directory**\nThe CEAFA Building serves multiple colleges and medical services. The 1st Floor houses the Medical & Dental Services and the College of Engineering. The 2nd Floor contains additional rooms for the College of Engineering and the Office of the Commission of Audit. The 3rd Floor is dedicated to the College of Architecture and Fine Arts. The 4th and 5th Floors are occupied by the College of Engineering. The 6th Floor is designated for Physical Education, Sports Development & Athletic Services.\n\n**CIT Building Directory**\nThe CIT Building is the primary location for industrial technology studies. The College of Industrial Technology occupies the 1st Floor, 2nd Floor, 3rd Floor, and 4th Floor. The 2nd Floor also houses the Office of the Research Development and Production. The 5th Floor contains facilities for the College of Hospitality Management and the EARIST Hostel.\n\n**Library/ICT Building Directory**\nThis building focuses on information resources and technology. The EARIST Museum is on the 1st Floor. Library Services are located on both the 2nd and 3rd Floors. The 4th Floor houses the Office of the Management Information System and Technology Services .\n\n**Old Laboratory High School Building Directory**\nThe 1st Floor of the Old Laboratory High School Building houses Instruction Services, Assessment Services, and Property Management Services. The 2nd Floor contains the Office of the Vice President for Administration and Finance, the Office of the Vice President for Planning, Research, Extension and Production, the Office of the Management Internal Control and Audit Services, the Office of the Quality Assurance, and the Office of the Bids and Awards Committee.\n\n**Administration Building Directory**\nThe Administration Building houses executive and financial offices. The 1st Floor contains Financial Management Services and Human Resource. The 2nd Floor is the location of the Office of the President, the Office of the Planning Services, and the Institutional Infrastructure Planning and Development Office. The 3rd Floor houses the Office of the Records Services and the Office of the Vice President. The 4th Floor features the Amphi-Theater.\n\n**Nudas Building Directory**\nThe Nudas Building provides mixed-use facilities and academic spaces. The 1st Floor contains the Canteen and Motorpool and Transportation Services. The 2nd Floor houses the College of Business Administration. The 3rd Floor is occupied by the College of Education. The 4th Floor houses the College of Arts and Sciences.",
    "keywords": [
      "campus map",
      "office locations",
      "Cashier's Office",
      "Registrar",
      "Medical Dental",
      "College of Engineering",
      "College of Industrial Technology",
      "Library",
      "Regala",
      "Apilado",
      "CEAFA",
      "Nudas",
      "Administration Building"
    ]
  },
  {
    "id": "mis_portal_advisory_recovery_and_role",
    "source": "Student Advisory: Resolving Student Portal Issues",
    "category": "Management Information Services (MIS) Support",
    "topic": "Procedure for Password Recovery, Portal Assistance, and MIS Role",
    "content": "According to the Student Advisory titled 'Resolving Student Portal Issues' issued by the Management Information Services (MIS) Department, specific protocols are in place for EARIST students experiencing technical difficulties with their Student Portal. These difficulties encompass issues such as forgotten passwords, login errors, or missing data. \n\nRegarding the procedure for Password Recovery and Portal Assistance, the advisory mandates that students unable to access their portal must proceed directly to the Management Information Services (MIS) office for immediate assistance. The MIS office is physically located on the 4th Floor of the CCS (College of Computer Studies) Building. Students are instructed to approach the MIS Staff on duty, who are authorized to verify student identity and manually reset passwords or address specific queries regarding the portal. A critical requirement for this process is identity verification; students are strictly required to bring and present their valid Student ID and their current Registration Form (COR) before the staff can process any request.\n\nFurthermore, the advisory provides a comprehensive overview of the Management Information Services (MIS) to clarify why students are directed to this specific office. In the context of EARIST, the MIS is defined as the technical unit responsible for managing the institution's data, software systems, and digital infrastructure. It functions as the central hub where critical student data—including grades, class schedules, and personal information—intersects with the technology used to access it, specifically the Student Portal. Consequently, the MIS serves as the primary authority for resolving access issues related to these digital assets.",
    "keywords": [
      "MIS",
      "Management Information Services",
      "Student Portal",
      "password recovery",
      "login errors",
      "CCS Building",
      "College of Computer Studies",
      "4th Floor",
      "identity verification",
      "COR",
      "Registration Form",
      "technical support",
      "digital infrastructure",
      "student data",
      "reset password"
    ]
  }
]