[
  {
    "id": "sarms_overview_mission_governance_functions",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Organizational Structure & Mandate",
    "topic": "SARMS Mission, Vision, Objectives, and Governance",
    "content": "According to the Student Admission, Promotions, & Records Management Services (SARMS) Manual, the Office of the Registrar serves as the primary repository for all student records and acts as the main frontline service for curricular and academic matters. The SARMS mission is to provide academic and administrative support to instruction to enable the attainment of its educational mandate. Its vision is to become a completely automated office providing online services to its clientele. The SARMS commitment is characterized by being service-oriented, efficient, effective, clientele-friendly, honest, trustworthy, and possessing integrity.\n\nThe specific objectives of SARMS include selective admission, selective retention of students, efficient and effective management of student records, and providing Total Quality Service. The general functions of the office encompass student admission, registration, promotion and evaluation of student records, records management, curricular information dissemination, and graduation management.\n\n regarding governance, the President is the head of the Institute, with the Office of the Registrar under their direct supervision in coordination with the Vice-President for Academic Affairs and the Vice-President for Administration & Finance. The College Registrar (Registrar IV) serves as the head of the office and is designated as the Director of Admissions, Registrations, Promotions & Records Management Service. The Registrar is a member of both the Academic Council and the Administrative Council. Personnel under the Registrar include Academic and Non-Academic positions such as Registrar III, Registrar I, Instructors (I-III), Clerks (I-III), and utility workers.",
    "keywords": [
      "SARMS",
      "Office of the Registrar",
      "Mission",
      "Vision",
      "Objectives",
      "Governance",
      "Organizational Structure",
      "President",
      "Academic Council",
      "General Functions"
    ]
  },
  {
    "id": "college_registrar_functions_responsibilities",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Personnel Functions",
    "topic": "Functions and Responsibilities of the College Registrar",
    "content": "The Proposed Office of the Registrar Manual outlines the specific functions and responsibilities of the College Registrar. The College Registrar assists top administration in formulating and enforcing policies regarding admissions, enrollment, accreditation, graduation, and related academic matters. The Registrar plans and supervises the admission and selective retention of students, compliance with academic requirements, and the registration process. This role involves enforcing government regulations on scholarships, transferees, accreditation, student loading, subject sequence, cross-enrollment, and graduation honors.\n\nThe Registrar evaluates scholastic records for accreditation of transfer units and determines curricular levels and scholastic standing. They are responsible for the custody, security, integrity, and confidentiality of student records, as well as the management and issuance of academic records. Additional duties include disseminating information on curricular offerings and CHED issuances, orienting students on academic policies, and preparing statistical data on enrollment and graduates. The Registrar oversees the publication of the Academic Calendar and Bulletins, signs Transcripts of Records, resolves questions on academic policies, performs curricular consultations, and assists in revising the EARIST Code and Student Handbook.\n\nAdministratively, the Registrar maintains linkages with other Registrars, sets standard operating procedures, designs process flow charts, evaluates SARMS personnel performance, manages office property, and creates development plans. The Registrar also submits Annual Accomplishment Reports to the President, acts as Secretary of the Academic Council when designated, and serves as the primary contact person with CHED and the Bureau of Immigration.",
    "keywords": [
      "College Registrar",
      "Job Description",
      "Academic Policies",
      "Enrollment Supervision",
      "Record Custody",
      "Graduation",
      "Accreditation",
      "CHED Liaison",
      "Statistical Data",
      "Administrative Duties"
    ]
  },
  {
    "id": "admissions_and_college_records_personnel",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Personnel Functions",
    "topic": "Roles of Admissions and College Records Personnel",
    "content": "The SARMS Manual defines the specific duties for personnel In-charge of Admissions and personnel In-charge of Records/Evaluation (College). \n\nThe In-charge of Admissions prepares admission and enrollment paraphernalia, coordinates the enrollment of new students, and verifies the authenticity of submitted credentials. This role involves requesting Form 137A and the Official Transcript of Records (OTR) for newly admitted students, arranging and filing credentials before turnover to the records section, and serving as the liaison officer for foreign students. They are also responsible for preparing freshmen enrollment lists and statistics regarding transferees.\n\nThe In-charge of Records/Evaluation (College) is responsible for preparing individual student records, such as worksheets of consolidated grades, permanent records, and evaluation records. They coordinate student enrollment, post grades, update records regularly, and reconstruct lost files. A critical function of this role is advising students on curricular programs, subject loads, and sequences, as well as informing students of course deficiencies. They evaluate student records regarding curricular level, scholastic standing, and graduation eligibility, including the evaluation of credits earned in other schools. Furthermore, they assist in graduation activities, prepare lists of academic scholars and candidates for graduation (including honors), prepare statistical data for drop-outs and shifters, verify Transcripts of Records, and manage the follow-up of records from previous institutions while ensuring the integrity and confidentiality of all student files.",
    "keywords": [
      "Admissions Officer",
      "Records Officer",
      "Enrollment",
      "Credential Verification",
      "Student Evaluation",
      "Grades",
      "Transcript of Records",
      "Academic Advising",
      "Foreign Students",
      "Graduation Lists"
    ]
  },
  {
    "id": "secondary_records_requests_data_processing",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Personnel Functions",
    "topic": "Secondary Records, Requests, and Data Processing Roles",
    "content": "The SARMS Manual details the responsibilities for the In-charge of Secondary Records, the In-charge of Requests/Receiving/Releasing, and the In-charge of Data Processing.\n\nThe In-charge of Records (Secondary & Post-Secondary Special Courses) prepares and issues Form 137A and certifications for secondary students. They check entries on Form 138 and Form 18 at the end of the school year, assist in Secondary-Laboratory School graduation activities, and prepare enrollment lists and candidate lists for graduation. They are also responsible for the selection of honor students and the maintenance of all past and present secondary records.\n\nThe In-charge of Request, Receiving, and Releasing accommodates and processes requests for Transcripts of Records, certifications, and transfer credentials. This role requires maintaining logbooks for incoming and outgoing records, ensuring prompt compliance with requests, and classifying and storing active and inactive files to secure their integrity.\n\nThe In-charge of Data Processing is tasked with encoding data on course and subject codes, new student data, and student grades. They generate worksheets of consolidated grades, Transcripts of Records, certifications, and enrollment lists. This role assists in accomplishing survey forms and prepares all needed statistical data while ensuring the security and confidentiality of digital student records.",
    "keywords": [
      "Secondary Records",
      "High School Records",
      "Form 137A",
      "Document Release",
      "Data Processing",
      "Encoding",
      "Digital Records",
      "Transcript Requests",
      "Archive Management"
    ]
  },
  {
    "id": "sarms_office_location_layout_file_management",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Management",
    "topic": "Office Location, Layout, and File Arrangement Standards",
    "content": "According to the Office Management section of the SARMS Manual, the Office of the Registrar is physically located at the Student Center, specifically in the left wing of the Apilado Hall, fronting Nagtahan Street. The office occupies both the ground floor and the mezzanine. The ground floor houses the Request/Receiving/Releasing Section, the Evaluation Section for all colleges, the ID Section, and the Records Room for both graduated and active/inactive files. The mezzanine accommodates the SARMS Director/College Registrar's office, the Mini-SARMS Library/Research Room, the Data Processing Section, and the stockroom for supplies.\n\nThe manual mandates specific office layout standards: the working area must be spacious enough for employees, and service counters must be adequate to handle students from different colleges. Distinct rooms must be provided for inactive files, graduated files, and computers. Active files are required to be located in the immediate vicinity of the Evaluators. Furthermore, the office must maintain sufficient furniture, lighting, and ventilation. A 1:1 computer-to-personnel ratio is required, separate from servers used for data banking.\n\nRegarding File Arrangements, the manual classifies records into three categories with specific storage protocols. Active Files are arranged by College and alphabetized, located in the immediate vicinity of the concerned College In-charge. Inactive Files are alphabetized and stored on the Ground Floor. Graduated Files are alphabetized by College and by Year, also stored on the Ground Floor.",
    "keywords": [
      "Apilado Hall",
      "Office Layout",
      "File Storage",
      "Active Files",
      "Inactive Files",
      "Graduated Files",
      "SARMS Location"
    ]
  },
  {
    "id": "sarms_personnel_assignments_and_manpower",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Personnel",
    "topic": "Personnel Assignments, Ratios, and Proposed Manpower",
    "content": "The SARMS Manual outlines strict guidelines for Personnel Assignments and Manpower. A key operational standard is that the number of employees must be proportional to the student population, with a maximum ratio of one (1) personnel for every 500 students (1:500). Every staff member must have definite duties and responsibilities.\n\nSpecific personnel assignments are designated by role and college jurisdiction. The Registrar IV acts as the Director located on the mezzanine. The Registrar III serves as the Assistant Registrar In-charge of the Graduate School. The Evaluation and Promotions Section is led by a Registrar I. Specific Instructors and Clerks are detailed as Chiefs of sections such as Records, Documentation & Authentication, and Data Processing.\n\nCollege-specific records are managed by designated officers: The College of Engineering (BSCE, ECE, BSME, BSEE) is managed by the Chief of Records Section. The College of Industrial Technology (BSIT) is managed by an Instructor II. The College of Arts & Sciences is managed by the Chief of Documentation. The College of Business & Public Administration and Industrial Technology (BSHRM) are managed by a Clerk III. The College of Architecture and Engineering (BSCOE) fall under the Chief of Admission & Registration. Secondary Records (LHS) and the College of Education are managed by the Chief of Data Processing.\n\nTo address future needs, the manual proposes the creation of additional positions: Registrar V (University Registrar), Registrar II (Admission, Recruitment & Testing Officer), Credit Evaluator (Academic Rank Holder), Computer Programmer, Data Encoder, Computer-literate Records Clerk, and Regular Student Assistants.",
    "keywords": [
      "Staff to Student Ratio",
      "Registrar IV",
      "Personnel Roles",
      "College Assignments",
      "Manpower Needs",
      "Organizational Structure",
      "Job Creation"
    ]
  },
  {
    "id": "sarms_operating_procedures_security_safety",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Operations & Security",
    "topic": "Operating Procedures, Communication Protocols, and Records Security",
    "content": "The SARMS Manual establishes Operating Procedures regarding attendance, communications, and the safety of records. Personnel are required to be punctual, and office hours must be clearly posted for the public. Staff may be required to render honorarium services after regular hours to accommodate evening and working students. \n\nCommunication protocols dictate that the In-charge of Admission is responsible for receiving, sorting, and recording all incoming credentials and communications. Outgoing communications must be recorded with the name of the document, the recipient College/Office, the date, and the receiver's signature. Specific personnel are assigned to handle correspondence regarding curricular offerings and statistical data.\n\nSecurity and Safety standards are strictly enforced. Classified or confidential records (e.g., student academic records) cannot be accessed by unauthorized persons or taken out of the office. Unclassified records may only be borrowed with the Director's permission, provided the transaction is logged with the borrower's details. The storeroom and Computer Room are restricted areas. Only authorized personnel or Data Processing staff may access student records on computers. The manual recommends microfilming records for maximum security.\n\nFacilities maintenance requires that working areas and record rooms be free from fire hazards. Files must be treated with insecticides/pesticides occasionally. Record rooms must be temperature-controlled to preserve documents and equipment. Malfunctioning equipment must be reported immediately, and economy in the use of supplies is mandated.",
    "keywords": [
      "Confidentiality",
      "Office Hours",
      "Record Security",
      "Microfilm",
      "Fire Safety",
      "Data Access",
      "Communication Log"
    ]
  },
  {
    "id": "sarms_records_classification_and_jacket_contents",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Files and Records Management",
    "topic": "Classification of Records and Student Jacket Contents",
    "content": "According to the Files and Records Management section of the SARMS Manual, records at the Office of the Registrar are categorized into two distinct classifications: Strictly Confidential and Unclassified/Non-confidential.\n\nStrictly Confidential records refer to documents submitted pursuant to the school's special relationship with the student, intended solely for admission or promotion purposes. These include Academic reports, Adoption papers, Alien Certificate of Registration, Baptismal or Birth Certificates, Disciplinary Records, Medical and Guidance Reports, and Personal and Academic Records.\n\nUnclassified or Non-confidential records are those that must be made public to enable the State, students, and parents to assess the school's performance and legal existence. These include Course Approvals, Catalogues, Class/Faculty/Room Programs, Directory of Graduates, Enrollment Lists, Permits and Recognition, Prospectus, School Annuals, Statistical records, and Teaching Contracts.\n\nThe manual also specifies the required credentials to be filed in the individual Student Jacket. These documents include the Accreditation/Validation Form, Adding/Changing/Dropping Form, Admission Slip, Affidavits for name changes, and Applications for admission, graduation, shifting, or transfer. Furthermore, the jacket must contain approved permits for cross-enrollment, OJT, overload, subject substitution, and waivers. Essential academic records such as the Certificate of Transfer Credentials, Clearance/Completion forms, Schedule/Registration Forms, Form 138, Form 137-A, and Transcript of Records (TOR) must be included. Finally, machine copies of the ACR, Birth Certificate, and Marriage Contract, along with Notices of Deficiency, Permanent Records, photographs, and study permits for working/foreign students are mandatory inclusions.",
    "keywords": [
      "Confidential Records",
      "Student Jacket",
      "Form 137-A",
      "Form 138",
      "Unclassified Records",
      "Enrollment Documents",
      "Transcript of Records",
      "Record Classification"
    ]
  },
  {
    "id": "sarms_reference_files_and_filing_procedures",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Files and Records Management",
    "topic": "Reference Files (Sundry Matters) and Operating Procedures",
    "content": "The SARMS Manual outlines the maintenance of \"Sundry Matters\" or reference files and establishes specific Operating Procedures for filing systems and record control. \n\nReference files retained by the office include Annual/Monthly Accomplishment Reports, Annual Procurement Programs, Checklists/Prospectuses, Class/Faculty/Room Programs, and Commencement Programs. The office also maintains copies of CHED Basic Higher Education Data, CHED Memos/Orders, Civil Service Circulars, CSC PD 907, DBM Memo No. 71 (Head Count), and DBM/SUC Form 1A. Regarding student data, the office keeps Enrollment lists, Worksheets for Consolidated Grades, Grade Sheets, Lists of Academic Scholars, and Lists of Candidates for Graduation with honors. Governance documents such as Minutes of Academic Council Meetings, Official Communications, SARMS Memoranda, EARIST Circulars/Orders, the EARIST Code, Faculty Manual, and Student Handbook are also archived.\n\nThe Operating Procedure for file location dictates that Active/Current files must be stored in a separate cabinet in the immediate vicinity of the concerned College Evaluators. In-active (dropped) files and Graduated Files are located in the SARMS Ground Floor records room.\n\nThe Filing System and Control of Records mandates the use of an alphabetic file for students' permanent records to prevent displacement. Student records are kept in individual jackets, and great care must be taken to ensure papers are filed immediately upon receipt into the correct jacket. For digital records, the Student Number is used for encoding and accessing data in the computer system, managed by designated data processing personnel. Sundry matters are filed by subject and further classified by year or school year.",
    "keywords": [
      "Sundry Matters",
      "Filing System",
      "Active Files",
      "Inactive Files",
      "Alphabetical Filing",
      "Student Number",
      "Reference Materials",
      "CHED Memos",
      "Accomplishment Reports"
    ]
  },
  {
    "id": "sarms_workflow_registration_to_encoding",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Workflow: Pre-Registration, Admission, Registration, and Encoding",
    "content": "The General Workflow at the Office of the Registrar follows a structured process spanning Pre-Registration to Data Encoding.\n\nThe Pre-Registration phase involves the preparation and issuance of pre-enrollment forms and admission slips indicating deficiencies for old students. It includes the administration of the College Admission Test (ECAT) in coordination with the SSC, the analysis and dissemination of ECAT results to Deans, and the coordination of integrated school programs. This phase also covers the dissemination of the school calendar and enrollment procedures.\n\nThe Admission and Registration phases cover the processing of both old and new students. Following Registration is the Post-Registration phase, which involves sorting registration forms by College, Course, Major, Level, and Sex. This step leads to the preparation of Enrollment Lists and Statistics, and the creation of jackets for new student records.\n\nThe workflow continues with Filing, Sorting, and Arrangement, where entrance credentials and registration forms are filed into student jackets, and files for dropped or transferred students are sorted. The Student Records Preparation phase involves requesting Form 137-A for freshmen and Transcripts for transferees, encoding personal data, and recording currently enrolled subjects. Finally, the Posting and Encoding phase entails posting grades from grade sheets to permanent records and updating the computerized consolidated worksheets.",
    "keywords": [
      "Pre-Registration",
      "ECAT",
      "Enrollment Workflow",
      "Student Data Encoding",
      "Form 137-A Request",
      "Grade Posting",
      "Enrollment Statistics",
      "Admission Procedure"
    ]
  },
  {
    "id": "sarms_workflow_evaluation_graduation_issuance",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Workflow: Evaluation, Graduation, and Record Issuance",
    "content": "The SARMS Manual details the workflow for Student Evaluation, Graduation, and the Issuance of Academic Records. \n\nThe Evaluation phase focuses on reviewing student records for promotion to the next curriculum year. This involves identifying and disseminating information regarding student deficiencies and earned credits. Staff must advise students on subject pre-requisites, co-requisites, and mandated subjects. This phase also includes processing applications for graduation, selecting honor students, and preparing the List of Candidates for Graduation.\n\nThe Graduation phase formalizes the process. It involves presenting the Candidates for Graduation to the Local College Academic Council and the Institute Academic Council for approval. The list is then prepared for the President's approval and confirmation by the EARIST Board of Trustees. This phase also manages the preparation of PD 907 awardees and the holding of graduation rites.\n\nThe final workflow stage is the Preparation and Issuance of Requested Academic Records. This entails accommodating student requests and generating official documents, including Transcripts of Records for graduated and non-graduated students, certifications, and certificates of good moral character.",
    "keywords": [
      "Student Evaluation",
      "Graduation Requirements",
      "Academic Council",
      "Board of Trustees",
      "Honor Students",
      "Transcript Generation",
      "PD 907",
      "Record Issuance"
    ]
  },
  {
    "id": "sarms_admissions_credential_evaluation_verification",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Admissions & Records",
    "topic": "Admissions Procedures, Credential Evaluation, and Authenticity Verification",
    "content": "According to the SARMS Manual, the Admissions Unit is responsible for processing new freshmen, transferees, and foreign students in coordination with the various Colleges. The In-charge of Admissions coordinates the number of students and sections to be opened, processes entrance credentials, and informs students of incomplete requirements. This role specifically includes requesting Form 137-A for freshmen and Official Transcripts of Records (OTR) for transferees from previous institutions. For foreign students, the unit manages admission requirements and submits necessary reports to the Bureau of Immigration.\n\nThe manual outlines strict criteria for the Evaluation of Credentials. Documents considered invalid for registration include: transfer cards (F-138) not stating eligibility or unsigned by the Principal/Registrar; documents marked \"used for enrollment in another school\" or \"cancelled\"; credentials with alterations or erasures; diplomas (alone); and Transcripts marked \"For Evaluation Only\" or \"For Employment Purposes.\" Furthermore, credentials from private schools without government permit/recognition are invalid. The manual specifies verification techniques, such as using a magnifying glass or a light source to detect deceptive erasures. \n\nRegarding the Verification of Authenticity, the In-charge of Records must verify all hand-carried Transcripts of Records. This is achieved by sending a copy to the originating school for authentication or dispatching a SARMS liaison officer. For graduate students or those taking second degrees, Transcripts must contain the degree obtained, graduation date, and CHED Special Order Number (or Registry Order for accredited private schools).",
    "keywords": [
      "Admissions Unit",
      "Credential Evaluation",
      "Invalid Credentials",
      "Form 137-A",
      "Foreign Students",
      "Bureau of Immigration",
      "Transcript Verification",
      "F-138",
      "Document Authenticity"
    ]
  },
  {
    "id": "sarms_registration_enrollment_list_procedures",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Registration & Enrollment",
    "topic": "Registration Protocols, Student Requirements, and Enrollment List Generation",
    "content": "The SARMS Manual details the Registration and Enrollment protocols. The process is guided by an Enrollment Memorandum and the Academic Calendar. Colleges are responsible for enrolling their students and submitting reports to SARMS. Old students are required to present a complete set of class cards from the previous semester, the previous registration form, and a clearance. Graduating students must be provided with a Notice of Deficiencies.\n\nSpecific academic policies govern the enrollment process. Practice Teaching must not be taken with any other subjects to ensure total immersion (citing CMO No. 11, s. 1999). Advanced subjects cannot be enrolled by transferees unless prerequisites are validated. Scholastic delinquent students and academic scholars must adhere to their specific rules and contracts. Late submission of Registration Forms is prohibited unless permitted by the Dean of Student Affairs with necessary sanctions.\n\nFollowing registration, the manual outlines the Preparation of Enrollment Lists and Statistics. This process involves sorting Registration forms by College, Course, Major, Year, Section, and Sex. The Data Encoder consolidates this information to generate the official Enrollment List (alphabetically arranged) and Enrollment Statistics. The In-charge of Admissions verifies the list for Freshmen, while the In-charge of Records verifies lists for higher years. Students who fail to submit their Registration Forms to SARMS will not be included in the official list.",
    "keywords": [
      "Registration Procedure",
      "Enrollment List",
      "Class Cards",
      "Practice Teaching",
      "CMO No. 11 s. 1999",
      "Scholastic Delinquency",
      "Late Enrollment",
      "Data Encoder",
      "Enrollment Statistics"
    ]
  },
  {
    "id": "sarms_special_academic_requests_overload_cross_enrollment",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Academic Policies",
    "topic": "Special Academic Requests: Cross-Enrollment, Overloading, Waivers, and Substitution",
    "content": "The SARMS Manual establishes protocols for handling special academic requests, including Cross-Enrollment, Overloading, Waivers of Prerequisites, and Subject Substitution. Most of these requests require recommendation by the Dean, notation by the University Registrar, and approval by the VP for Academic Affairs.\n\n**Cross-Enrollment:** Allowed only if the student is graduating, and the subject is not a major subject, is not offered at the University, or belongs to an old curriculum. The maximum allowance is six (6) units.\n\n**Overloading:** Permitted only for graduating students with a maximum limit of twenty-eight (28) units. Overloading is strictly prohibited for delinquent students and Education students undergoing Practice Teaching. A student who fails an overloaded subject cannot overload in the subsequent semester.\n\n**Waiver of Prerequisite:** Students may enroll in a prerequisite and advanced subject simultaneously only if they are graduating and the prerequisite is a \"repeated subject\" (previously failed). If the prerequisite is failed again, the advanced subject is automatically invalidated.\n\n**Subject Substitution:** Allowed when a subject belongs to an old curriculum and is no longer offered. The substitute must have the same number of units and be allied to the required subject.\n\n**Sit-in and Tutorial Classes:** The University explicitly does not allow sit-in or tutorial classes.",
    "keywords": [
      "Cross-Enrollment",
      "Overloading",
      "Waiver of Prerequisite",
      "Subject Substitution",
      "Graduating Students",
      "Academic Load",
      "Tutorial Classes",
      "Sit-in Policy",
      "Unit Limits"
    ]
  },
  {
    "id": "sarms_authentication_falsification_certification_standards",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Authentication, Falsification, and Certification Standards",
    "content": "The SARMS Manual outlines strict protocols for the authentication of records and the prevention of falsification. Students may request the authentication of their records, where the In-charge of Requests counterchecks the document's authenticity. A \"CERTIFIED TRUE COPY OF THE ORIGINAL\" remark is indicated on machine copies, initialed by the In-charge, and signed by the Registrar upon payment of fees. A separate Certificate of Authentication can also be requested. \n\nFalsification of credentials, documents, or records via alteration, erasure, or forgery is classified as a criminal act punishable under the Revised Penal Code. An EARIST student found falsifying academic records is immediately reported to the Office of Student Affairs for disciplinary sanctions. The office also responds immediately to verification requests from the Civil Service Commission and other agencies.\n\n regarding the production of Certifications, the manual mandates the use of standard forms with uniform headings, formats, and paper sizes. All certifications must bear the feature \"verified correct\" signed by the Records In-charge/Evaluator. The Registrar is authorized to sign only those certifications that are in order. Certifications not produced by the SARMS office will not be entertained for signing or sealing.",
    "keywords": [
      "Authentication of Records",
      "Certified True Copy",
      "Falsification",
      "Revised Penal Code",
      "Disciplinary Sanctions",
      "Certification Format",
      "Verification"
    ]
  },
  {
    "id": "sarms_transcript_of_records_production_standards",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Production",
    "topic": "Production Standards for Transcript of Records (OTR)",
    "content": "The SARMS Manual establishes detailed standards for the production of the Official Transcript of Records (OTR). The OTR must use official paper with a uniform format and include a control number and release date. The student's name on the OTR must be identical to the name on their submitted birth certificate, with strict attention to spacing, hyphenation, and symbols. The name must be consistent across all pages.\n\nThe OTR must contain comprehensive entrance data: course, degree, admission date, birth date, and previous school attended. For transferees, the former school must be indicated. For Graduate Program students, the entrance data must include the degree obtained, school name, and Special Order (SO) Number or Registry Number.\n\nGrading entries on the OTR must be complete; the course, descriptive title, units, and grades must be clearly printed. Crucially, failure and incomplete grades must be indicated even if the subject was repeated and passed. Dropped subjects must also be listed. The document must be free of alterations or erasures; if an erasure is necessary, it must be signed by the Registrar. For graduated students, the OTR must state the degree obtained, graduation date, and honors received. The final document requires the signatures of the preparer, the verifier, and the Registrar, along with the school seal and a cancelled documentary stamp.",
    "keywords": [
      "Transcript of Records",
      "OTR",
      "Grading System",
      "Student Records",
      "Special Order Number",
      "Academic History",
      "School Seal",
      "Documentary Stamp"
    ]
  },
  {
    "id": "sarms_request_release_procedures_records",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Operational Procedures",
    "topic": "Procedures for Request and Release of Academic Records",
    "content": "The operational procedures for requesting and releasing academic records mandate that students must make requests personally or through an authorized proxy. Requests from other schools for Form 137A or Transcripts based on transfer certificates are prioritized as a matter of courtesy. However, requests for a second copy of a record previously sent to another school are not honored; the student is referred to the recipient school.\n\nFor the release of records, academic documents are sent directly to the requesting school in a sealed envelope signed by the Registrar. They cannot be entrusted to the student unless specifically authorized to hand-carry. The manual prohibits the use of remarks such as \"For Enrollment Purposes,\" \"For Miscellaneous Purposes,\" or \"For General Purposes.\" Valid remarks include \"For Employment Purposes\" or \"For Records Purposes.\"\n\nIn cases of errors, such as omitted subjects or typographical mistakes, the office issues a certification of correction or supplement. The standard release timeline is three (3) days for certifications and two (2) weeks for transcripts. A \"fast lane\" option is available for a higher fee. All releases are logged in a Record Book containing the control number and the name of the preparing personnel.",
    "keywords": [
      "Record Release",
      "Proxy Request",
      "Sealed Envelope",
      "Processing Time",
      "Fast Lane",
      "Correction of Records",
      "Authorized Remarks"
    ]
  },
  {
    "id": "sarms_specific_credentials_diplomas_stakeholder_rights",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Issuance & Legal Rights",
    "topic": "Issuance of Form 137A, Transfer Credentials, Diplomas, and Stakeholder Rights",
    "content": "The SARMS Manual dictates specific rules for high-value credentials. Form 137A is issued only once to a requesting school for admission purposes. Transfer Credentials are also issued only once to students wishing to transfer; if the student returns to EARIST without using it, the credential must be surrendered. Issuance requires a completed clearance and payment of fees. Transfer Credentials must always include a copy of grades.\n\nDiplomas are issued only once during Commencement Exercises and are signed by the President, College Dean, and Registrar. No diploma or transcript is issued to a student who has not been cleared of all accountabilities. In the event of a lost diploma, a second copy is never issued. Instead, a certificate of graduation is provided. A machine copy of the diploma may be certified if the student executes a notarized affidavit of loss.\n\nRegarding Stakeholder Rights, the manual cites the Education Act of 1982. Parents have the right to access official records relating to their children. Students enjoy the right to access their own school records, which the school must keep confidential, and the right to the issuance of official documents within thirty days of a request. Proxies claiming records must present written authority from the student.",
    "keywords": [
      "Form 137A",
      "Transfer Credential",
      "Diploma",
      "Affidavit of Loss",
      "Education Act of 1982",
      "Student Rights",
      "Parental Rights",
      "Clearance"
    ]
  }
]