[
  {
    "id": "earist_handbook_2021_history_legal_basis",
    "source": "Student Handbook 2021",
    "category": "Institutional Background",
    "topic": "History, Legal Basis, and Campus Development",
    "content": "According to the EARIST Student Handbook 2021, the Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST) was established following the liberation of Manila in 1945. It began as a Vocational High School located on the second floor of Mapa High School with nine teachers, 147 students, and Mr. Pantaleon Regala as principal. The institution was originally named Eulogio Rodriguez Vocational High School (ERVHS). On July 1, 1946, the school acquired its present site in Nagtahan, Sampaloc, Manila. \n\nThe institute's evolution is defined by specific legislative acts. Republic Act No. 4072 (1964) authorized the establishment of a Technical Education Department. Republic Act No. 5088 (1967) renamed the institution to Eulogio \"Amang\" Rodriguez Memorial School of Arts and Trades (EARMSAT) and separated it from the Division of City Schools, Manila. Republic Act No. 6595 (1972) converted EARMSAT into EARIST, granting it full-fledged college status and authorizing vocational-technical branches in Manila's congressional districts. Finally, Presidential Decree No. 1524, signed on June 11, 1978, converted EARIST into a Chartered State College governed by a Board of Trustees. Dr. Hilario G. Nudas served as the first College President. Subsequent presidents included Dr. Frederick So Pada, Dr. Lydia M. Profeta, Dr. Arturo P. Casuga, Dr. Maura V. Bautista, and Dr. Eduardo S. Caillo. As of the 2021 Handbook, the 7th President is Dr. Editha V. Pillo.\n\nThe Handbook also details the history of the EARIST Cavite Campus (General Mariano Alvarez, Cavite). Established as EARIST-GASAT via Board Resolution No. 007-82 on March 24, 1982, it was funded through EARIST's budgetary allotment. Significant developments include the acquisition of a 31,282 square meter lot donated by the National Housing Authority in 1983 and the groundbreaking of the main building in 1990 under Dr. Lydia Macaraig Profeta. Infrastructure projects from 1989 to 1999 were funded by congressional insertions from Congressman Renato P. Dragon. The campus includes a Multi-Purpose Sports Complex Gymnasium completed in 1999.",
    "keywords": [
      "history",
      "Republic Act 4072",
      "Republic Act 5088",
      "Republic Act 6595",
      "Presidential Decree 1524",
      "EARMSAT",
      "Cavite Campus",
      "GASAT",
      "Board of Trustees",
      "charter"
    ]
  },
  {
    "id": "earist_handbook_2021_vmgo_accreditation",
    "source": "Student Handbook 2021",
    "category": "Strategic Framework",
    "topic": "Vision, Mission, Goals, Objectives, and Accreditation Status",
    "content": "The EARIST Student Handbook 2021 outlines the institution's strategic direction through its Vision, Mission, Goal, and Objectives statements. \n\nThe Vision states that EARIST is envisioned to be a center of excellence in trades, business, arts, science, and technology education. \n\nThe Mission mandates the institution to turn out vocationally, technically, technologically, and scientifically trained graduates who will be economically productive, self-sufficient, effective, responsible, and disciplined citizens of the Philippines. \n\nThe institutional Goal is to provide professional, scientific, technological, technical, and vocational instruction and training in trades, business, arts, sciences, and technology. It also aims to promote research, advanced studies, and progressive leadership in these fields, in accordance with Section 2 of RA 6595 and Section 6 of PD 1524. \n\nThe Objectives of EARIST are to: strive for academic excellence in instruction, research, extension, and production through accreditation; provide appropriate and continuing faculty and staff development programs; provide and maintain appropriate technologies, instructional facilities, materials, and equipment; produce quality graduates who are globally competitive to man the needs of business and industry; and attain university status through unity, solidarity, and teamwork. \n\nRegarding its academic status, EARIST is classified as a Comprehensive Teaching and Baccalaureate University Level II and a Graduate Capable HEI Level III based on the Carnegie 2003 Classification Evaluation. The institution has been awarded Level II Status in fourteen degrees programs by the Accrediting Agency of Chartered Colleges and Universities in the Philippines (AACCUP) and is rated SUC Level II based on the CHED-DBM-PASUC Leveling Evaluation.",
    "keywords": [
      "vision",
      "mission",
      "goals",
      "objectives",
      "VMGO",
      "accreditation",
      "Level II",
      "AACCUP",
      "SUC Level",
      "academic excellence"
    ]
  },
  {
    "id": "earist_handbook_2021_curricular_offerings_comprehensive",
    "source": "Student Handbook 2021",
    "category": "Academic Policies",
    "topic": "Complete Curricular Offerings (Main and Cavite Campuses)",
    "content": "The EARIST Student Handbook 2021 details the complete curricular offerings for both the Main Campus and the Cavite Campus. \n\n**Main Campus Offerings by College:**\n\n* **College of Architecture and Fine Arts (CAFA):** Bachelor of Science in Architecture (BS ARCHI), Bachelor of Science in Interior Design (BSID), and Bachelor of Fine Arts (BFA) with majors in Painting or Visual Communication.\n* **College of Arts and Sciences (CAS):** Bachelor of Science in Applied Physics with Computer Science Emphasis (BSAP), Bachelor of Science in Computer Science (BSCS), Bachelor of Science in Information Technology (BS INFO. TECH.), Bachelor of Science in Psychology (BSPSYCH), and Bachelor of Science in Mathematics (BSMATH).\n* **College of Business and Public Administration (CBPA):** Bachelor of Science in Office Administration (BSOA), Bachelor of Science in Business Administration (Majors: Human Resource Management, Marketing Management), Bachelor of Science in Entrepreneurship (BSEntrep), and Bachelor in Public Administration (BPA).\n* **College of Education (CED):** Bachelor in Secondary Education (BSE) (Majors: Filipino, Mathematics, Science), Bachelor of Technology and Livelihood Education (BTLEd) (Majors: Home Economics, Industrial Arts), Bachelor of Special Needs Education (BSNEd), and Professional Education Subjects (TCP - 18 units).\n* **College of Engineering (CEN):** Bachelor of Science in Chemical Engineering (BSChE), Civil Engineering (BSCE), Electrical Engineering (BSEE), Electronics and Communication Engineering (BSECE), Mechanical Engineering (BSME), and Computer Engineering (BSCoE).\n* **College of Hospitality and Tourism Management (CHTM):** Bachelor of Science in Tourism Management (BST) and Hospitality Management (BSHM).\n* **College of Industrial Technology (CIT):** Bachelor of Science in Industrial Technology (BSIT) with majors in Automotive Technology, Electrical Technology, Electronics Technology, Food Technology, Fashion Apparel Technology, Industrial Chemistry, Drafting Technology, Machine Shop Technology, and Refrigeration and Air-conditioning.\n* **College of Criminal Justice Education:** Bachelor of Science in Criminology (BSCrim).\n* **Graduate School:** Master of Science in Mathematics, Master of Arts in Industrial Psychology, Master in Business Administration, Master in Public Administration, Master of Arts in Industrial Education (Major: Hotel Management), Master of Arts in Education (Majors: Administration and Supervision, Guidance & Counseling, Special Education), Master of Arts in Teaching (Majors: Electronics Technology, Mathematics, Science), Doctor of Philosophy in Industrial Psychology, Doctor of Education in Educational Management, Doctor in Business Administration, and Doctor in Public Administration.\n\n**EARIST Cavite Campus Offerings:**\n\n* **Graduate Program:** Doctor in Education (Major: Educational Management), Master of Arts in Education (Major: Administration and Supervision), and Master in Business Administration.\n* **Post Baccalaureate:** Professional Education Subjects (18 units).\n* **Undergraduate Program:** Bachelor of Science in Business Administration (Major: Marketing Management), Bachelor of Science in Computer Science, Bachelor of Science in Computer Technology, Bachelor of Science in Criminology, Bachelor of Science in Hospitality Management, Bachelor of Science in Office Administration, Bachelor of Science in Industrial Psychology, Bachelor of Technology and Livelihood Education, and Bachelor of Science in Industrial Technology (Majors: Automotive, Electrical, Electronics, Food Technology, Drafting Technology).",
    "keywords": [
      "curricular offerings",
      "degree programs",
      "majors",
      "courses",
      "Main Campus",
      "Cavite Campus",
      "Graduate School",
      "bachelor degrees",
      "master degrees",
      "doctorate degrees"
    ]
  },
  {
    "id": "earist_handbook_2021_admission_policy_requirements",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "General Admission Policy, Qualifications, and Documentary Requirements",
    "content": "Under Article I Admission Policy of the EARIST Student Handbook 2021, the admission of all students is primarily based on academic preparedness. This includes results of entrance examinations, personal interviews, academic records, character evaluation, the ability to benefit from academic programs, and willingness to abide by Institute rules. The admission of freshmen and transferees operates on a first-come-first-served basis, subject to resource availability such as rooms and faculty.\n\nRegarding Admission Qualifications for Local Students, EARIST accepts Freshmen who are Grade 12 graduates (per CMO No. 105, s. 2017) or Senior High School Alternative Learning System (ALS) Accreditation and Equivalency passers. Transferees are eligible depending on slot availability in the chosen program, provided they preferably have no grades of \"Dropped,\" \"Incomplete,\" or \"Failed.\"\n\nForeign students who graduated from high schools abroad and have not enrolled in international Higher Education Institutions (HEIs) are also eligible under CHED CMO internalization.\n\nThe specific Documentary Requirements for Admission are divided by applicant type. \n\nFor Freshmen, the requirements include:\n1. Form 138 (Senior and High School Report Card).\n2. Certificate of Good Moral Character with the school seal.\n3. PSA Authenticated Birth Certificate.\n4. EARISTCAT (College Admission Test) Result.\n5. Satisfactory Result of the Dean's Assessment and Evaluation.\n6. Medical and Health Examination results.\n\nFor Transferees, the requirements include:\n1. Transcript of Records or Certification of Grades.\n2. Certification of Good Moral Character.\n3. Satisfactory Result of the Dean's Assessment and Evaluation.\n4. Recommendation from the Dean or Guidance Counselor of the previous school.\n5. Transfer Credential or Honorable Dismissal.\n6. EARISTCAT result.\n7. Medical and Health Examination results.\n\nFor Foreign Students (graduated abroad, not enrolled in international HEIs), the additional requirements are a notarized affidavit of support, proof of adequate financial support, and an Equivalent High School Diploma.",
    "keywords": [
      "admission requirements",
      "freshmen",
      "transferees",
      "foreign students",
      "documents",
      "Form 138",
      "Good Moral Character",
      "medical exam",
      "qualifications"
    ]
  },
  {
    "id": "earist_handbook_2021_screening_process_levels",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "The Three-Level Screening Process (EARISTCAT, Interview, PPT)",
    "content": "Under Article I Admission Policy, the EARIST Student Handbook 2021 mandates a three-level screening process for applicants.\n\nScreening Level 1 is the EARIST College Admission Test (EARISTCAT). Applications are processed by the Office of Student Admission, Registration and Records Management Services (SARRMS). The test is administered by the Guidance and Counselling Office of the Student Affairs Services (SAS) in coordination with Management Information System and Technology Services (MISTS). The transmutation formula for EARISTCAT scores is: EARISTCAT Rating = (Total Score x 50 / No. Of Items) + 50.\n\nScreening Level 2 is the College Admission Interview. This interview helps the institution assess the candidate's leadership potential, determination, perseverance, career choice, and communication skills. The interviewer is the chairperson or a faculty member of the program applied for. For Architecture and Fine Arts applicants, a Drawing Ability Test (DAT) is conducted as part of this level. Each college defines its own evaluation rubric, and the interviewer's evaluation is final and unappealable.\n\nScreening Level 3 is the Program Preparedness Test (PPT). These are placement examinations designed to assess competency in specific skills or disciplines. The PPT is required for the following programs: BS Architecture, BS Applied Physics, BS Mathematics, BS Computer Science, BS Information Technology, BS Psychology, BS Civil Engineering, BS Chemical Engineering, BS Computer Engineering, BS Electronics and Communications Engineering, BS Electrical Engineering, and BS Mechanical Engineering.\n\nStudents who score lower than the pre-determined cut-off in the PPT may be conditionally admitted. These conditionally admitted students must undergo an Enhancement Program, requiring them to enroll in and pass one to two enhancement courses during their first year. The Handbook specifies that applicants who do not meet the score requirements for their first-choice program will be advised to apply for their second choice.",
    "keywords": [
      "screening process",
      "EARISTCAT",
      "interview",
      "Program Preparedness Test",
      "PPT",
      "enhancement program",
      "conditional admission",
      "Drawing Ability Test"
    ]
  },
  {
    "id": "earist_handbook_2021_program_cutoff_scores",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "Program Preparedness Test Cut-Off Scores and Retention Categories",
    "content": "Under Article I Admission Policy, Section A (Screening Level 3), the EARIST Student Handbook 2021 establishes specific cut-off scores for admission, waitlisting, and realignment across various colleges. \n\nFor the College of Architecture and Fine Arts (CAFA): \n- BS Architecture, BS Interior Design (BSID), and Bachelor of Fine Arts (BFA) all require 70.00% or better for Admission. Scores between 50.00% – 69.99% are Waitlisted. Scores lower than 50.00% are for Realignment.\n\nFor the College of Arts and Sciences (CAS):\n- BS Applied Physics (BSAP) and BS Mathematics: 60.00% or better for Admission; 50.00% – 59.99% Waitlisted; lower than 50.00% Realignment.\n- BS Computer Science (BSCS): 75.00% or better for Admission; 70.00% – 74.99% Waitlisted; lower than 70.00% Realignment.\n- BS InfoTech: 75.00% or better for Admission; 70.00% – 74.99% Waitlisted; lower than 70.00% Realignment.\n- BS Psychology: 77.00% or better for Admission; 73.00% – 76.99% Waitlisted; lower than 73.00% Realignment.\n\nFor the College of Business (CBA/CBPA):\n- BSOA, BSBA, and BSEM all require 55.00% or better for Admission. Scores between 50.00% – 54.99% are Waitlisted. Scores lower than 50.00% are for Realignment.\n\nFor the College of Education (CED):\n- BSEEd and BSSE: 80.00% or better for Admission; 50.00% – 79.99% Waitlisted; lower than 50.00% Realignment.\n\nFor the College of Engineering (CEN):\n- BS Civil Engineering (BSCE), BS Chemical Engineering (BSChE), BS Computer Engineering (BSCoE), BS Electrical Engineering (BSEE), BS Mechanical Engineering (BSME), and BS Electronics Engineering (BSECE) all require 85.00% or better for Admission. Scores between 50.00% – 79.99% are Waitlisted. Scores lower than 50.00% are for Realignment.\n\nFor the College of Hospitality and Tourism Management (CHTM):\n- BS Tourism (BST) and BS Hospitality Management (BSHM): 70.00% or better for Admission; 50.00% – 69.99% Waitlisted; lower than 50.00% Realignment.\n\nFor the College of Industrial Technology (CIT):\n- BS Industrial Technology (BSIT): 50.00% or better for Admission; 45.00% – 49.99% Waitlisted; lower than 45.00% Realignment.\n\nFor the College of Criminal Justice Education (CPAC / CCJE):\n- BS Criminology and BPA: 75.00% or better for Admission; 65.00% – 74.99% Waitlisted; lower than 65.00% Realignment.\n\nLegal Protection Clause: An applicant who meets the minimum admission requirements cannot be deferred by the Institute for reasons of handicap or disability (RA 7277; RA 9442) or for belonging to Indigenous Cultural Communities/Indigenous Peoples (RA 8371).",
    "keywords": [
      "cut-off scores",
      "passing rates",
      "waitlist",
      "realignment",
      "engineering admission",
      "CAFA",
      "CAS",
      "CBPA",
      "CED",
      "CEN",
      "CHTM",
      "CIT",
      "CCJE",
      "indigenous peoples rights",
      "disability rights"
    ]
  },
  {
    "id": "earist_handbook_2021_transferees_pledge_readmission",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "Policies for Transferees, Student Pledge, and Re-Admission",
    "content": "Under Article I Admission Policy, specific guidelines govern the admission of transferees, the student pledge, and re-admission procedures.\n\nTransferees may be admitted depending on the availability of slots, provided they meet all academic and admission requirements. Courses taken from a previous school may be credited upon submission of the Official Transcript of Records, subject to evaluation by the Department Chairperson and the Registrar's Office. Transferees may be advised to use either the old or the new curriculum based on their credited courses. If a student follows the old curriculum, they do not need to take the Bridging Program for Lifelong Learners. However, if a student follows the new curriculum, they are required to enroll in and pass additional general education subjects identified in the Bridging Program for Lifelong Learners.\n\nUpon admission, every student must sign the student's pledge and waiver of data privacy. Refusal to sign or violation of its terms is sufficient cause for denial of admission or dismissal.\n\nFor the Re-Admission of students who wish to continue their program after a Leave of Absence (LOA), the following documents are required:\n1. A copy of the Approved Leave of Absence.\n2. An Evaluation Record Form from the Registrar's Office.\n3. An Admission Recommendation from the College Dean.",
    "keywords": [
      "transferees",
      "crediting of courses",
      "bridging program",
      "old curriculum",
      "new curriculum",
      "student pledge",
      "data privacy waiver",
      "re-admission",
      "leave of absence"
    ]
  },
  {
    "id": "earist_handbook_2021_enrollment_load_substitution",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Registration, Academic Load, and Substitution of Courses",
    "content": "Under Article II Academic Policies, the EARIST Student Handbook 2021 establishes strict procedures for registration, academic loading, and course adjustments. \n\n**Registration and Cross-Enrollment**\nA student must be officially registered to receive credit. The registration procedure involves the issuance of a Notice of Admission, submission of requirements to the Registrar, pre-enrollment, fee validation, payment, and validation of the Certificate of Registration. Registration must occur within the period specified in the school calendar, with a maximum extension of two weeks under justifiable circumstances approved by the VP for Academic Affairs. Students cannot enroll in more than one college to earn two degrees simultaneously. Cross-enrollment to another school requires the Dean's endorsement and is limited to six (6) units, provided the subject is not offered at EARIST. Conversely, cross-enrollees from other institutions require written permission from their originating Registrar.\n\n**Academic Load**\nStudents must carry the regular load prescribed by their curricular program. Carrying less than a full load is only permitted if the student has academic deficiencies, is graduating, or if required courses are unavailable. Overloading is generally prohibited but may be allowed up to a maximum of 6 units during a regular semester if the subjects are back courses or have no pre-requisites, subject to approval by the Dean and VP for Academic Affairs. For intersession classes, the regular load is 6 units, with a permissible addition of 3 units for back courses. The Institute does not accept applications for a second baccalaureate degree.\n\n**Changing, Dropping, and Substituting Courses**\nStudents may apply to change classes (subject or schedule) using the College Advisement Slip in cases of schedule conflict, dissolved subjects, or enrollment errors. Substitution of courses is authorized if the old curriculum is superseded or if a required course is not offered. Substituted courses must be aligned in content and have the same or higher number of units. Substitution is not allowed for major courses the student has failed, nor for mandated courses. Dropping a course requires filling out SARRMS Form No. 007. All forms for substitution, adding, changing, or dropping must be submitted during the adjustment period specified in the school calendar.",
    "keywords": [
      "registration procedure",
      "cross-enrollment",
      "academic load",
      "overload",
      "substitution",
      "dropping subjects",
      "SARRMS Form 007",
      "intersession load"
    ]
  },
  {
    "id": "earist_handbook_2021_student_classification_attendance",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Student Classification, Shifting, and Attendance Rules",
    "content": "Under Article II Academic Policies, the EARIST Student Handbook 2021 classifies students by admission status, academic load, and year level, while establishing strict attendance protocols.\n\n**Classification of Students**\n* **By Admission Status:** Includes Beginning Freshmen (admitted via EARIST-CAT), Returning Students (Returnees), Shifting Students (Shifters), and Transferring Students (Transferees). Shifters within the same college must submit a letter of justification. Shifters moving to a different college must submit a recommended letter and a Clearance of good moral standing. Transferees from EARIST Cavite or other schools are admitted based on slot availability and evaluation of transcripts.\n* **By Academic Load:** Regular students carry the full load; Irregular students carry less than the full load; Special students do not earn formal academic credits.\n* **By Year Level:** Freshmen (First Year or <25% of units), Sophomores (2nd Year or 25-50% of units), Juniors (3rd Year or 50-75% of units), and Seniors (4th Year or >75% of units). In 5-year programs (Engineering/Architecture), a student is a \"Fifth\" year student until completing 80% of requirements.\n* **Special Needs:** The Institute provides modified facilities for students with visual, hearing, or orthopedic impairments in compliance with the Accessibility Law (Batas Pambansa Bilang 344).\n\n**Attendance Policies**\nAttendance is mandatory from the first class meeting. Absences are calculated based on class duration. A student is considered absent if they are not present within the first 1/6th of the scheduled time (e.g., after 30 minutes in a 3-hour class, or 10 minutes in a 1-hour class). Tardiness occurs if a student arrives within that first 1/6th fraction; three incidences of tardiness equal one absence. \n\nExcused absences require an excuse slip from the College Dean or a medical certificate verified by the Institute Medical Officer. Three successive unexcused absences result in a report to the Prefect of Discipline. Crucially, a student who is absent for more than 20% of the scheduled hours in a subject for the semester shall be automatically dropped from the class roll.",
    "keywords": [
      "student classification",
      "freshmen",
      "sophomore",
      "junior",
      "senior",
      "shifters",
      "transferees",
      "attendance policy",
      "tardiness",
      "excessive absences",
      "PWD",
      "special needs"
    ]
  },
  {
    "id": "earist_handbook_2021_grading_system_rectification",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Grading System, Incompletes, and Rectification of Grades",
    "content": "Under Article II Academic Policies, the EARIST Student Handbook 2021 defines the Grading System and the procedures for handling Incomplete grades and grade rectification.\n\n**Grading Scale**\nAcademic performance is graded using a numerical system:\n* **1.00 (97-100):** Highly Excellent\n* **1.25 (94-96):** Excellent\n* **1.50 (91-93):** Very Superior\n* **1.75 (88-90):** Superior\n* **2.00 (85-87):** Very Good\n* **2.25 (82-84):** Good\n* **2.50 (79-81):** Satisfactory\n* **2.75 (76-78):** Fair\n* **3.00 (75):** Passed\n* **5.00 (Below 75):** Failed\n* **INC:** Incomplete (Temporary grade due to illness or uncontrollable reasons)\n* **DRP:** Dropped (Officially or Unofficially)\n* **NC:** No Credit\n\n**Incomplete (INC) and Dropped Grades**\nAn \"INC\" grade must be completed within the next two semesters using SARRMS Form No. 006. If not completed within this period, the grade automatically becomes \"5.0\" (Failed). Completion of INC grades is free of charge. If the faculty member is unavailable (retired, resigned, unresponsive, or deceased), the Area Chairperson may act on the grade with the Dean's approval. A \"Dropped\" status is given if a student voluntarily withdraws at least two weeks before mid-terms or exceeds the allowable absences. \"No Credit\" (NC) is reserved for OJT, Thesis, or Special students.\n\n**Rectification of Grades**\nStudents cannot retake an examination to improve a passing grade. However, grades can be changed if a teacher made a calculation or recording error. \n1.  **Rectification Period:** Faculty can amend grades without a paper trail within 5 days after the posting deadline.\n2.  **Petition Process:** For changes requested 6 to 10 days after the deadline, a \"Petition Form for Rectification of Grade\" is required, accompanied by an affidavit, class record, and report of grades. This passes through the Department Head, Dean, VP for Academic Affairs, and finally the Institute President.\n3.  **Late Petitions:** Petitions filed after 10 days are handled by the Committee on Rectification of Grades, chaired by the Director of Instruction Services.",
    "keywords": [
      "grading system",
      "grading scale",
      "incomplete grade",
      "INC removal",
      "rectification of grades",
      "change of grade",
      "SARRMS Form 006"
    ]
  },
  {
    "id": "earist_handbook_2021_retention_tenure_scholastic_delinquency",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Retention, Tenure, Scholastic Delinquency, and Leave of Absence",
    "content": "Under Article II Academic Policies, the EARIST Student Handbook 2021 enforces strict Retention Policies, Tenure limits, and rules regarding Scholastic Delinquency and Leave of Absence.\n\n**Scholastic Delinquency and Retention**\nThe Institute dismisses students with unsatisfactory performance. \n* **Warning:** A student with a failing grade receives a warning and a load reduction. A student with 5.00 grades in three courses (accumulated or otherwise) is warned. \n* **Probation:** Freshmen failing 3 or more courses (or 1/2 their load) in the first semester are placed on probation. Any student accumulating 5 failing grades is placed on probation. Probation is lifted if the student passes all subjects the following semester. Students can only be on probation twice; inability to lift the second probation renders them ineligible for enrollment.\n* **Dismissal/Non-Readmission:** Old students (except seniors) with 3 or more failures in a semester, or 5 cumulative dropped subjects, will not be readmitted. Students who fail or withdraw from the same course three times are dropped from the roll. \n* **Permanent Disqualification:** A student who obtains final grades of \"5.00\" in more than 75% of their enrolled academic units is permanently disqualified from the Institute. If the failure rate is between 40%-75%, they are dropped from their specific College.\n\n**Tenure and Residency**\n* **Regular Students:** Must finish the program within the prescribed years plus a grace period of two semesters (1 year).\n* **Working Students:** Allowed a period equivalent to 1.5 times the normal length of the program.\n* **Athletics Scholars:** Allowed 5 years for a 4-year degree, or 6 years for a 5-year degree, plus a 1-year grace period.\n\n**Leave of Absence (LOA) and Honorable Dismissal**\nStudents may apply for an LOA for non-academic/non-disciplinary reasons, normally not exceeding one academic year. An approved LOA stops the tenure clock (unless it is unofficial). Leaves beyond two years result in loss of residency status. Studying in another school during an LOA is prohibited. Honorable Dismissal is issued to students voluntarily withdrawing to transfer to another school; those issued Honorable Dismissal shall not be readmitted to EARIST.",
    "keywords": [
      "retention policy",
      "probation",
      "dismissal",
      "tenure",
      "maximum residency",
      "leave of absence",
      "LOA",
      "honorable dismissal",
      "scholastic delinquency",
      "working students"
    ]
  },
  {
    "id": "earist_handbook_2021_graduation_honors_ojt",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Graduation Requirements, Honors, and OJT Guidelines",
    "content": "Under Article II Academic Policies, the EARIST Student Handbook 2021 outlines the requirements for Graduation, graduating with Honors, and On-the-Job Training (OJT).\n\n**Graduation Requirements**\nA candidate must file an application for graduation and satisfy all academic and institutional requirements. Transfer students must earn more than 50% of their academic units at EARIST to be eligible for graduation. All deficiencies must be cleared by the date specified in the academic calendar. Diplomas and transcripts are withheld until all accountabilities are cleared.\n\n**Graduation with Honors**\nStudents completing their baccalaureate course may graduate with honors if they meet the following cumulative grade point averages (GPA):\n* **Summa cum Laude:** 1.0000 to 1.2500\n* **Magna cum Laude:** 1.2501 to 1.5000\n* **Cum Laude:** 1.5001 to 1.7500\n\nTo qualify for honors, a student must:\n1.  Carry the normal load prescribed in the curriculum.\n2.  Complete the program within the prescribed years (4 or 5 years).\n3.  Complete at least 75% of academic units at EARIST.\n4.  Maintain a residence of at least three years prior to graduation.\n5.  Have no final grade lower than 2.25 in any course (academic or non-academic).\n6.  Have no grades of Incomplete, Dropped, or 5.0 (Failed) in any course taken at EARIST or any other institution.\n7.  Have never repeated a course.\n\n**On-the-Job Training (OJT)**\nStudents undergoing OJT, Practicum, or Internship must enroll in the equivalent course and be in good academic standing with all pre-requisites completed. They must be physically and mentally fit as examined by the school physician. Generally, students with additional academic subjects are not allowed to train outside the school unless the schedule does not conflict with training hours. Ladderized programs and in-house training are permitted per college requirements. Additionally, under the Learning Management System guidelines (Resolution No. 352-2020), faculty and students are mandated to utilize flexible, blended, and alternative teaching approaches via online and offline delivery.",
    "keywords": [
      "graduation requirements",
      "honors",
      "Summa cum Laude",
      "Magna cum Laude",
      "Cum Laude",
      "OJT",
      "practicum",
      "internship",
      "flexible learning",
      "LMS"
    ]
  },
  {
    "id": "earist_handbook_2021_fees_refunds_financial_assistance",
    "source": "Student Handbook 2021",
    "category": "Article III & IV - Financial Policies",
    "topic": "Tuition Fees, Refunds, Student Assistance, and General Scholarship Guidelines",
    "content": "Under Article III Payment and Refund of Fees, the EARIST Board of Trustees fixes tuition fees and other necessary school charges such as matriculation, graduation, and laboratory fees, subject to RA No. 8292 and RA No. 10931. The Institute is mandated to formulate mechanisms for online payment. Educational expenses are free for students covered by RA 10931 (Universal Access to Quality Tertiary Education Act). For Payee Students not covered by the Free Tuition Law, total matriculation fees include tuition, miscellaneous, and other fees, which may be paid in cash or via installments determined by Financial Management Services.\n\nRegarding the Withdrawal and Refund of Fees (Article III, Section 3), students who avail of Free Tuition under RA 10931 cannot refund tuition or other charges regardless of attendance. For Payee Students (Graduate Programs and those opting out of RA 10931), refunds are processed only if the student cancels registration by filing a Dropping Form. The refund schedule is: 100% refund before the start of classes; 80% refund within one week from the start of classes; 50% refund within two weeks from the start of classes; and No refund after the second week of classes.\n\nUnder Article IV, Section 5, EARIST provides a Student Assistance program. This refers to term-employment of not more than 100 hours per month. The wage rates are P30.00 per hour for non-technical skills and P75.00 per hour for technical skills. To qualify for Student Assistance, an applicant must be a bonafide student with at least one semester of residence, no failing grades in the previous semester, and a weighted average of at least 2.50.\n\nUnder Article IV, Section 6, the Institute enforces a \"No Dual Scholarship\" policy. A student shall not enjoy more than one scholarship or grant simultaneously. If a student is a recipient of multiple grants, they must choose the most beneficial one and inform the Accounting Department. Additionally, Section 4 lists Special Grants available, including CHED-Student Financial Assistance Programs (StuFAPs), EARIST Faculty Sponsored Scholarship, DOST-SEI Scholarship Grant, and grants from other NGOs.",
    "keywords": [
      "tuition fees",
      "refund policy",
      "RA 10931",
      "free tuition",
      "student assistantship",
      "working student wage",
      "no dual scholarship",
      "financial aid"
    ]
  },
  {
    "id": "earist_handbook_2021_scholarship_qualifications",
    "source": "Student Handbook 2021",
    "category": "Article IV - Scholarship and Financial Assistance",
    "topic": "Qualifications and Requirements for Specific Scholarship Programs",
    "content": "Under Article IV Scholarship and Financial Assistance, the EARIST Student Handbook 2021 details specific qualifications and requirements for three major scholarship programs administered through the Office of Student Affairs and Services (SAS) and UniFAST.\n\n**1. Tertiary Education Program (Section 1)**\nTo qualify for the Tertiary Education Program, a student must be enrolled and carry a regular load of 18 units (except for graduating students). The student must not be a recipient of any other government scholarship or grant and must not have a failing grade or a dropped subject in the previous semester. Requirements include a duly accomplished Scholarship Form, copies of current and previous Certificates of Registration (COR), copies of current and previous Reports of Grades, and a photocopy of the School I.D. with three specimen signatures.\n\n**2. Tulong Dunong Program (Section 2)**\nTo qualify for the Tulong Dunong Program, the student must be a Filipino citizen, enrolled, and carrying a regular load of 18 units (except for graduating students). The student must not have a failing grade or dropped subject in the previous semester, must not have been expelled from any HEI, and must not exceed the Maximum Residency Policy. Uniquely, the applicant must be a dependent of an Overseas Filipino Worker (OFW) who was repatriated, displaced, or deceased during the COVID-19 Pandemic, as certified by DOLE. Requirements are identical to the Tertiary Education Program (Scholarship Form, CORs, Grades, ID).\n\n**3. Faculty and Employees Union Scholarship (Section 3)**\nThis scholarship is available to qualified children of EARIST employees. The applicant must be currently enrolled in any college course and carry a minimum academic load of 18 units (except for graduating students). To continue the scholarship, the student must have a passing grade in all subjects, including P.E. and NSTP. Conditions for this scholarship include: the student shall not drop any subject, shift courses, or stop schooling without approval; the student must not commit any infraction ranging from serious to very serious offenses; and the student must finish the course within the specified years in the curriculum. Requirements include the Scholarship Form, previous COR, current Report of Grades, and a Certificate of Employment of the parent from the EARIST HRD.",
    "keywords": [
      "scholarship requirements",
      "Tertiary Education Program",
      "Tulong Dunong",
      "Faculty Union Scholarship",
      "OFW dependent",
      "scholarship qualifications",
      "financial assistance criteria"
    ]
  },
  {
    "id": "earist_handbook_2021_rights_responsibilities",
    "source": "Student Handbook 2021",
    "category": "Article V - Rights and Responsibilities",
    "topic": "Comprehensive List of Student Rights and Responsibilities",
    "content": "Under Article V of the EARIST Student Handbook 2021, the Institute defines the specific rights and responsibilities of its bonafide students.\n\n**Section 1: Student Rights**\nBonafide students of EARIST enjoy the following rights:\n1.  The right to choose a field of study, subject to fair, reasonable, and equitable admission and academic requirements.\n2.  The right to participate in matters affecting their welfare and to establish development for their future.\n3.  The right to avail of career guidance and counseling services.\n4.  The right to access and receive official certificates, diplomas, transcripts of records, reports of grades, transfer credentials, and similar documents upon request and payment of fees.\n5.  The right to publish a student newspaper and similar publications consistent with the \"Campus Journalism Act of 1991.\"\n6.  The right to privacy of communication and correspondence, and to defend the rights to freedom of speech and expression.\n7.  The right to take part in duly approved projects and activities that foster holistic growth.\n8.  The right to freely express one's gender preference and follow the norms of the Institution without prejudice.\n9.  The right to seek justification on contested grades imposed by any faculty member. Students may file for re-computation or rectification in writing through the Dean (for major courses) or the Director of Instruction (for general education courses).\n\n**Section 2: Responsibilities of the Student**\nEvery bonafide student must perform the following duties:\n1.  The student must conduct themselves with proper behavior, showing respect and manners at all times.\n2.  The student must exert utmost diligence in their studies to develop their potential for service and become assets to their families and society.\n3.  The student must uphold the academic integrity of the Institute by striving for academic excellence and abiding by school rules.\n4.  The student must promote and maintain a pleasant environment and exert extra effort to attain harmonious relationships with fellow students, faculty, and personnel.\n5.  The student must participate actively in the promotion of the general welfare, particularly in co-curricular and extra-curricular activities.\n6.  The student must adopt positive measures and steps to ensure holistic student development.\n7.  The student must abide by the Code of Conduct and Discipline formulated by the Institute.",
    "keywords": [
      "student rights",
      "student responsibilities",
      "academic integrity",
      "campus journalism",
      "gender preference",
      "contested grades",
      "freedom of speech",
      "student conduct"
    ]
  },
  {
    "id": "earist_handbook_art_vi_sec_1_to_3_2_conduct_uniform_id",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "General Conduct, Uniform Policy, and Identification Requirements",
    "content": "Under Article VI, Sections 1 through 3.2 of the EARIST Student Handbook, the Institute establishes specific mandates regarding general conduct, the use of the school seal, uniform policies, and identification requirements. The EARIST Code of Conduct and Discipline, proposed by Dr. Editha V. Pillo, requires every student to adhere to the principle: 'DO the right thing, right!' to ensure an environment conducive to academic excellence.\n\nRegarding the use of the Institute's name, logo, and seal, only official offices of the Institute are authorized to use them. Individual students or student groups are prohibited from using the EARIST name and logo on printed programs, invitations, announcements, letters, or tickets without a recommendation from their activity adviser or chairperson and approval from a duly authorized Institute Official.\n\nStudents are required to wear the prescribed uniform on Mondays, Wednesdays, and Fridays. Specific exceptions and variations apply: laboratory or shop uniforms may be worn during respective periods; P.E. uniforms are permitted during P.E. classes; and NSTP (MTS/LTS/CWTS) uniforms are worn during training days. College Shirt uniforms are designated for Tuesdays and Thursdays, while Organizational Shirt uniforms are worn on Saturdays. Pregnant students may be exempted from wearing the uniform if they submit a Medical Certification to the EARIST Medical Officer for validation. Additionally, students may wear organizational shirts during the day if their recognized college-based organization is conducting an approved activity.\n\nIdentification cards (I.D.) are mandatory at all times. Entrance to the campus is denied to any student without their official I.D. In the event of a lost I.D., the student must immediately report the loss to the Security Officer, who will refer the case to the Registrar's Office. Replacement requires a notarized Affidavit of Loss, an Accomplished Clearance Form from the College Prefect of Discipline, and an Official Receipt of I.D. Replacement. Losing an I.D. carries specific disciplinary consequences: losing an I.D. for the second time without a valid reason constitutes 'negligence' (a minor offense), requiring a parent dialogue with the College Prefect of Discipline and a warning. Losing an I.D. for the third time without a valid reason constitutes 'gross negligence' (a major offense), requiring a parent dialogue and placement under Discipline Probation before a replacement is issued.",
    "keywords": [
      "uniform policy",
      "ID replacement",
      "campus entry",
      "negligence",
      "gross negligence",
      "college shirt",
      "organizational shirt",
      "pregnant student exemption"
    ]
  },
  {
    "id": "earist_handbook_art_vi_sec_3_3_grooming_curfew_behavior",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Proper Grooming, Curfew, and Campus Etiquette",
    "content": "Under Article VI, Section 3.3 of the EARIST Student Handbook, the Institute enforces strict guidelines regarding grooming, curfew, and general behavior to maintain peace and order. Male students must observe a clean and decent haircut, defined as a barber's cut of 2 inches by 3 inches, without colorful highlights. Working students who require different hairstyles due to the nature of their employment must secure a special permit from the Office of Student Affairs and Services (OSAS). Female students are prohibited from entering the campus with colorful hair highlights. The Institute strictly prohibits goatees, colored nail polish, and earrings for male students inside the campus. Furthermore, exposed body piercing and loud tattoos are strictly prohibited for all students regardless of gender.\n\nFor campus security, a curfew is enforced requiring students to be out of the campus by 9:30 PM, unless they have an endorsement from the Dean or Director of the requesting unit and approval from the authorized representative of the Office of the President. Cleanliness must be observed at all times, with waste materials disposed of in proper trash cans.\n\nStudents are mandated to observe respect and honor when dealing with co-students, college personnel, faculty, administrators, and visitors. Students must also use school property with diligence and care. To maintain peace and order, students must behave well, refrain from making unnecessary noise, and avoid loitering along corridors, especially while classes are ongoing. The use of devices and gadgets such as cell phones or iPods is prohibited during regular class hours and strictly forbidden during examinations.",
    "keywords": [
      "grooming standards",
      "haircut policy",
      "tattoos",
      "body piercing",
      "curfew",
      "9:30 PM",
      "electronic gadgets",
      "loitering",
      "campus cleanliness"
    ]
  },
  {
    "id": "earist_handbook_art_vi_sec_4_1_1_major_offenses",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Comprehensive List of Major Offenses",
    "content": "Under Article VI, Section 4.1.1 of the EARIST Student Handbook, the following acts are classified as Major Offenses, which carry significant disciplinary sanctions:\n\n1. Cheating in any form during examinations or written reports, including unauthorized possession of notes, copying, allowing others to copy, looking at another's paper, having someone else take an exam, plagiarism, or other forms of academic dishonesty.\n2. Vandalism or deliberate destruction of property belonging to the EARIST community or visitors.\n3. Carrying or possession of a deadly weapon inside Institute premises or during academic functions.\n4. Deliberate disruption of academic functions or school activities creating disorder or breach of peace.\n5. Brawls within Institute premises or during academic functions.\n6. Direct assault or inflicting physical injuries on any person during academic functions.\n7. Unauthorized possession, use, or bringing of prohibited/regulated drugs or chemicals (violation of RA 9165).\n8. Unauthorized possession or drinking of liquor inside premises, or entering premises under the influence of alcohol.\n9. Gross acts of disrespect towards administrators, faculty, personnel, or students that cause ridicule or contempt.\n10. Threatening another person with crime, injury, or harm to honor/integrity.\n11. Acts of lewdness or immorality, including being in a cubicle with another person, necking/petting, or distributing/accessing pornographic materials.\n12. Acts bringing disrepute to the Institute, such as malicious imputation of crimes or vices.\n13. Unjust enrichment, stealing, or failure to turn over lost and found items.\n14. Unauthorized collection of money or checks related to the Institute.\n15. Forging, falsifying, or tampering with academic/official records, or practicing fraud/deception.\n16. Gambling in any form inside the campus.\n17. Conviction by a court for a criminal offense involving moral turpitude.\n18. Participation in any violent act.\n19. Provocation resulting in heated verbal or physical confrontation.\n20. Willful failure to comply with summons for disciplinary investigations.\n21. Hazing or infliction of physical injuries during initiation rites (violation of RA 8049). Officers are liable whether present or not.\n22. Computer security breaches, including unauthorized access, altering information, introducing false info, or preventing normal operation (viruses/config changes).\n23. Unauthorized use of the EARIST name and logo in creating social media accounts.\n24. Perjury or making untruthful statements under oath.\n25. Possession or explosion of firecrackers without authorization.\n26. Lending ID/CORs to another or using someone else's ID/COR.\n27. Making sexual advances in words or deeds.\n28. Illegal reproduction of Institute materials.\n29. Other acts determined by Institute authorities after consultation and dissemination.\n30. Habitual disregard of policies, defined as committing three minor offenses of the same kind or five minor offenses of different kinds.\n31. Violation of Intellectual Property Rights policies.\n32. Scalping or selling tickets at unauthorized prices.\n33. Bullying in any form (violation of RA 10627).\n34. Robbery and theft.\n35. Smoking, including e-cigarettes, in school premises.",
    "keywords": [
      "major offenses",
      "cheating",
      "academic dishonesty",
      "vandalism",
      "drugs",
      "alcohol",
      "hazing",
      "sexual harassment",
      "bullying",
      "computer breach",
      "theft",
      "smoking",
      "falsification",
      "habitual disregard"
    ]
  },
  {
    "id": "earist_handbook_art_vi_sec_4_1_2_minor_offenses",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Comprehensive List of Minor Offenses",
    "content": "Under Article VI, Sections 4.1.2 and 4.1.3 of the EARIST Student Handbook, the following acts are classified as Minor Offenses:\n\n1. Simple acts of disrespect in words or deeds against any member of the community or visitor.\n2. Acts disturbing peace and order that do not constitute a major offense (e.g., disturbing classes).\n3. Refusal to present an ID or temporary campus pass when asked.\n4. Proselytizing (attempting to convert others by attacking their beliefs or offering inducements).\n5. Littering.\n6. Selling items, engaging in business, or soliciting contributions without Dean approval.\n7. Public Display of Physical Intimacy (PDPI).\n8. Unauthorized use of classrooms and school facilities.\n9. Loitering along classroom corridors while classes are ongoing (second and succeeding violations).\n10. Playing electronic gadgets, board games, or card games outside official activities.\n11. Unhygienic and improper use of Institute facilities.\n12. Entering restricted areas without permission.\n13. Bringing cutters, pointed scissors, or laboratory instruments without faculty endorsement and Security permit.\n14. Third and succeeding entry into the campus without an ID in an academic year.\n15. Third and succeeding loss of an ID in the student's entire stay.\n16. Third and succeeding non-wearing of Institute-issued ID inside premises.\n17. Changing of uniform inside premises (except as allowed for PE/Lab).\n18. Refusal to undergo government/Institute required random drug testing.\n19. Bringing in domesticated animals or pets.\n\nAdditionally, disobeying other school rules and regulations as determined by Institute authorities constitutes an offense.",
    "keywords": [
      "minor offenses",
      "disrespect",
      "littering",
      "PDPI",
      "public display of affection",
      "unauthorized selling",
      "loitering",
      "restricted area",
      "drug testing refusal",
      "pets policy"
    ]
  },
  {
    "id": "earist_handbook_art_vi_sec_4_2_procedures_board",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Student Discipline Board, Corrective Measures, and Hearing Procedures",
    "content": "Under Article VI, Section 4.2 of the EARIST Student Handbook, strict procedures govern disciplinary cases. The Student Discipline Board (SDB) hears and decides cases. For Minor Offenses (College Level), the Board includes the Dean/Associate Dean (Chairman), College Prefect of Discipline, Department Head, and CSG Governor. For Major Offenses (Institute Level), the Board includes the OSAS Director (Chairman), the student's Dean, the ISG President, and the concerned CSG Governor. To ensure impartiality, the Vice President for Academic Affairs (VPAA) may appoint additional members, such as a Faculty/Employee Association representative or other school officials.\n\nCorrective measures are imposed not as retribution but as formative interventions to reform behavior. For Major Offenses, sanctions include Probation, Suspension, Dismissal/Non-Readmission/Exclusion, or Expulsion. For Minor Offenses, sanctions follow a progression: \n1. First offense: Written warning.\n2. Second offense: Written reprimand requiring a letter from parents (parents may be invited for a conference).\n3. Third offense: Charged as a major offense (if applicable) or a written reprimand requiring a mandatory parent conference.\n\nRegardless of the offense level, students and parents may be required to attend seminars, submit apology letters, undergo guidance counseling, or settle restitution for damages.\n\nThe Handbook mandates specific Rules of Procedure for hearings. A complaint may be filed by any EARIST community member or via an incident report from the Security Office. The accused student has specific rights:\n1. To be informed in writing of the nature of the accusation.\n2. To be informed of the evidence against them.\n3. To answer allegations and present counter-evidence with the assistance of an adviser or counsel.\n4. All evidence must be under oath and notarized. \nDecisions are rendered by school authorities upon evaluation of the evidence.",
    "keywords": [
      "Student Discipline Board",
      "SDB",
      "due process",
      "hearing procedure",
      "corrective measures",
      "intervention",
      "parent conference",
      "complaint filing",
      "right to counsel"
    ]
  },
  {
    "id": "earist_handbook_art_vii_disciplinary_sanctions",
    "source": "Student Handbook 2021",
    "category": "Article VII - Disciplinary Sanctions",
    "topic": "Definitions of Disciplinary Sanctions and Academic Penalties",
    "content": "Under Article VII of the EARIST Student Handbook, the Institute defines specific disciplinary sanctions for offenses. \n\n1. **Warning or Reprimand:** Meted out in writing (for minor offenses) or verbally, warning that repetition will lead to graver measures. It is given for the first and second incident of a minor offense.\n2. **Suspension:** Bars a student from class or school for a specific period. Suspensions over three days require VPAA approval. Time lost is considered a voluntary absence.\n3. **Probation:** A status for students whose behavior merits separation but are given a chance.\n   - *Academic Probation:* Imposed for failing 1 major or 2 minor courses. Lasts one semester; lifted upon passing all courses. Further failure results in non-readmission.\n   - *Discipline Probation:* Imposed for a major offense or three minor offenses. Lasts 60 school days to one semester. A student may only be placed on probation twice before dismissal.\n4. **Non-Readmission:** Allows a student with a major offense to finish the current semester but disqualifies them from enrolling in the next. This automatically disqualifies the student from receiving a Certificate of Good Moral Character.\n5. **Dismissal:** Immediate exclusion from school rolls for students guilty of major offenses where urgency is required. It includes the issuance of transfer credentials and denial of Good Moral Character.\n6. **Expulsion:** An extreme penalty excluding the student from admission to *any* public or private school in the Philippines. This requires Board of Trustees (BOT) approval. Preventive suspension may be applied during investigation if the student poses a risk.\n7. **Sanctions on Graduating Students:** Those who commit major offenses will not be allowed to join commencement exercises and will be denied a Certificate of Good Moral Character.\n\nThe school retains the right to take action against violators as long as they are enrolled (Prescriptive Period). Other penalties may include fines, revocation of degree, withholding of diploma, or annotation of the offense on the transcript.",
    "keywords": [
      "disciplinary sanctions",
      "academic probation",
      "discipline probation",
      "suspension",
      "non-readmission",
      "dismissal",
      "expulsion",
      "graduating students",
      "good moral character",
      "preventive suspension"
    ]
  },
  {
    "id": "earist_handbook_art_viii_grievance_procedures",
    "source": "Student Handbook 2021",
    "category": "Article VIII - Procedures for Settlement of Complaints/Grievances",
    "topic": "Due Process and Grievance Settlement Procedures",
    "content": "Under Article VIII of the EARIST Student Handbook, the procedure for the redress and settlement of complaints and grievances conforms to due process of law to ensure fairness and justice. The Institute prioritizes counseling, arbitration, and amicable settlement over sanctions. Students are entitled to due process in all disciplinary proceedings. \n\nThe essential process involves the following steps:\n1.  **Initial Consultation:** Any aggrieved party (student or personnel) should first seek advice from a responsible person, such as a teacher or official in the relevant area. Psychological problems are referred directly to the Counseling and Testing Office upon the recommendation of the College Dean or OSAS.\n2.  **Filing of Complaints:** If the issue is not resolved at the consultation stage, complaints must be filed in writing. \n    * **Minor Offenses:** Filed with the Office of the Dean.\n    * **Major Offenses:** Filed with the Director of Student Affairs and Services (OSAS).\n    * **Student vs. Faculty/Personnel:** Referred by the OSAS Director to the Vice President for Academic Affairs (for academic concerns) or the Vice President for Administration and Finance (for administrative concerns).\n    * **Faculty/Personnel vs. Student:** Referred to the College Discipline Board or Institutional Discipline Board.\n3.  **Right to Counsel:** In disciplinary proceedings, both complainants and respondents have the right to counsel of their choice and the right to present affidavits to support their claims or defenses.\n4.  **Arbitration and Investigation:** The unit receiving the complaint aims for arbitration and amicable settlement. If this fails, the case is referred to the EARIST Grievance Committee for proper investigation. The Committee submits recommendations to the Institute President.\n5.  **Final Decision:** The decision of the Institute President is final and executory unless appealed to the Board of Trustees (BOT). The BOT's decision is final, without prejudice to Civil Service Law provisions.",
    "keywords": [
      "grievance procedure",
      "filing complaints",
      "due process",
      "arbitration",
      "Counseling and Testing Office",
      "Grievance Committee",
      "right to counsel",
      "appeal process"
    ]
  },
  {
    "id": "earist_handbook_art_ix_sec_1_sas_welfare",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services (SAS)",
    "topic": "Student Welfare Services, Guidance, and Economic Enterprise",
    "content": "Under Article IX, Section 1 of the EARIST Student Handbook, Student Affairs and Services (SAS) are defined in accordance with CMO No. 09, Series of 2013 and CMO No. 08, Series of 2021. SAS provides academic support experiences to help students interact constructively with the educational environment. \n\n**Student Welfare Services** include:\n1.  **Information and Orientation Services:** Facilitates student adjustment to tertiary education. This includes comprehensive orientation programs (covering persons with disabilities and relevant laws) and the distribution of information materials. Key statutes covered include the Anti-Bullying Act (RA 10627), Anti-Sexual Harassment Act (RA 7877), Anti-Hazing Law (RA 8049), and the Comprehensive Dangerous Drugs Act (RA 9165), among others.\n2.  **Guidance and Counseling Services:** An integrated approach to developing well-functioning individuals. Sub-services include:\n    * *Counseling:* Goal-oriented individual or group sessions.\n    * *Individual Inventory:* Collection of data to identify student potential.\n    * *Testing and Appraisal:* Measuring ability and diagnosing learning difficulties.\n    * *Follow-up & Referral:* Ensuring service completion and connecting students to external agencies when needed.\n    * *Special Programs:* Includes Pre-employment Seminars, Career Talks, and Job Fairs.\n3.  **Career and Job Placement Services:** Regular seminars and assistance for occupational fitness, supported by Memoranda of Agreement with industries.\n4.  **Economic Enterprise Development:** Programs catering to economic needs, such as Student Cooperatives (loans, savings) and Entrepreneurial services (layouting, photography, event planning, rentals). Student organizations wishing to engage in business must apply for permission through OSAS, undergo feasibility checks by the Production and IGP Office, and secure approval from the President. They must submit annual Financial Status reports.\n5.  **Student Handbook Development:** The handbook is revised every five years by a committee including the VPAA, OSAS Director, Deans, and Student Trustees. Updates must be supported by legal issuances and approved by the Board of Trustees.",
    "keywords": [
      "Student Welfare Services",
      "Guidance and Counseling",
      "career placement",
      "economic enterprise",
      "student business",
      "handbook revision",
      "orientation",
      "RA 10627",
      "RA 8049"
    ]
  },
  {
    "id": "earist_handbook_art_ix_sec_2_leadership_governance",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services (SAS)",
    "topic": "Student Leadership, Organizations, and Government Structure",
    "content": "Under Article IX, Section 2 of the EARIST Student Handbook, the Institute mandates Student Development Services to enhance leadership and social responsibility.\n\n**Leadership Training:** OSAS organizes training for student leaders from the classroom to the institutional level. The Leadership Training Seminar (LTS) is intended for elected officers of the Institute Student Government (ISG), College Student Government (CSG), and Legislative Department. Student leaders may attend external training via a queuing system managed by the Leadership Service Division (LSD) and must submit narrative reports post-training.\n\n**Student Government Structure:**\n* **Institute Student Government (ISG):** The highest governing body and official representative of students. It acts as a mediator and partners with the Institute Commission on Student Election.\n* **Composition:** The ISG consists of an Executive Board (President, VP, Secretary, Treasurer, Auditor, and Committee Chairpersons) elected at large, and a Legislative Board (CSG Representatives) elected by their respective colleges.\n* **College Student Government (CSG):** Composed of a Governor, Vice Governor, Secretary, Treasurer, Auditor, and College Representatives. The Governor represents the college in the ISG.\n\n**Qualifications for Officers:** Candidates for ISG and CSG must:\n1.  Be a bonafide student with at least one year of residency.\n2.  Carry a minimum load of 18 units (exceptions require appeal certified by the Dean).\n3.  Have a GPA of 2.50 or higher.\n4.  Have no failing grades in the preceding semester.\n5.  Not have been found guilty of any major offense.\n\n**Disqualification:** Officers are disqualified from continuing their term if they obtain a failing grade during their term or the semester prior, commit a major offense, fail to enroll, or suffer permanent physiological/psychological incapacity. The term of office is one year (January 1 to December 31), and qualified officers are eligible for re-election.",
    "keywords": [
      "Institute Student Government",
      "ISG",
      "College Student Government",
      "CSG",
      "student leadership",
      "election qualifications",
      "officer disqualification",
      "Leadership Training Seminar"
    ]
  },
  {
    "id": "earist_handbook_art_ix_sec_2_to_4_publications_medical_services",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services (SAS)",
    "topic": "Student Publications, Admission, Food, and Medical Services",
    "content": "Under Article IX, Sections 2.5 through 4.4 of the EARIST Student Handbook, the Institute provides various institutional support programs.\n\n**Student Publications:** In accordance with the Campus Journalism Act of 1991 (R.A. 7079), OSAS supervises student publications. \"The EARIST Technozette\" and \"The Champion\" are major publications staffed by students who pass qualifying exams. \"The EARISTians\" is the official yearbook, funded by voluntary subscriptions.\n\n**Admission and Financial Assistance:** Admission services accommodate applicants including persons with disabilities (R.A. 7277). Tuition fees are posted in conspicuous places. Scholarship and financial assistance are provided through UniFAST (referencing Article IV).\n\n**Medical and Dental Services:** Administered by licensed professionals, these services promote wellness and provide:\n1.  Entry-level Physical Examinations for freshmen.\n2.  Free consultation and treatment (including minor procedures like wound cleaning).\n3.  Dental services including routine examinations and free tooth extraction (if indicated).\n4.  Emergency referrals to hospitals (Health Service must be notified).\n\n**Insurance:** All bonafide students are covered by an external personal accident insurance policy managed by a private company. The annual premium is taken from the student's miscellaneous fees as provided by CHED-UniFAST.",
    "keywords": [
      "student publication",
      "The EARIST Technozette",
      "yearbook",
      "medical services",
      "dental services",
      "student insurance",
      "accident insurance",
      "UniFAST"
    ]
  },
  {
    "id": "earist_handbook_art_ix_sec_4_5_safety_housing_facilities",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services (SAS)",
    "topic": "Safety, Security, Housing, and Campus Facilities",
    "content": "Under Article IX, Sections 4.5 through 4.10 of the EARIST Student Handbook, the Institute enforces strict safety and facility usage protocols.\n\n**Safety and Security:**\n* **Property:** Assets inside the campus are presumed Institute property unless proven otherwise. Personal items (laptops, cameras) must be reported to the Security and Safety Office upon entry to ensure they can be taken out. The Institute is not liable for lost personal items unless deposited and recorded.\n* **Prohibitions:** Firearms, deadly weapons, liquor, flammable substances, and prohibited drugs are strictly banned. The Institute is a strict no-smoking area (monitored by CCTV).\n* **Weekend Access:** Students are not allowed to enter premises for sports or recreational activities on Saturdays, Sundays, and Holidays without prior authority from the President.\n* **Disaster Risk:** A Disaster Risk Reduction and Management Committee (DRRMC) handles contingency plans (earthquakes, fire drills) in compliance with RA 10121.\n\n**Housing and Other Services:**\n* **Housing:** OSAS monitors and evaluates student-athlete dormitories and housing facilities.\n* **Inter-Faith:** The Institute provides a chapel for religious expression and assists in accrediting religious student organizations.\n* **Foreign Students:** OSAS assists foreign students with academic and non-academic needs.\n* **Special Needs:** The Institute accommodates Persons with Disabilities (PWDs) and learners with special needs, providing life skills training and counseling records.\n* **Cultural Arts:** The EARIST Cultural Affairs Division (ECAD) organizes workshops to promote national culture.",
    "keywords": [
      "campus security",
      "lost and found",
      "prohibited items",
      "no-smoking",
      "weekend access",
      "student housing",
      "DRRMC",
      "PWD services",
      "foreign students"
    ]
  },
  {
    "id": "earist_handbook_art_ix_sec_4_11_sports_development",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services (SAS)",
    "topic": "Sports Development and Student-Athlete Guidelines",
    "content": "Under Article IX, Section 4.11 to Section 5 of the EARIST Student Handbook, the Sports and Physical Development Office formulates and implements sports programs.\n\n**Student-Athlete Selection:** Candidates must be bonafide undergraduate students, meet the SCUAA age limit, and have no failed grades in the previous semester.\n\n**Benefits:** Student-athletes are eligible for:\n* Monthly allowances during training/competition.\n* Travel allowances and free travel to local competitions.\n* Free uniforms, competition shoes, and personal equipment.\n* Free seminars and workshops.\n* Certificates of Recognition for winning competitions.\n\n**Duties and Responsibilities:** Athletes must attend classes, maintain scholastic eligibility, attend mandatory training, and display good sportsmanship. \n\n**Forfeiture:** Athlete status is forfeited for violations of the Student Handbook, non-participation in practice/games without valid reason, or culpable violations in sports competitions.\n\n**Intramurals:** An annual sports festival is conducted where classes are suspended to ensure student attendance. Intramural night activities are allowed only up to 9:00 PM.\n\n**Social and Community Involvement:** The Institute promotes volunteerism, environmental protection, and crime prevention partnerships.\n\n**Monitoring:** OSAS conducts annual monitoring and evaluation of all student affairs and services to improve quality.",
    "keywords": [
      "student athletes",
      "varsity benefits",
      "intramurals",
      "SCUAA",
      "athlete allowance",
      "community involvement",
      "sportsmanship"
    ]
  },
  {
    "id": "earist_handbook_art_x_sec_1_to_4_org_accreditation",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organization",
    "topic": "Governance, Accreditation, and Renewal of Student Organizations",
    "content": "Under Article X, Sections 1 through 4 of the EARIST Student Handbook, the Institute encourages the formation of student groups for social, cultural, religious, literary, and recreational development, governed by Batas Pambansa Blg. 232 (Education Act of 1982). The Office of Student Affairs and Services (OSAS) holds the authority to regulate these organizations, including formulating policies, approving activities, issuing or revoking Certificates of Recognition, and resolving conflicts within or between organizations.\n\nApplications for accreditation must be submitted to OSAS through the Institute Student Government (ISG) one month after the opening of the school year. The processing period is fifteen (15) working days. Required documents include a letter of application, a duly accomplished SAS Application Form, the Constitution and By-Laws (consistent with the Institute's Mission-Vision), an updated roster of officers and members, the Adviser's Conforme form, and a Master Plan of activities with budget breakdowns. Failure to meet the deadline results in the forfeiture of recognition for that school year, meaning the group cannot use Institute facilities or hold projects.\n\nFor renewal, accredited organizations must apply one month after the school year opens. Renewal requirements include an Accomplishment Report with documentation, amendments to the Constitution (if any), lists of new officers, a Master Plan of Activities, program evaluations, and the Faculty Adviser Conforme. Recognition is effective for one school year.",
    "keywords": [
      "accreditation process",
      "student organization registration",
      "OSAS authority",
      "renewal of accreditation",
      "requirements for student orgs",
      "deadline",
      "Batas Pambansa Blg. 232"
    ]
  },
  {
    "id": "earist_handbook_art_x_sec_5_to_7_status_revocation_activities",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organization",
    "topic": "Organization Status, Revocation, and Activity Approval",
    "content": "Under Article X, Sections 5 through 7 of the EARIST Student Handbook, the Institute Student Government (ISG) is designated as the 'mother organization' whose primary function is to monitor all Recognized Student Organizations (RSO). Organizations are classified by status (Probationary or Regular) and nature (College-Based for academic support or Institutional for social/cultural aspects). A Certificate of Recognition may be revoked if an organization violates its objectives, Constitution, or Institute policies, following due process.\n\nAll curricular and extra-curricular activities under ISG jurisdiction require approval from the Institute President through the Vice President for Academic Affairs (VPAA) and the SAS Director. Project proposals must include an Activity Proposal Form, a letter to the President, budgetary allocation, venue reservation, and profiles of speakers. Solicitations and external communications must be noted by the Adviser and Dean, recommended by the SAS Director, and approved by the President. \n\nFinancial accountability is strict; organizations are subject to annual audits by the CSG and ISG Auditors. Activity Performance Reports and Financial Statements must be submitted within five (5) days after an event; failure to do so prohibits future activities. Furthermore, student groups are banned from holding activities one week before and during major examinations.",
    "keywords": [
      "probationary status",
      "revocation of recognition",
      "activity approval process",
      "solicitation policy",
      "financial audit",
      "ISG mother organization",
      "banned dates",
      "major examinations"
    ]
  },
  {
    "id": "earist_handbook_art_x_sec_8_to_10_off_campus_fundraising_advisers",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organization",
    "topic": "Off-Campus Activities, Fundraising, and Faculty Advisers",
    "content": "Under Article X, Sections 8 through 10 of the EARIST Student Handbook, specific rules govern off-campus events, fundraising, and advisers. \n\n**Off-Campus/Overnight Activities:** These require approval from OSAS, notarized parental waivers, and the faculty adviser's letter of conformity. Activities must comply with CHED requirements and be attended by the faculty adviser. If the adviser is unavailable, a replacement must be reported to SAS two days prior. The ideal ratio is one faculty adviser or guardian for every 30 or fewer student participants.\n\n**Fundraising:** Recognized organizations are limited to sponsoring only one fundraising activity per school year. Applications must be submitted to the SAS Director or College Dean at least thirty (30) days before the event. Requirements include a project proposal, IGP form, list of beneficiaries, and an endorsement from the Dean/SAS Director. An audited financial report must be submitted within five (5) days after the activity.\n\n**Faculty Advisers:** Every organization must have one Faculty Adviser who is a full-time faculty member with at least one year of residency. Advisers are designated by the Dean (for college-based orgs) or the OSAS Director (for institutional orgs). A faculty member may not advise more than one organization. Their term is one school year, renewable upon the organization's recommendation.",
    "keywords": [
      "off-campus activities",
      "parental waiver",
      "faculty adviser ratio",
      "fundraising limit",
      "fundraising application",
      "adviser qualifications",
      "financial report deadline"
    ]
  },
  {
    "id": "earist_handbook_art_x_sec_11_to_12_financial_guidelines",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organization",
    "topic": "Financial Guidelines, Membership Fees, and Bank Accounts",
    "content": "Under Article X, Sections 11 through 12 of the EARIST Student Handbook, accredited student organizations must adhere to strict financial guidelines. Only duly accredited organizations may collect voluntary membership fees and access Institute facilities. The membership fee for College-Based Organizations is capped at One Hundred Pesos (P100.00) per school year. Any increase requires majority agreement, confirmation by the Dean, recommendation by OSAS, and approval by the Institute President. Official pre-numbered receipts must be issued for all payments.\n\nOrganizations must open an account in a government depository bank if accumulated fees reach a minimum threshold (indicated as P10,000). Withdrawals require two signatories: the Organization President or Treasurer, and the College Dean (or an approved faculty member) or the OSAS Director for Institutional Organizations. Resolutions signed by a majority of officers are required for fund withdrawals.\n\nFinancial statements must be submitted to OSAS and Financial Management Services (FMS). Officers with financial liabilities must pay the exact amount to FMS. Current officers are mandated to file cases against past officers with pending financial obligations via the EARIST Grievance Committee.",
    "keywords": [
      "membership fees",
      "P100 limit",
      "bank account requirements",
      "signatories",
      "financial liability",
      "FMS",
      "financial statement",
      "grievance committee"
    ]
  },
  {
    "id": "earist_handbook_art_x_sec_13_to_16_misc_posting_awards",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organization",
    "topic": "Posting Rules, Electronic Submission, and Awards",
    "content": "Under Article X, Sections 13 through 16 of the EARIST Student Handbook, the Institute regulates communication and recognizes achievement.\n\n**Posting and Communication:** Posters and notices may only be posted on freedom boards or OSAS-authorized locations. Sources must be identified, and proponents are answerable for complaints. Violations of rules are grounds for non-renewal of the organization. All SAS announcements are posted on official social media accounts, and documents for accreditation or proposals must be sent via the official OSAS email.\n\n**Awards:** The Institute grants various awards for outstanding performance:\n1.  **Academic Awards:** Includes Summa Cum Laude, Magna Cum Laude, Cum Laude, and Academic Excellence.\n2.  **Service Awards:** Includes Outstanding Student Organization and Outstanding Leader.\n3.  **Other Categories:** Cultural Awards, Sports and Development Awards, and Research Awards.\n4.  **Monetary Incentives:** Given for National Recognition in PRC/Government Exams and recognition in Skills Competitions.",
    "keywords": [
      "posting rules",
      "freedom boards",
      "electronic submission",
      "academic awards",
      "service awards",
      "Summa Cum Laude",
      "Outstanding Student Organization",
      "monetary incentives"
    ]
  },
  {
    "id": "earist_handbook_art_xi_campus_publication",
    "source": "Student Handbook 2021",
    "category": "Article XI - Guidelines on Campus Publication",
    "topic": "Campus Publication Management, Rights, and Financial Policies",
    "content": "Under Article XI of the EARIST Student Handbook, the Institute establishes comprehensive guidelines for student publications to uphold the right to free expression and promote intellectual excellence. The Institute recognizes the students' right to free expression as embodied in the Philippine Constitution and encourages quality publications that disseminate information, creative ideas, research, and constructive criticism. Student publications include newspapers, magazines, yearbooks, journals, newsletters, and pamphlets produced primarily for the student clientele.\n\nManagement and Authority:\nThe Office of Student Affairs and Services (OSAS), through the Chief of Student Publication, coordinates these activities. The Institute President appoints the Publication Chief and Technical Adviser based on recommendations from the OSAS Director. Specifically, the Technical Adviser is nominated by the Board of Editors. The Student Publication functions as the publisher, and its authority must be recognized in compliance with editorial policies and Republic Act 7079 (Campus Journalism Act). The Editorial Board retains full responsibility for published materials, with technical guidance from the Adviser. Violations of publication policies or professional journalism standards are subject to suspension, expulsion from the staff, or disciplinary action by the EARIST Grievance Committee.\n\nFinancial and Operational Guidelines:\nPrinting is conducted through canvass or bidding by the editorial board. Funding is derived from student subscriptions (collected during enrollment), advertisements, donations, and grants. These funds are for the exclusive use of the publication, covering printing costs, staff needs, transportation, supplies, and training. Publication fees are determined by the Board of Editors in consultation with the student body and approved by the Board of Trustees. The publication must open a passbook checking account in a government depository bank. Financial transactions require co-signatories: the Editor-in-Chief or Managing Editor, and the Director of Student Affairs and Services (SAS). Financial statements must be submitted to OSAS and Financial Management Services (FMS). Additionally, the Publication Office must provide software to convert print materials to E-publications in compliance with CHED CMO No. 8 series 2021.",
    "keywords": [
      "campus journalism",
      "student publication funding",
      "editorial independence",
      "RA 7079",
      "passbook checking account",
      "financial accountability",
      "technical adviser",
      "printing bidding",
      "grievance committee"
    ]
  },
  {
    "id": "earist_handbook_art_xii_xiii_xv_specialized_programs",
    "source": "Student Handbook 2021",
    "category": "Article XII, XIII, & XV - Specialized Institutional Programs",
    "topic": "Religious, Cultural, and International Affairs Guidelines",
    "content": "Under Articles XII, XIII, and XV of the EARIST Student Handbook, the Institute outlines regulations for religious activities, cultural programs, and international linkages.\n\nReligious Activities (Article XII):\nThe Institute guarantees the free exercise of religious profession and worship without discrimination, provided it does not harm academic goals or violate policies. Interfaith services are supported to provide an environment for free expression of religious orientation. The Institute Chapel is preserved for faith activities with due respect to the highness of God. However, the use of classrooms or other facilities by religious groups requires permission from the concerned Institute authority. The Institute promotes ecumenism and unity among the faithful.\n\nCultural Programs (Article XIII):\nAll cultural programs must pursue academic objectives and secure prior approval from the Office of the President through the Vice President for Academic Affairs (VPAA), as recommended by the Office of Student Affairs and Services (OSAS). Proponents (faculty, employees, or student organizations) must submit a letter of request to OSAS through the EARIST Cultural Affairs Division (ECAD) and the IGP Office. This request must include the title, objectives, dates, venue, budget estimates, and funding sources. ECAD evaluates the request and informs the proponents of approval or disapproval. Changes to the project must be reported to ECAD two days prior, and documentation must be submitted five days after the activity.\n\nInternational Affairs Services (Article XV):\nThe Office of the International Affairs Service (OIAS) acts as the technical secretariat for student mobility, internships, and international education in compliance with CHED Memorandum Order 55, Series of 2016. This includes:\n1. International Linkages: Managing Exchange Visitors Programs, Cultural Exchange Programs, Study Abroad Programs, and Academic Short Courses.\n2. International Internship: Facilitating the application of classroom learning to actual work abroad (commercial, industrial, government, or non-government) for a period ranging from six months to one year.",
    "keywords": [
      "religious freedom",
      "interfaith services",
      "chapel usage",
      "cultural programs",
      "ECAD",
      "International Affairs Service",
      "OIAS",
      "study abroad",
      "international internship",
      "exchange visitors program"
    ]
  },
  {
    "id": "earist_handbook_art_xiv_xvi_communication_branding_effectivity",
    "source": "Student Handbook 2021",
    "category": "Article XIV & XVI - Information Rights and Branding",
    "topic": "Social Media, Posting Policies, Logo Usage, and Handbook Effectivity",
    "content": "Under Article XIV and Article XVI of the EARIST Student Handbook, the Institute enforces strict guidelines regarding the right to information, the use of social media, physical advertisements, and the EARIST brand.\n\nSocial Media and Digital Posting:\nEARIST uses social media to supplement press and marketing efforts. Students sharing Institute news serve as representatives and must act responsibly. The Institute reserves the right to request the removal of content that poses a risk to the reputation of EARIST, its employees, or students. Posting digital materials on official accounts requires permission. All digital announcements must bear the signature of the SAS Director and be endorsed to the InfoPAS Director. Materials must not violate contemporary ethical or moral standards.\n\nPhysical Installation of Advertisements:\nPermits to post announcements or install banners/tarpaulins on campus are granted subject to conditions. All announcements must bear the signature of the SAS Director and be posted only on designated bulletin boards. Posters must be neat, concise, and free from excessive aesthetics. The posting individual or group is liable for removal after the event and for any damage to the posting area. The SAS Director retains the right to approve or reject announcements based on content.\n\nUse of EARIST Logo and Trademarks:\nAny entity wishing to use or imitate the EARIST Logo or seal for documents, goods, or services must secure a permit from the Information and Public Affairs Services (InfoPAS). Specific approval is required for selling merchandise (jackets, mugs, stickers, etc.) or producing institutional collateral (brochures, posters) and advertisements that feature the Institute's brand.\n\nEffectivity (Article XVI):\nThe policies and regulations within the Student Handbook apply to all bona fide students and take effect immediately upon approval by the Board of Trustees.",
    "keywords": [
      "social media policy",
      "reputation management",
      "posting guidelines",
      "bulletin boards",
      "SAS Director approval",
      "EARIST logo",
      "trademark use",
      "InfoPAS",
      "merchandise permit",
      "handbook effectivity"
    ]
  },
  {
    "id": "institutional_identity_hymns_pledge",
    "source": "Student Handbook 2021",
    "category": "General Information - Institutional Identity",
    "topic": "EARIST Hymns and Pledge of Loyalty",
    "content": "Under the General Information section regarding Institutional Identity, the EARIST Student Handbook establishes the official Hymns and the Pledge of Loyalty that define the spirit and commitment of the academic community.\n\nThe EARIST Hymn declares that the EARIST music fills the air and raises the spirit with an echo. It describes a magic that stirs hearts when the community sings the lively, tuneful march. It expresses the joy of singing the music with a martial beat. The hymn emphasizes obeying the call of duty and providing service every day. It asserts that EARIST's name is in the hearts of the students and that their love will always spark. The community pledges to stand by the institution through noble thoughts and deeds, giving love and loyalty forever, concluding with the declaration: E.A.R.I.S.T. – EARIST, Forever!\n\nThe 'Inang Paaralan' hymn addresses the Alma Mater. It states that the students will leave the beloved school, yet the memory of classmates and teachers will always remain in their hearts. It acknowledges that the students are blessed to have finished their studies. Although they are leaving, the hymn notes that this is the beginning of a journey toward success and striving in life. It bids farewell to the beloved school, Rodriguez, until success is achieved.\n\nThe Pledge of Loyalty outlines the commitment required of every student. With all sincerity and freedom from pride, the student pledges loyalty to the School and reiterates love to the Country and people. To the Alma Mater, the student solemnly promises to hold high its ideals and keep its noble traditions. The student vows to strive with others to share all knowledge and power at their command, which is necessary for the reconstruction of the nation’s economy. Finally, the student resolves with a sober sense of responsibility to dedicate themselves to the service of the Republic and the well-being of its citizenry, praying for God to bless the Alma Mater and its graduates forever.",
    "keywords": [
      "EARIST Hymn",
      "Inang Paaralan",
      "Pledge of Loyalty",
      "lyrics",
      "school spirit",
      "oath",
      "Alma Mater",
      "allegiance",
      "institutional songs"
    ]
  },
  {
    "id": "glossary_definitions_part_1",
    "source": "Student Handbook 2021",
    "category": "General Information - Terminology",
    "topic": "Definition of Terms (A-O)",
    "content": "Under the General Information section of the Student Handbook, the following terms regarding university operations and academic policies are defined (Part 1 of 2).\n\nAbsent refers to the act of not being present in class. An Academic Degree is a course of study in an educational institution. Academic Honors are awards for distinction (Summa, Magna, Cum Laude). Academic Load is the number of subjects a student is enrolled in. Accreditation focuses on the evaluation and continuous improvement of educational quality. Admission is the act of allowing a student to enroll. Attendance is being physically present in class. A Baccalaureate Degree is any four- or five-year program.\n\nA Class is a series of meetings or a group of students instructed together. College refers to tertiary education. Conduct is the way a person behaves. Cross Enroll means enrolling in courses from one school while attending another. Curriculum is the systematic sequence of courses required for graduation. A Dean is the person in charge of a college. A Director manages an educational institution. Discipline involves rules and punishment for bad behavior. Dismissal is the removal from enrollment.\n\nDropped refers to withdrawal from a course; a Dropped Grade is given for voluntary withdrawal after two weeks. Examination tests progress; Expulsion is forcible removal for cause. Failed Grade indicates failure to meet requirements. Fees are paid for enrollment. Freshman is a first-year student. Grade reflects academic performance. Graduate is a student who completed a degree. Incomplete Grade (INC) is temporary for unfulfilled requirements.\n\nInstitutional Student Programs and Services cover health, food, shelter, and safety. Irregular Student has less than a full load or back subjects. Junior is a third-year student. Master's refers to a master’s degree. Midterm Examination is held in the middle of the semester. Miscellaneous fees are additions to tuition. Offense is something improper. Official refers to a person holding office.",
    "keywords": [
      "glossary",
      "definitions",
      "academic terms",
      "grading system",
      "student classification",
      "enrollment terms"
    ]
  },
  {
    "id": "glossary_definitions_part_2_abbreviations",
    "source": "Student Handbook 2021",
    "category": "General Information - Terminology",
    "topic": "Definition of Terms (P-Z) and Abbreviations",
    "content": "Under the General Information section, this chunk continues the definition of terms and lists official abbreviations (Part 2 of 2).\n\nPaying Students are those overstaying or ineligible for free tertiary education. Penalty is punishment for rule-breaking. Probation is a supervision period after a serious mistake. OJT/Practicum/Internship is a graduation requirement. Rectification of Grades is the correction of records. Refund is the return of fees. Registration is entering info into official records. Registrar is the officer in charge of records. Retention is continued enrollment. Returnee is a re-admitted student. Scholarship is financial assistance. Senior is a fourth-year student. Shifter is a student changing courses. Sophomore is a second-year student. Special Student earns no formal credits. Student Affairs and Services (SAS) support academic experiences. Suspension is a temporary forced leave. Tertiary Students enjoy free education. Tenure is the length of stay. Transcript of Records is the official grade record. Transferee is a student from another school. Tuition is payment for instruction. Violation is an act against rules. Vocational relates to skills training.\n\nList of Abbreviations:\nCWTS (Civic Welfare Training Service); CSG (College Student Government); DRP (Dropped); EARIST (Eulogio \"Amang\" Rodriguez Institute of Science and Technology); EARMSAT (Memorial School of Arts and Trades); ECAD (Cultural Affairs Division); EARISTCAT (College Admission Test); ECC (Cavite Campus); ERVHS (Vocational High School); ESG (EARIST Student Government); FMS (Financial Management Services); GASAT (General Alvarez School of Arts and Trades); GWA (General Weighted Average); INC (Incomplete); ISG (Institute Student Government); LTS (Literacy Training Services); MTS (Military Training Services); NSTP (National Service Training Program); OJT (On-the-Job Training); PE (Physical Education); ROTC (Reserve Officer Training Corps); SARRMS (Student Admission, Registration, and Records Management Services); SPDE (Sports and Physical Development Education); VPAA (VP for Academic Affairs); VPAF (VP for Administration and Finance); VPREIA (VP for Production, Research, Extension).",
    "keywords": [
      "glossary",
      "abbreviations",
      "acronyms",
      "student services",
      "SARRMS",
      "NSTP",
      "university offices"
    ]
  },
  {
    "id": "earist_officials_2025_executives_and_deans",
    "source": "EARIST Official Website (As of 2025)",
    "category": "University Administration",
    "topic": "Executive Officials and College Deans",
    "content": "According to the EARIST Official Website update as of 2025, the university is led by the following Executive Officials and Academic Deans. This list supersedes previous handbook entries.\n\nExecutive Officials:\nThe University President is Dr. Rogelio T. Mamaradlo, who also concurrently serves as the Interim Dean of the College of Engineering. Dr. Allan Q. Quismundo holds the position of Executive Vice President and is the Officer-in-Charge (OIC) Dean of the Graduate School. Dr. Eric C. Mendoza serves as the Vice President for Academic Affairs. Dr. Yolanda A. Lara is the Vice President for Administration and Finance and also serves as the Director of Financial Management Services. Ms. Gilda S. Familara acts as the College and Board Secretary.\n\nCollege Deans:\nThe College of Architecture and Fine Arts is led by Dean Ar. Diane A. Jose. The College of Arts & Sciences is headed by Dean Mrs. Rodora T. Oliveros. The College of Business and Public Administration is led by Dean Dr. Willy O. Gapasin. The College of Computing Studies is headed by Dean Dr. Jesus S. Paguigan. The College of Criminal Justice is led by Dean Dr. Anabel D. Riva. The College of Education is headed by Dean Dr. Evangeline M. Sangalang. The College of Hospitality and Tourism Management is led by Dean Dr. Maria Rhoda D. Dinaga. The College of Industrial Technology is headed by Dean Dr. Erwin P. Ordovez. Additionally, Dr. Agnes N. Coo serves as the Administrator for the EARIST Cavite Campus.",
    "keywords": [
      "EARIST President",
      "VP Academic Affairs",
      "VP Administration and Finance",
      "College Deans 2025",
      "Rogelio Mamaradlo",
      "Allan Quismundo",
      "Eric Mendoza",
      "Yolanda Lara"
    ]
  },
  {
    "id": "earist_officials_2025_service_directors",
    "source": "EARIST Official Website (As of 2025)",
    "category": "University Administration",
    "topic": "Directors of Services and Offices",
    "content": "As of 2025, the EARIST Official Website lists the following Directors responsible for university operations, student services, and specialized offices.\n\nAdministrative and Academic Services:\nDr. Giovanni L. Ahunin is the Director of Administrative Services. Dr. Marlene M. Monterona leads Research Development Services. Dr. Eriberto R. Astorga Jr. is the Director of Extension and Community Services. Ms. Jocelyn R. Moreno directs Production Services. Ms. Carina N. Romaquin is the Director of Library Services. Mr. Virgel E. Diamante leads Instruction Services. Engr. Roberto M. Liwanag is the Director of Planning Services.\n\nStudent and Registry Services:\nMs. Julie Ann O. Espiritu is the Director of Student Registration & Records Management Services (SARRMS). Ms. Agnes F. Amorin is the Director of Student Affairs and Services (SAS). Mr. Blue Archimedes B. Santos is the Director of the National Service Training Program (NSTP).\n\nSpecialized Offices:\nMr. Benigno A. Castillo is the Director of Quality Assurance. Dr. Melba S. Asuncion leads Internal Audit Services. Ar. Maundelito S. Florendo directs the Project Management Unit. Engr. Ronald B. Baral is the Director of Management Information Services. Engr. Jerome M. Saltorio serves as the Director for Information & Public Affairs Services, Intellectual Property Management, and the Innovation Technology Support Office. Dr. Joselito D. Mabansag is the Director of International Affairs & Linkages Management Services and OIC of Institutional Events Management & Protocol. Dr. Hiromi T. Kikuchi is the Director of the Business Development Center.",
    "keywords": [
      "Service Directors",
      "SARRMS Director",
      "SAS Director",
      "Research Director",
      "NSTP Director",
      "Quality Assurance",
      "Library Services"
    ]
  },
  {
    "id": "earist_board_of_trustees_2025",
    "source": "EARIST Official Website (As of 2025)",
    "category": "Governance",
    "topic": "Board of Trustees Composition",
    "content": "According to the EARIST Official Website as of 2025, the Board of Trustees (BOT) governs the institution with the following composition:\n\nHon. Dr. Desiderio Apag, III serves as the Chairman in his capacity as CHED Commissioner. Hon. Rogelio T. Mamaradlo serves as the Vice Chairman in his capacity as EARIST President. \n\nThe Legislative Representatives are Hon. Alan Peter S. Cayetano (Senate Committee on Education, Arts & Culture) and Hon. Mark O. Go (Chair, Committee of Higher and Technical Education). \n\nGovernment Representatives include Hon. Engr. Romelen T. Tresvalles (DOST-NCR Director) and Hon. Hazel Iris S. Baliatan (Director IV, Public Investment Staff, NEDA). \n\nThe Private Sector is represented by Hon. Arnel S. Abrenica and Hon. Allen R. Buenaventura. \n\nRepresentation from the community includes Hon. Agnes F. Amorin as the EARIST Alumni Association Inc. President and Hon. Carl Justine B. Dioquino as the EARIST ISG President. Ms. Gilda S. Familara serves as the Board Secretary.",
    "keywords": [
      "Board of Trustees",
      "EARIST Governing Body",
      "CHED Commissioner",
      "Senate Committee on Education",
      "Student Regent",
      "Alumni Regent"
    ]
  }
]