[
  {
    "id": "earist_gov_board_of_trustees_composition",
    "source": "List of the Board of Trustees (BOT) as of EARIST 2025",
    "category": "University Governance and Administration",
    "topic": "Current List of the Board of Trustees",
    "content": "The governance of the Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST) is vested in the Board of Trustees, which serves as the highest policy-making body of the institution. The Board is composed of representatives from the Commission on Higher Education (CHED), the Philippine Senate and House of Representatives, government agencies (DOST and NEDA), the private sector, and key university stakeholders including alumni and the student body.\n\nThe specific composition of the Board of Trustees is as follows:\n\nExecitive Leadership:\nThe Chairman of the Board is Hon. Dr. Desiderio Apag, III, who serves in the capacity of Commissioner for the Commission on Higher Education (CHED). The Vice Chairman of the Board is Hon. Rogelio T. Mamaradlo, who serves as the EARIST President.\n\nLegislative Representation:\nThe Senate Committee on Education, Arts and Culture is represented by Hon. Alan Peter S. Cayetano. The Committee of Higher and Technical Education is represented by Hon. Mark O. Go.\n\nGovernment Agency Representation:\nThe Department of Science and Technology (DOST) is represented by Hon. Engr. Romelen T. Tresvalles, the DOST-NCR Director. The National Economic and Development Authority (NEDA) is represented by Hon. Hazel Iris S. Baliatan, who serves as Director IV of the Public Investment Staff.\n\nSectoral and Stakeholder Representation:\nThe Private Sector is represented by two members: Hon. Arnel S. Abrenica and Hon. Allen R. Buenaventura. The university alumni are represented by Hon. Agnes F. Amorin, the President of the EARIST Alumni Association Inc. The student body is represented by Hon. Carl Justine B. Dioquino, the President of the Federated EARIST Supreme Student Government (ISG). Ms. Gilda S. Familara serves as the official Board Secretary.",
    "keywords": [
      "Board of Trustees",
      "EARIST Administration",
      "CHED Commissioner",
      "Senate Committee on Education",
      "Student Regent",
      "Alumni President",
      "Governing Body",
      "University Officials"
    ]
  }
]