[
  {
    "id": "cit_faculty_staff_directory_complete",
    "source": "College of Industrial Technology (CIT) Faculty List ",
    "category": "College Directory",
    "topic": "College of Industrial Technology (CIT)",
    "content": "The College of Industrial Technology (CIT) has released its official directory of administration, department heads, and faculty members. The college is led by Dean Dr. Erwin P. Ordovez and Associate Dean Prof. Evelyn A. Gabas. The academic structure encompasses various specialized technology departments and a General Education unit.\n\nThe Automotive Technology Department is headed by Jordan A. Datu, with faculty members Jay C. Bernardo and Irving E. Bucao. The Mechanical Technology Department is led by Department Head Eldon P. Perez, supported by part-time faculty Erwin C. Barba. The Drafting Technology Department is headed by Reynante T. Tonido, with Cynthia M. Reblando serving as full-time faculty and Rolito A. Alcantara as part-time faculty.\n\nThe Electronics Technology Department is headed by Allan A. Sandoval. Its faculty roster includes Ferdinand P. Alvaro, Ryan Alexie L. Bairan, Ivan F. Castillano, and Dr. Erwin P. Ordovez. The Electrical Technology Department is led by Rolf Irwin C. Dangla Cruz, with faculty members Mario Manuel B. Doctor III and Roberto E. Reynoso. The Industrial Chemistry Department is headed by Ariel E. Tobias, with faculty member Evelyn A. Gabas and part-time instructor Merelyn A. Marcelo.\n\nThe Computer Technology Department is led by Department Head Joseph Angelo C. Tanuecoz, with faculty members Sherwin Keith T. Rivera and Dennis P. Ordovez. The HVAC-R (Heating, Ventilation, Air Conditioning, and Refrigeration) Department is headed by Luvisminda Marcelo, with Nacho B. Amac serving as part-time faculty.\n\nThe Food Trades Department is headed by Rhyca Mae C. San Juan. The faculty includes Rodita M. Buencuchillo, Maureen D. Basi, Marivir M. Pielago, and Mithos Arth M. Pielago. The Apparel and Fashion Technology Department is led by Desiree Joyce L. Bedia, with Janice P. Mangahas as faculty.\n\nThe General Education Department is headed by Derrick O. Peralta. The faculty members are Edwin Anglo, Sofia Dela Cruz, Daniel D. Dineros, Felipe K. Jamero, Richard K. Jamero, and Rowena M. Valladolid.",
    "keywords": [
      "College of Industrial Technology",
      "CIT Faculty",
      "Dean Ordovez",
      "Automotive Technology",
      "Electronics Technology",
      "Industrial Chemistry",
      "Food Trades",
      "Apparel and Fashion Technology",
      "General Education"
    ]
  }
]