[
  {
    "id": "ccje_faculty_staff_directory_complete",
    "source": "College of Criminal and Justice Education (CCJE) Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty and Administration of the College of Criminal and Justice Education (CCJE)",
    "content": "The College of Criminal and Justice Education (CCJE) has established its official faculty and staff directory, which outlines the administrative leadership, professional course instructors, general education faculty, and student support personnel. \n\nThe administration of the college is led by Dean Dr. Anabele Del Mundo-Riva. She is supported by Associate Dean Dr. May Liza Nera Cañas. Additionally, Dr. Juan Leonardo B. Britanico holds the position of Library and Extension Coordinator.\n\nThe faculty for Professional Courses is composed of both full-time and part-time instructors. Dr. Hassanour P. Cali serves as a Full-Time faculty member and holds the specific role of CSG Adviser. The department employs a significant number of Part-Time faculty members, including Dr. Dondon B. Maribbay, Prof. Braulio S. Basco, Prof. Edwin Brandon Gener, Prof. Daniel D. Garcia, Prof. Gonzalo Ricaplaza, and Prof. Marcelino Villanueva. Several attorneys also serve as Part-Time instructors, specifically Atty. Manolyn Collado, Atty. Georgian D. Pascua, and Atty. Jenalyn T. Baccay.\n\nThe General Education department within the CCJE includes a core team of Full-Time professors: Prof. Leonel S. Salvador, Prof. Esperanza M. Villena, Prof. Ma. Teresa Modesto, and Prof. Eugene Bayotas. Complementing the full-time staff are Part-Time instructors Prof. Godofredo Fajardo, Prof. Angelita S. Parlan, and Prof. Russie Perez. \n\nFor Student Support services, Ms. Chescka Jane Vitto is designated as the Student Assistant.",
    "keywords": [
      "College of Criminal and Justice Education",
      "CCJE Faculty",
      "Dean Del Mundo-Riva",
      "Criminology Instructors",
      "Professional Courses",
      "General Education Faculty",
      "College Administration"
    ]
  }
]