[
  {
    "id": "ced_faculty_staff_directory_complete",
    "source": "College of Education (CED) Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Services of the College of Education",
    "content": "The College of Education is administered by Dean Dr. Evangeline M. Sangalang, Associate Dean Dr. Ailene R. Tuzon, and College Secretary Jayson P. Payte, MAEd. The college is organized into various academic departments and service units, each led by specific heads and coordinators.\n\nThe academic departments and their respective faculty are as follows:\n\n**BSE – Science:** Headed by Raffy A. Murilla. Faculty members include Dr. Eleonor T. Salvador, Felisa M. Villanoy, Benjamin A. Haboc, and Arjay Advincula.\n\n**BSNED – Generalist:** Headed by Mathew N. Gamboa. Faculty members include Raymond D. Cansino and Daisy Lyn M. Dela Rosa.\n\n**BSE – Filipino:** Headed by Joseph C. Anggot. Faculty members include Dr. Eriberto R. Astorga Jr., Dr. Babylin J. Conti, Jayson P. Payte, and Emmanuel H. Montoya.\n\n**BSE – Mathematics:** Headed by Dr. Ailene R. Tuzon. Faculty members include Dr. Evangeline M. Sangalang, Daisy Mae R. Bongitwon, Elsa R. Cagatan, Lawrence C. Durban, Dr. Allan G. Quismundo, and Meriam L. Tria.\n\n**BTLED – Industrial Arts (I.A.):** Headed by Ernie M. Cabalu. Faculty members include Dr. Josie R. Sonio, Centrey L. Ramos, Ernesto C. Pacheco Jr., and Andre R. Gabumpa.\n\n**BTLED – Home Economics (H.E.):** Headed by Roselle Ghee E. Aranez. Faculty members include Renz Robert E. Salvador, Lara May G. Cornel, and Jessa Marie L. Sanchez.\n\n**General Education:** Headed by Dr. Conrado B. Blando. Faculty members include Angela M. Caaya, Virgel E. Diamante, Dr. Ruth Lareza A. Morales, and Evelyn M. Polison.\n\n**Professional Science:** Headed by Raffy A. Murilla. Faculty members include Jayson P. Payte, Renz Robert E. Salvador, Felisa M. Villanoy, Dr. Ernie M. Cabalu, and Mercy M. Mejica.\n\n**Teaching Internship:** The Faculty Coordinators for the internship program are Dr. Babylin J. Conti, Joseph C. Anggot, Dr. Ailene R. Tuzon, Raffy A. Murilla, Mathew N. Gamboa, and Dr. Ernie M. Cabalu.\n\nIn addition to academic roles, the College of Education manages specific Program Services led by the following Chairs:\n* **Student Government Services:** Dr. Conrado B. Blando.\n* **Alumni Affairs Services:** Raymond D. Cansino.\n* **Interfaith Services and Extension and Community Services:** Dr. Babylin J. Conti.\n* **Institute Review Center and Management Information System:** Lawrence C. Durban.\n* **Linkages, Career and Job Placement Services, and Guidance and Counselling Services:** Mathew N. Gamboa.\n* **Physical and Sports Development Services:** Raffy A. Murilla.\n* **Gender and Development Services:** Jayson P. Payte.\n* **Quality Assurance, COPCO:** Cintrey L. Ramos.\n* **Library Services:** Jessa Marie L. Sanchez.\n* **Research Development Services:** Dr. Ailene A. Tuzon.\n* **Building Administration and Property Custodian:** Dr. Josie R. Sonio.",
    "keywords": [
      "College of Education",
      "Dean Sangalang",
      "BSE Science",
      "BSNED Generalist",
      "BSE Filipino",
      "BSE Mathematics",
      "BTLED",
      "Faculty List",
      "Department Heads",
      "Program Chairs"
    ]
  }
]