[
  {
    "id": "chtm_faculty_staff_directory_complete",
    "source": "College of Hospitality and Tourism Management (CHTM) Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Departments of the College of Hospitality and Tourism Management",
    "content": "According to the provided faculty list for the College of Hospitality and Tourism Management (CHTM), the college is led by Dean Maria Rhoda D. Dinaga, DBA, with Tenie P. Lirazan, MBA serving as the College Secretary. The college is organized into two main departments: Hospitality Management and Tourism Management, supported by General Education faculty.\n\nThe Hospitality Management Department is headed by Loida R. Banzuelo, DBA. The core faculty includes Romeo D. Lim, DBA, Joselito D. Mabansag, DBA, and Jovan L. Yosa. Several faculty members hold specific administrative or coordinator roles: Jocelyn L. Aguas, MBA serves as the Adviser for Student Government; Dulce B. Aurelio, MAIE is the HRM Program Chair responsible for OJT and Job Placement; Tenie P. Lirazan, MBA acts as the Program Chair for Extension; Evan Join S. Magno, MBA is on the faculty; and Robert P. Mallon, MAEd serves as the Program Chair for Alumni Services.\n\nThe General Education Faculty associated with the college includes several Program Chairs: Jeffrey B. Villena, EL.D (Filipino & Research), Vircel E. Diamante, MAIP (Guidance and Counseling), Jonjon V. Pantaleon, MAT (Sports Development), and Matthew N. Gamboa (Library Services). Additional General Education faculty members are Arnold M. Bautista, MAE (EM), Edwin V. Tendero, Ed.D (EM), Angela Micaaya, MPA, and Dennis P. Ordovez, Ed.D (EA).\n\nThe Tourism Management Department is headed by Perlita M. Mallarimba. The core faculty consists of Percy Ann Elaine P. Jimenez, Ph.D, Moresa Joy V. Gregana, MIHTM, Mary Grace C. Santos, MPA, and Kristine Joy P. Castro. Additionally, Glessie M. Basa, MBA serves as the Program Chair for Gender And Development within this department.",
    "keywords": [
      "CHTM Faculty",
      "Hospitality Management",
      "Tourism Management",
      "Dean Dinaga",
      "Loida Banzuelo",
      "Perlita Mallarimba",
      "Program Chairs",
      "General Education Faculty"
    ]
  }
]