[
  {
    "id": "cas_faculty_staff_directory_complete",
    "source": "College of Arts and Sciences (CAS) Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Departments of the College of Arts and Sciences",
    "content": "The College of Arts and Sciences (CAS) has established its official directory of administration, program coordinators, and faculty across its various departments. The college leadership is headed by College Dean Dr. Rodora T. Oliveros and Associate Dean Prof. Dolores A. Nieto. Administrative support is provided by College Secretary Mr. Eleazar B. Bernales.\n\nThe college utilizes a team of Program Coordinators to manage specific functional areas:\n* **Research:** Dr. Roel P. Balayan\n* **Scientific Computing Research Laboratory:** Dr. Raymund M. Bolalin\n* **On-the-Job Training:** Dr. Jinamarlyn B. Doctor\n* **Guidance and Counseling, Gender and Development:** Prof. Ruth Lareza A. Morales\n* **Computer Laboratories:** Mr. Raynald C. Redondo\n* **Alumni Affairs:** Mr. Joneil G. Ponteros\n* **College Student Government:** Mr. Reenier Ledesma\n* **Extension Services:** Prof. Nerissa B. Capili\n\nThe academic structure of the College of Arts and Sciences is organized into four primary departments: General Education, Psychology, Applied Physics, and Mathematics.\n\nThe **General Education Department** faculty roster includes Dr. Joseph T. Moraca, Prof. Romeo B. Capucao Jr., Prof. Nerissa B. Capili, Prof. Dennis D. Mangubat, Dr. Carlito C. Biares, Mrs. Rosario U. Tanuecoz, Mr. Ricky G. Tebang, and Dr. Eugene S. Abdon.\n\nThe **Psychology Department** is led by Department Head Dr. Jinamarlyn B. Doctor. The faculty members include Dr. Lourdes B. Jusay, Prof. Ruth Lareza A. Morales, Dr. Rosel O. Cipriano, Ms. Devorah Ann V. Cornell, Prof. Myrtle P. Macam, and Ms. Jazmin B. Lasam.\n\nThe **Applied Physics Department** is led by Department Head Prof. Lester D. Bernardino. The faculty members include Dr. Raymund M. Bolalin, Mr. Hiromi Rivas, and Mr. Reenier Ledesma.\n\nThe **Mathematics Department** is led by Department Head Prof. Larex B. Tagalog. The faculty members include Dr. Roel P. Balayan, Dr. Jayson D. Tolentino, Mr. Raynald C. Redondo, Mr. Mark Ronoele R. Gonzalvo, Mr. Joneil G. Ponteros, and Mr. Eleazar B. Bernales.",
    "keywords": [
      "College of Arts and Sciences",
      "CAS Faculty",
      "Dean Oliveros",
      "General Education Department",
      "Psychology Department",
      "Applied Physics Department",
      "Mathematics Department",
      "Program Coordinators",
      "Faculty Directory"
    ]
  }
]