[
  {
    "id": "cbpa_faculty_staff_directory_complete",
    "source": "College of Business and Public Administration (CBPA) Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty, Administration, and Departments of the College of Business and Public Administration",
    "content": "According to the provided faculty list for the College of Business and Public Administration (CBPA), the college administration is led by Dean Willy O. Gapasin, DBA. The administrative team includes Associate Dean Chanda R. Tingga, DBA, and College Secretary Shiela C. Castillo, MBA.\n\nThe college is divided into several academic departments, each with specific leadership and faculty rosters. The BSBA Human Resource Management Department is headed by Charlene U. Escario, Ph.D. Its faculty members include Emerson G. Cabudol, DBA, Ronaldo F. Doroteo, DBA, Jeffrey E. Falogme, DBA, Cirni B. Gecosala, Ph.D., Michael F. Gibaga, DBA, Isaac O. Ochotorena, MBA, JD, and Hernan M. Oliveros, DBA.\n\nThe BSBA Marketing Management Department is led by Department Head Jane S. Isla, DBA. The faculty consists of Martin T. Aguilar, BA, Benigno A. Castillo, DPA, Belinda L. Cumpas, MBA, Michael Darwin D. Domingo, DBA, Hiromi T. Kikuchi, DBA, Joel D. Reyes, Ph.D., and Christian Andre M. Viril, MBA.\n\nThe Bachelor in Public Administration Department is headed by Marlenel Monterona, Ed.D., Ph.D., DEA. The faculty roster includes Eugene S. Abdon, DPA, Florinda DC. Bautista, MPA, Evelyn R. Celestial, DPA, Diana P. Dela Cruz, MPA, Manolo N. Delos Reyes, DPA, Yolanda A. Lara, DPA, Arci V. Manangan, DPA, Erick P. Mante, MPA, Keiven M. Marcelo, DPA, Jackylin G. Pido, MPA, and Christiane Villanueva, MPA.\n\nThe BS in Office Administration Department is headed by Chanda R. Tingga, DBA. Faculty members include Analiza G. Asistol, MPA, Aguida V. Cabreros, DBA, Shiela C. Castillo, MBA, Noemi D. Cruz, MBA, Irma F. Filler, MBA, Jolly Joey B. Flora, MBA, Estrellita S. Glodo, MBA, JD, and Marvin P. Honrado, MBA.\n\nThe BS in Entrepreneurship Department is led by Department Head Jhon Ven Saint L. Pasahol, DBA. Its faculty includes Rommel DG. Aquino, MAT, Melba S. Asuncion, DBA, Annalyn A. Buenaseda, MBA, Gonzalo G. David III, DBA, Ma. Lourdes H. Gomez, DBA, Ma. Theresa G. Maddagan, DBA, Cynthia A. Manalad, DBA, and Maria Teresa F. Modesto, PhD.\n\nThe General Education Department within the college is headed by Ana May A. Pagaling, Ed.D. The faculty members are Sofia Del A. Cruz, MAEd, Cesar Garcia, Ed.D., Dasha Marie G. Reodica, Ed.D., and Fernando Filler, MAEd.",
    "keywords": [
      "College of Business and Public Administration",
      "CBPA Faculty",
      "Dean Gapasin",
      "BSBA Human Resource Management",
      "BSBA Marketing Management",
      "Public Administration",
      "Office Administration",
      "Entrepreneurship",
      "General Education",
      "Department Heads"
    ]
  }
]