[
  {
    "id": "ce_dept_faculty_roster",
    "source": "College of Engineering (CEN) Faculty List ",
    "category": "College Directory",
    "topic": "College of Engineering",
    "content": "The College of Engineering has released the faculty roster for the Civil Engineering (CE) Department. This department is comprised of a diverse group of professionals, including Doctors, Professors, and Engineers. The faculty list includes the following individuals:\n\n**Doctoral Faculty:**\n* Dr. Nerissa M. De Guzman\n* Dr. Bryan V. Bantayan\n\n**Professors:**\n* Prof. Meriam L. Tria\n\n**Engineering Faculty:**\nThe department is heavily staffed by engineers, including Engr. Jorge P. Bautista, Engr. Luvisminda D. Marcelo, and Engr. Dianlyn P. Espirtu (also listed as Engr. Dinalyn Espirtu). Other key faculty members include Engr. Antonio Carmelito Lizada, Engr. Jan Vicent Ku, Engr. Nelson P. Duyan, Engr. Ronald Baral, and Engr. Samuel Manatad.\n\nThe roster also lists Engr. Luigi Rr. Busa, Engr. Apolinario S. Sollano, Engr. Emmanuel M. Morales, Engr. Allen Yap, Engr. Allen Grey Carlos, Engr. Jerome Saltorio, Engr. Romeo Fernandez, and Engr. Sinifroso Roque. \n\nAdditional faculty members include Engr. Minerva C. Zoleta, Engr. Ador G. Utulo, Engr. Bernard C. Fabro, Engr. Jose C. Felipe, Engr. Caroline J. Agaab, Engr. John Andrew A. Tiria, Engr. Mary Jane L. Gabriel, and Engr. Jes Andre Trillana.\n\nFurther rounding out the department are Engr. Jay-R H. Menenes, Engr. Allan Q. Quismundo, Engr. Roberto M. Liwanag, Engr. Mark Niño B. Javier, Engr. Luisito Tolentino, Engr. Bernadito L. Fabro, Engr. Robel A. Nomorosa, Engr. John Dennice C. Ganotisi, Engr. Lydia N. Era, Engr. Jerrymias G. Avergonzado, Engr. Jose P. Labayna, Engr. Efren Pantoja, Engr. Winifredo Gonzales, Engr. Ket Chua, Engr. John Kelly Josue, and Engr. Romeo Tolentino.",
    "keywords": [
      "Civil Engineering Department",
      "CE Faculty",
      "College of Engineering",
      "Engr. Jorge P. Bautista",
      "Dr. Nerissa M. De Guzman",
      "Faculty Roster"
    ]
  }
]