[
  {
    "id": "caefa_faculty_staff_directory_complete",
    "source": "CAEFA Faculty List ",
    "category": "College Directory",
    "topic": "Complete Faculty and Administration of the College of Architecture and Fine Arts (CAEFA)",
    "content": "According to the provided faculty directory, the College of Architecture and Fine Arts (CAEFA) is administered by Dean Ar. Diane A. Jose. Supporting the administration are College Secretary Prof. Jay-Ar Flores and Administrative Assistant Prof. Louie Pereira. The college is organized into five distinct academic sections: Interior Design, Painting, Visual Communication, Architecture, and General Education.\n\nThe **BS Interior Design Department** is led by Department Head Dr. Esmeralda Ayag. The faculty members in this department include Dr. Gladys Bungar-Espejo, Dr. Mary Ann Capilitan, Dr. Jayson Chavez, and Dr. Ma. Kristhel Mangaring.\n\nThe **BFA Painting Department** is headed by Prof. Teresa Herrera. The faculty roster consists of Full-Time instructors Prof. Michael Jay Ramos and Prof. Roger Ramos, alongside Part-Time instructor Prof. Wendel Candawan.\n\nThe **BFA Visual Communication Department** is also headed by Prof. Teresa Herrera. The Full-Time faculty members are Prof. Aldwin Amorin, Prof. John Renzi Gamilla, Prof. Rowena Jasmin-Macahiya, Prof. Louie Pereira, and Prof. Blue Archimedes Santos. The department also employs Part-Time instructors Prof. Cesar Evangelista and Prof. Denver Page.\n\nThe **BS Architecture Department** lists Ar. Gerald Allan Adane as the Dean (serving as the department lead). The Full-Time faculty includes Ar. Rolan Alamillo, Ar. Maria Lourdes De Vera - Francisco, Ar. Setien Herrera, Ar. Diane Jose, Ar. John Vincent Lopez, and Ar. Joey Tan. The Part-Time faculty members are Ar. John Arvin Chua, Ar. Maundelito Florendo, and Ar. Christian Joy Recio.\n\nThe **General Education Department** within the college includes Full-Time faculty members Prof. Jay-Ar Flores and Prof. Juan Lauro Magugat. They are supported by Part-Time faculty members Prof. Carina Garcia and Prof. Edwin Jambre Jr.",
    "keywords": [
      "College of Architecture and Fine Arts",
      "CAEFA Faculty",
      "Dean Diane Jose",
      "BS Interior Design",
      "BFA Painting",
      "BFA Visual Communication",
      "BS Architecture",
      "General Education",
      "Faculty Directory"
    ]
  }
]