[
    {
        "id": "earist_executive_officials_deans_directors",
        "source": "EARIST Directory / Website Update",
        "category": "Directory of Officials",
        "topic": "List of Executive Officials, Deans, and Service Directors",
        "content": "Under the EARIST Organizational Structure, the following individuals serve as Executive Officials, Deans, and Directors of various services. The University Telephone Trunk Line is (028) 243 9437. The Office of the President is led by Dr. Rogelio T. Mamaradlo, who serves as the President and the Interim Dean of the College of Engineering. His contact details are rmamaradlo@earist.edu.ph (Local 101). The Executive Vice President and OIC-Dean of the Graduate School is Dr. Allan Q. Quismundo (aqquismundo@earist.edu.ph, Local 101). The Vice President for Academic Affairs is Dr. Eric C. Mendoza (ecmendoza@earist.edu.ph, Local 131).\n\nThe Administration and Finance division is headed by Dr. Yolanda A. Lara, Vice President for Administration and Finance and Director of Financial Management Services (yalara@earist.edu.ph, Local 118). The College & Board Secretary is Ms. Gilda S. Familara (gsfamilara@earist.edu.ph, Local 125).\n\nThe Academic Deans leading the various colleges include: Ar. Diane A. Jose, Dean of the College of Architecture and Fine Arts (dajose@earist.edu.ph, Local 107); Mrs. Rodora T. Oliveros, Dean of the College of Arts & Sciences (rtoliveros@earist.edu.ph, Local 108); Dr. Willy O. Gapasin, Dean of the College of Business and Public Administration (wogapasin@earist.edu.ph, Local 109); Dr. Jesus S. Paguigan, Dean of the College of Computing Studies (jspaguigan@earist.edu.ph, Local 151); Dr. Anabel D. Riva, Dean of the College of Criminal Justice (adriva@earist.edu.ph, Local 114); Dr. Evangeline M. Sangalang, Dean of the College of Education (emsangalang@earist.edu.ph, Local 110); Dr. Maria Rhoda D. Dinaga, Dean of the College of Hospitality and Tourism Management (mddinaga@earist.edu.ph, Local 112); and Dr. Erwin P. Ordovez, Dean of the College of Industrial Technology (epordovez@earist.edu.ph, Local 113). The EARIST Cavite Campus is managed by Administrator Dr. Agnes N. Coo (ancoo@earist.edu.ph, Local 101).\n\nThe Directors of various institutional services include: Dr. Giovanni L. Ahunin, Director of Administrative Services (glahunin@earist.edu.ph, Local 103); Dr. Marlene M. Monterona, Director of Research Development Services (mmmonterona@earist.edu.ph, Local 117); Dr. Eriberto R. Astorga Jr., Director of Extension and Community Services (erastorga@earist.edu.ph, Local 115); Ms. Jocelyn R. Moreno, Director of Production Services (jrmoreno@earist.edu.ph, Local 144); Ms. Carina N. Romaquin, Director of Library Services (cnromaquin@earist.edu.ph, Local 122); Mr. Blue Archimedes B. Santos, Director of the National Service Training Program (NSTP) and Chief of Security Services (bbsantos@earist.edu.ph, Local 146); Mr. Benigno A. Castillo, Director of Quality Assurance (bacastillo@earist.edu.ph, Local 105); Ms. Julie Ann O. Espiritu, Director of Student Registration and Records Management Services (joespiritu@earist.edu.ph, Local 133); Ms. Agnes F. Amorin, Director of Student Affairs and Services (afamorin@earist.edu.ph, Local 127); Mr. Virgel E. Diamante, Director of Instruction Services (vediamante@earist.ph.education); Dr. Melba S. Asuncion, Director of Internal Audit Services (msasuncion@earist.edu.ph, Local 138); Engr. Roberto M. Liwanag, Director of Planning Services (rmliwanag@earist.edu.ph, Local 102); Ar. Maundelito S. Florendo, Director of the Project Management Unit (iipdo@earist.edu.ph, Local 148); Engr. Ronald B. Baral, Director of Management Information Services (rbbaral@earist.edu.ph, Local 136); Engr. Jerome M. Saltorio, Director of Information and Public Affairs Services, Intellectual Property Management Office, and Innovation Technology Support Office (jmsaltorio@earist.edu.ph, Local 134); Dr. Joselito D. Mabansag, Director of International Affairs and Linkages Management Services and OIC of Institutional Events Management and Protocol (jdmabansag@earist.edu.ph, Local 121); and Dr. Hiromi T. Kikuchi, Director of the Business Development Center (htkikuchi@earist.edu.ph, Local 149).",
        "keywords": [
            "EARIST Officials",
            "College Deans",
            "Executive Vice President",
            "Academic Affairs",
            "Administration and Finance",
            "Service Directors",
            "Cavite Campus Administrator",
            "Organizational Structure",
            "Contact Directory"
        ]
    }
]