[
    {
    "id": "earist_chiefs_of_offices_contact_info",
    "source": "EARIST Directory / Website Update",
    "category": "Directory of Officials",
    "topic": "List of Chiefs of Offices and General Contact Information",
    "content": "In addition to the Executive Officials, the EARIST administration includes Chiefs of Offices who manage specific operational units, as well as legal and auditing personnel. The Chiefs of Offices are as follows:\n\nMr. Ferdinand DP. Alvaro serves as the Chief of Admissions Services (fpalvaro@earist.edu.ph). Dr. Peggy M. Ochoa is the Chief of Medical and Dental Services (pmochoa@earist.edu.ph, Local 124). Mrs. Amparo M. Morales serves as the OIC-Chief of Human Resource Management Services (ammorales@earist.edu.ph, Local 120). Ms. Dana J. Roldan is the Chief of Records Management Services (djroldan@earist.edu.ph, Local 132). Ms. Hiromi T. Kikuchi serves as the Chief of Property Management Services (htkikuchin@earist.edu.ph, Local 130). Ms. Mary Antonette A. Aquino is the Chief of Budget Services (maaquino@earist.edu.ph, Local 118). Ms. Joy B. Rulloda is the Chief of Cash & Disbursement Services (ecgubaton@earist.edu.ph, Local 106). Ms. Mercy M. Mejica is the Chief of Career Education and Job Placement Services (mmmejica@earist.edu.ph). Mr. Generoso A. Maningat is the Chief of Payroll Services (gamaningat@earist.edu.ph, Local 118). Mrs. Bernadette P. Catalan is the Chief of Procurement Services (bpcatalan@earist.edu.ph, Local 129). Mr. Edgardo R. Sison is the Chief of Web Development Services (ersison@earist.edu.ph, Local 144). Mr. Evan John S. Magno is the Chief of the Culture and Arts Division and Inter-Faith Services (ejsmagno@earist.edu.ph, Local 143).\n\nDr. Georgia P. Ramirez leads the Guidance, Counseling and Testing Services (gpramirez@earist.edu.ph, Local 145). Mr. Renz Robert E. Salvador is the Chief of the Institutional Review Center (rresalvador@earist.edu.ph). Mr. Christopher T. Buñag is the Chief of Sport Development (chiefsportsdev@earist.edu.ph, Local 128). Mr. Pedro Rommel D. Kirong is listed at Local 150. Engr. Emmanuel M. Morales is the Chief of Physical Plant and General Services (emmorales@earist.edu.ph). Ms. Ronalyn Joy E. Mercado is the Chief of Accounting Services (rjemercado@earist.edu.ph). Dr. Josie R. Sonio is the Chief of Faculty Reclassification, Promotion and Evaluation (jrsonio@earist.edu.ph). Mr. Virgel E. Diamante serves as the Chief of Publication Services (vediamante@earist.edu.ph). Atty. Alyssa C. Cabula is the Director of the Legal Unit (accabula@earist.edu.ph, Local 153). Auditor Juvy C. De Guzman represents the Commission On Audit (jcdeguzman@earist.edu.ph, Local 135). Mr. Richard Jamero represents the Union (rjamero@earist.edu.ph, Local 141).\n\nGeneral Contact Information for EARIST:\nThe EARIST Institute is located at Nagtahan St, Sampaloc, Manila, 1008 Metro Manila. The official general email is earistofficial1945@gmail.com. The primary phone number is (028) 243-9467, and the trunk line is (028) 243 9437.",
    "keywords": [
      "Chief of Offices",
      "Admissions Chief",
      "Medical and Dental",
      "Human Resources",
      "Guidance Counseling",
      "General Contact Info",
      "EARIST Address",
      "EARIST Phone Number",
      "Commission on Audit",
      "Legal Unit"
    ]
  }
]