[
  {
    "id": "sas_organizational_structure_2025",
    "source": "Student Affairs and Services (SAS) Organizational Structure 2025",
    "category": "Student Affairs and Services",
    "topic": "Complete Organizational Structure and Leadership",
    "content": "According to the official Student Affairs and Services (SAS) Organizational Structure for the year 2025, the department operates under a defined hierarchy starting with the central institute leadership. At the executive level, Dr. Rogelio T. Mamaradlo serves as the Institute President, while Dr. Eric C. Mendoza holds the position of Vice President for Academic Affairs. Ms. Agnes F. Amorin serves as the Director of Student Affairs and Services (SAS), directly overseeing the various specialized units dedicated to student support.\n\nThe specific service divisions and their respective leadership are designated as follows:\n\n**Scholarship Services:** This unit is led by Program Chair Mr. Martin T. Aguilar, supported by staff member Mr. Ivan Franz E. Dino.\n\n**Culture and Faith:** Mr. Evan John S. Magno holds dual responsibilities as the Chief of the Culture and Arts Division and the Chief of Inter Faith Services.\n\n**Sports and Physical Education:** The athletic programs are managed by Mr. Christopher T. Bunag, who serves as the Chief of Sports Development and Physical Education.\n\n**Admissions and Media:** Mr. Ferdinand DP. Alvarro is the Chief of Admission Services and Audio-Visual Services.\n\n**Career Services:** Professional development and employment support are led by Ms. Mercy M. Medica, the Chief of Career, Education, and Job Placement Services.\n\n**Counseling and Testing:** Mental health and psychological assessment services are headed by Chief Dr. Georgia P. Ramirez, RGC. She is assisted by Guidance Counselor Ms. Rodalyn S. Mamaclay, RGC.\n\n**Leadership Development:** The Leadership Division is directed by Program Head Ms. Patricia Anne P. Delina, with Ms. Hyacinth Joy C. Tolmulto serving as Staff.\n\n**Publications:** Mr. Virgel E. Diamante serves as the Chief of Student Publication and Yearbook.",
    "keywords": [
      "Agnes Amorin",
      "SAS Director",
      "Scholarship Services",
      "Guidance Counselor",
      "Sports Development",
      "Admission Services",
      "Student Publication",
      "Leadership Division",
      "Career Placement",
      "Organizational Chart"
    ]
  }
]