[
  {
    "id": "ulnayan_bookstore_inventory_price_list",
    "source": "ULNAYAN CONSUMER GOODS TRADING & BOOKSTORE Price List",
    "category": "Student Services - Bookstore",
    "topic": "Complete Textbook Price List and Store Hours",
    "content": "According to the official price list from ULNAYAN CONSUMER GOODS TRADING & BOOKSTORE, the store operates from Monday to Thursday between 8:00 AM and 4:00 PM. The bookstore offers a wide range of textbooks categorized into Business & Management and General Education.\n\nUnder the **Business & Management** category, the available titles and their corresponding prices are: 'Accounting the Language of Business' at 400; 'Administrative and Office Management' at 480; 'Business Principles and Merchandising' at 400; 'Business Laws and Regulation' at 700; 'Business Opportunities' at 460; 'Business Plan' at 450; 'Entrepreneurial Behavior Growth Mindset' at 420; 'Financial Management' at 610; 'Global Ventures: A Guide to International Business and Trades' at 420; 'Human Resource Management' at 420; 'Income Taxation' at 620; 'Introduction to Consumer Behavior' at 420; 'Laws on Obligations and Contracts' at 550; 'Legal Frameworks Navigating Business Law' at 510; 'Marketing Research' at 400; 'Mastering Pricing and Costing Strategies' at 370; 'Navigating the Landscape of Marketing Research' at 370; 'Obligations and Contracts' at 670; 'Operations Management' at 750; 'Principles of Total Quality Management' at 370; 'Project Mastery' at 440; 'Retail Management' at 490; 'Strategic Management' at 700; 'Strategic Management Philippine Business Landscape' at 370; 'The Guide for Managing Logistics' at 500; 'The Guidebook for Managing Logistics' at 520; 'The Ultimate Guide to E-Commerce' at 540; 'Worktext in Basic and Advanced Keyboarding' at 320; and 'Worktext in Shorthand Machine' at 330.\n\nUnder the **General Education** category, the available titles and prices are: 'Algebra–Trigonometry' at 340; 'Art Appreciation for Tertiary Education' at 360; 'Communicative Proficiency for Business Correspondence & Research Writing' at 360; 'Contemporary World' at 300; 'Differential Calculus' at 340; 'Discovering Knowledge in Information Technology Era' at 380; 'Entrepreneurship & Cooperatives' at 320; 'Environmental Science' at 340; 'Ethics for College Students' at 300; 'Filipino sa Ibat Ibang Disiplina' at 280; 'Integral Calculus' at 340; 'Kontekstuwalisadong Filipino' at 390; 'Mathematics in the Modern World' at 350; 'Panitikan ng Pilipinas' at 350; 'Practical Data Science' at 340; 'Purposive Communication' at 360; 'Readings in Philippine History' at 350; 'Rizal Life Works & Writings' at 360; 'Science, Technology & Society' at 320; 'Social Responsibilities and Good' at 350; and 'Understanding the Self' at 370.",
    "keywords": [
      "ULNAYAN Bookstore",
      "Textbook Prices",
      "Business Textbooks",
      "General Education Textbooks",
      "Store Hours",
      "Accounting Books",
      "Management Books"
    ]
  },
  {
    "id": "uniform_shop_price_list_complete",
    "source": "Uniform Price List ",
    "category": "Student Services - Uniform Shop",
    "topic": "Complete Price List for Institutional and P.E. Uniforms",
    "content": "According to the official Uniform Price List provided by the institution, the pricing structure for student uniforms is categorized by type—Institutional Male, Institutional Female, and Physical Education (P.E.)—and further broken down by specific size ranges. \n\nFor the **Male Institutional Uniform**, the pricing is as follows: The cost for Small and Medium sizes is set at ₱1,050.00. For students requiring Large or Extra Large (XL) sizes, the price increases to ₱1,100.00. The larger sizes of 2XL and 3XL are priced at ₱1,150.00, while the largest available sizes, 4XL and 5XL, are sold for ₱1,200.00.\n\nThe **Female Institutional Uniform** follows a slightly different pricing tier. For female students, the Small and Medium sizes are available at a cost of ₱950.00. The Large and XL sizes are priced at ₱1,000.00. For those requiring 2XL or 3XL sizes, the cost is ₱1,050.00, and the largest sizes of 4XL and 5XL are priced at ₱1,150.00.\n\nRegarding the **P.E. Uniform**, which is applicable to students across the board, the price list designates the following costs based on size: Small and Medium P.E. uniforms are priced at ₱900.00. The Large and XL sizes cost ₱950.00. For 2XL and 3XL sizes, the price is ₱1,000.00. The 4XL and 5XL sizes are available for ₱1,050.00. Additionally, the P.E. uniform offers extended sizing options, with 6XL and 7XL sizes available for ₱1,100.00.",
    "keywords": [
      "Uniform Prices",
      "Male Uniform Cost",
      "Female Uniform Cost",
      "PE Uniform Cost",
      "Uniform Sizes",
      "Student Services"
    ]
  },
  {
    "id": "earist_institutional_uniform_components_list",
    "source": "Uniform Requirements List",
    "category": "Student Services - Uniform Policy",
    "topic": "Detailed Composition of Male and Female Institutional Uniforms",
    "content": "The official uniform guidelines for the Eulogio 'Amang' Rodriguez Institute of Science & Technology (EARIST) mandate specific components for the Institutional Uniform, differentiated by gender. \n\nFor the **Male Institutional Uniform**, the attire consists of a Maroon Short Sleeves Polo as the upper garment, paired with Beige Slacks as the lower garment. To ensure proper institutional identification, the uniform must include the Earist Logo Pin and the Earist Logo Patch. Furthermore, male students are required to wear the official College I.D. Lace and display their I.D. Card at all times.\n\nFor the **Female Institutional Uniform**, the requirements feature an inverted color scheme regarding the garments. Female students must wear a Beige Short Sleeves Blouse as the upper garment, paired with Maroon Slacks. Similar to the male requirements, the female uniform includes mandatory accessories: the Earist Logo Pin and the Earist Logo Patch. The standard requirement for student identification also applies, necessitating the use of the College I.D. Lace and the I.D. Card.\n\nIn summary, while both uniforms share the same mandatory accessories (Logo Pin, Logo Patch, I.D. Lace, and I.D. Card), the clothing components differ significantly in color and cut: males wear a maroon top with beige bottoms, whereas females wear a beige top with maroon bottoms.",
    "keywords": [
      "Male Uniform Components",
      "Female Uniform Components",
      "Maroon Polo",
      "Beige Slacks",
      "Beige Blouse",
      "Maroon Slacks",
      "Logo Pin",
      "ID Lace"
    ]
  },
  {
  "id": "mis_portal_advisory_detailed_recovery_admissions_role",
  "source": "Resolving Student Portal Issues",
  "category": "Management Information Services (MIS) Support",
  "topic": "Detailed Procedures for Portal Access, Password Recovery, ECAT Admissions, and MIS Functions",
  "content": "The Management Information Services (MIS) Department has issued a comprehensive advisory regarding the usage and troubleshooting of the EARIST Student Portal, which is accessible online at **earistweb.pinnacle.com.ph**. This platform serves as the central digital hub for academic data management for both current students and incoming applicants.\n\n**1. Password Recovery and Access Protocols**\nStudents encountering login issues, such as forgotten passwords, are advised to follow a two-tiered support system:\n* **Tier 1: Online Self-Service Recovery.** Students should first attempt to recover their account via the portal's 'Forgot Password' feature. This automated process requires the user to input their registered **email address** and **birth year**. Upon successful validation, the system will automatically dispatch password reset instructions to the student's email.\n* **Tier 2: In-Person MIS Support.** If the online method fails, or if the student faces complex technical issues (e.g., missing data or system errors), they must seek immediate assistance at the MIS Office. The office is located on the **4th Floor of the College of Computer Studies (CCS) Building**. \n\n**Strict Identity Verification:** For in-person support, security protocols strictly mandate that students present their valid **Student ID** and current **Certificate of Registration (COR)**. MIS staff are authorized to decline requests without these documents to prevent unauthorized access.\n\n**2. Admissions for Incoming Students**\nThe Student Portal is also the designated gateway for the **EARIST College Admission Test (EARISTCAT/ECAT)**. Incoming students must utilize the portal to:\n* Register for the admission test.\n* Browse available academic programs.\n* Select their preferred courses based on current availability.\n\n**3. The Role of MIS**\nThe MIS is formally defined as the technical unit responsible for the institution's digital infrastructure. It manages the intersection of critical student data (grades, schedules, personal information) and software systems, acting as the primary authority for resolving all access and integrity issues related to the Student Portal.",
  "keywords": [
    "MIS",
    "Management Information Services",
    "earistweb.pinnacle.com.ph",
    "Student Portal",
    "password recovery",
    "forgot password",
    "email verification",
    "birth year",
    "CCS Building",
    "4th Floor",
    "identity verification",
    "COR",
    "Certificate of Registration",
    "ECAT",
    "EARISTCAT",
    "admission test",
    "course selection",
    "technical support",
    "digital infrastructure"
  ]
},
  {
    "id": "earist_registrar_document_procedures_2025",
    "source": "Student Experience Guide (2025 Update)",
    "category": "Academic Records & Registrar Services",
    "topic": "Procedures for Requesting Certified Documents Certificate of Registration (COR) Copy Of Grades (COG) / Report of Grades (ROG) and Certified True Copy (CTC) at EARIST Manila Campus",
    "content": "To obtain certified documents at EARIST Manila Campus, follow these specific procedures based on the document type:\n\n**Procedure for Certificate of Registration (COR) with Certified True Copy (CTC)**\nTotal Cost: ₱40.00 (₱20.00 reprint + ₱20.00 CTC seal)\n1. **Request:** Go to the SARRMS window (Registrar) and request a 'COR with CTC' to get a Request Slip.\n2. **Payment:** Proceed to the Cashier's Office, pay the ₱40.00 fee, and secure an Official Receipt.\n3. **Retrieval:** Return to the Registrar to retrieve the printed Original COR.\n4. **Sign & Copy:** Immediately sign the 'Student's Signature' line on the Original COR. Then, make a clear photocopy of this signed document at a nearby facility.\n5. **Verification:** Submit both the signed Original COR and the photocopy to the Registrar to have the CTC seal applied.\n\n**Procedure for Copy/Report of Grades (COG/ROG) with Certified True Copy (CTC)**\nTotal Cost: ₱40.00 per semester (₱20.00 Grade Sheet + ₱20.00 CTC seal)\n1. **Request:** Go to the SARRMS window and request a 'Copy of Grades with CTC.' You must explicitly state the specific Academic Year and Semester needed (e.g., 1st Year, 2nd Sem, A.Y. 2023-2024).\n2. **Payment:** Pay the calculated amount at the Cashier (e.g., requesting two semesters costs ₱80.00).\n3. **Processing:** Return the Request Slip and Official Receipt to the Registrar.\n4. **Claiming:** Wait for your name to be called. The Report of Grades (ROG) will be released with the CTC seal already stamped.\n\n**Operational Logistics & General Information**\n* **Location:** SARRMS (Student Academic Records Management System) is located at the Office of the Registrar, Ground Floor, Main Building.\n* **Cut-Off Times:** Avoid visiting around 12:00 PM due to strict lunch breaks. The cut-off for new requests or payments typically occurs by 1:00 PM.\n* **Processing Time:** Estimated between 1 to 2 hours.\n* **Pinnacle Portal vs. Official Documents:** While grades are viewable on the Pinnacle Student Portal, official use (scholarships/employment) requires these on-site signed requests.",
    "keywords": [
      "SARRMS",
      "Registrar",
      "COR",
      "COG",
      "ROG",
      "CTC",
      "certified true copy",
      "transcript",
      "fees",
      "Manila Campus",
      "procedure",
      "cut-off time",
      "Pinnacle Portal",
      "2025 update"
    ]
  },
  {
    "id": "earist_campus_directory_office_locations",
    "source": "EARIST Campus Directory",
    "category": "Campus Map and Directory",
    "topic": "Complete Directory of Academic Colleges and Administrative Offices",
    "content": "The EARIST Campus Directory provides a comprehensive guide to the physical locations of all academic colleges, administrative offices, and student services across the institute's primary buildings. This directory outlines exactly where specific departments and colleges are situated.\n\n**CEAFA Building Locations**\nThe CEAFA Building houses several key academic and service units. The Medical and Dental Services are located on the 1st Floor of the CEAFA Building. The CEN College of Engineering is located on the 1st Floor, 2nd Floor, 4th Floor, and 5th Floor of the CEAFA Building. The Office of the Commission of Audit is located on the 2nd Floor of the CEAFA Building. The CAFA College of Architecture and Fine Arts is located on the 3rd Floor of the CEAFA Building. The Physical Education, Sports Development, and Athletic Services are located on the 6th Floor of the CEAFA Building.\n\n**CIT Building Locations**\nThe CIT Building is the primary hub for industrial technology and hospitality programs. The CIT College of Industrial Technology is located on the 1st Floor, 2nd Floor, 3rd Floor, and 4th Floor of the CIT Building. The Office of the Research Development and Production is located on the 2nd Floor of the CIT Building. The CHTM College of Hospitality Management is located on the 5th Floor of the CIT Building (Hostel area). The EARIST Hostel is also situated within the CIT Building.\n\n**Library / ICT Building Locations**\nThis building focuses on information services. The EARIST Museum is located on the 1st Floor of the Library / ICT Building. The Library Services are located on the 2nd Floor and 3rd Floor of the Library / ICT Building. The Office of the Management Information System and Technology Services (MIST) is located on the 4th Floor of the Library / ICT Building.\n\n**Old Laboratory High School Building Locations**\nThis building houses administrative and procurement services. The Instruction Services, Procurement Services, and Property Management Services are located on the 1st Floor of the Old Laboratory High School Building. The 2nd Floor houses the Office of the Vice President for Administration and Finance, the Office of the Vice President for Planning, Research, Extension and Production, the Office of the Management Internal Control and Audit Services, the Office of the Quality Assurance, and the Office of the Bids and Awards Committee.\n\n**Administration Building Locations**\nThe Administration Building serves as the central executive hub. The Financial Management Services and Human Resource Office are located on the 1st Floor of the Administration Building. The Office of the President, the Office of the Planning Services, and the Institutional Infrastructure Planning and Development Office are located on the 2nd Floor of the Administration Building. The Office of the Records Services and the Office of the Vice President are located on the 3rd Floor. The Amphi-Theater is located on the 4th Floor of the Administration Building.\n\n**NUDAS Building Locations**\nThe NUDAS Building contains various colleges and student amenities. The Canteen and Motorpool and Transportation Services are located on the 1st Floor of the NUDAS Building. The CBPA College of Business Administration is located on the 2nd Floor of the NUDAS Building. The CED College of Education is located on the 3rd Floor of the NUDAS Building. The CAS College of Arts and Sciences is located on the 4th Floor of the NUDAS Building.\n\n**REGALA Building Locations**\nThe REGALA Building hosts hospitality and criminology programs. The CHTM College of Hospitality Management is located on the 1st Floor of the REGALA Building. The CBPA College of Public Administration and the CCJE College of Criminal Justice Education (housed within Criminology) are located on the 2nd Floor of the REGALA Building. The CED College of Education is located on the 3rd Floor of the REGALA Building.\n\n**APILADO Building Locations**\nThe APILADO Building provides student affairs and external services. The Cash and Disbursement Services (Cashier's Office), National Service Training Program Security Services, Office of the Extension and External Affairs Services, Office of the Student, Admission, Registration and Records Management Services (Registrar), Office of the Student Affairs Services (OSAS), and Counseling and Testing Service are all located on the 1st Floor of the APILADO Building. The Information and Public Affairs Services, Office of the Administrative Services, and Office of the Property Management Services are located on the Mezzanine of the APILADO Building.",
    "keywords": [
      "CEN",
      "CIT",
      "CAFA",
      "CAS",
      "CHTM",
      "CBPA",
      "CED",
      "CCJE",
      "Medical Dental",
      "Cashier",
      "Registrar",
      "OSAS",
      "Campus Map",
      "Office Directory",
      "Building Floors",
      "Library",
      "Engineering",
      "Architecture",
      "Industrial Technology"
    ]
  }
]