[
  {
    "id": "lib_history_development",
    "source": "EARIST Website",
    "category": "Library Services & Rules",
    "topic": "Library History and Infrastructure",
    "content": "Under the section Library History, the EARIST Library began as the 'Amang' Foundation Library, initially occupying a room on the third floor of the Apilado Building under the supervision of Ms. Corazon P. Villafania. In 1986, to accommodate a growing student population, it transferred to the second floor of the Regala Building, serving as the central library with Dr. Flocerfida M. Doña as chief librarian. By 2002, per the directive of President Dr. Maura V. Bautista, the central library was devolved to different colleges.\n\nFollowing AACCUP recommendations, a four-story building was constructed in 2006. As of 2015, the building's layout is as follows: the Ground Floor houses the EARIST Museum; the Second Floor contains the General Circulation and Filipiniana Section Library; the Third Floor houses the Graduate School, Periodicals Section, and Theses Section; and the Fourth Floor is the Information Technology Center (ITC), serving as the Audio-Visual or Multimedia Center and Learning Commons.",
    "keywords": [
      "Amang Foundation Library",
      "Regala Building",
      "library building layout",
      "Filipiniana Section",
      "Graduate School Library",
      "EARIST Museum"
    ]
  },
  {
    "id": "lib_vision_mission_objectives",
    "source": "EARIST Website",
    "category": "Library Services & Rules",
    "topic": "Vision, Mission, and Objectives",
    "content": "According to the Library Vision and Mission statements, the EARIST Library is envisioned as a resource center of quality information designed to serve stakeholders in the pursuit of academic excellence. Its mission is to provide services and materials that are accessible, significant, and appropriate for library users.\n\nThe specific objectives of the library are to: support the Institute's program in its instructional, research, and information needs; provide adequate information resources and facilities to the academic community to help achieve the school's goals; and develop, enrich, and maintain the library collection to meet the needs of the curriculum and school programs.",
    "keywords": [
      "library vision",
      "library mission",
      "instructional support",
      "research support",
      "collection development"
    ]
  },
  {
    "id": "lib_services_online_and_physical",
    "source": "EARIST Website",
    "category": "Library Services & Rules",
    "topic": "Library Services and Hours",
    "content": "Regarding Library Services, the Institute offers a range of physical and digital support. Physical services include: Circulation Service for checking out/returning materials; Reference and Information Service for assistance with reading materials; Referral Service for users needing access to other libraries; and Computer and Internet Access Service using library laptops or computers. The library also conducts Library Orientations and provides Current Awareness Services via newsletters and bulletin boards.\n\nOnline Services include Reference and Research Support via Facebook Messenger, Email, or Phone. Document Delivery Services allow for pick-up personally, by representative, or courier. A Drop Box system with Google Form confirmation is available for book returns. Remote Access for e-resources is provided for on-site or off-site use. Library Online Service Hours are Monday to Thursday, 8:00 AM to 5:00 PM. There are no online services on Saturdays, Sundays, holidays, and school breaks.",
    "keywords": [
      "circulation service",
      "reference service",
      "referral service",
      "document delivery",
      "remote access",
      "library hours"
    ]
  },
  {
    "id": "lib_rules_access_and_conduct",
    "source": "EARIST Website",
    "category": "Library Services & Rules",
    "topic": "Authorized Users and Conduct Rules",
    "content": "Under Library Rules and Regulations, authorized users include enrolled EARIST students, faculty members, administrators, staff, and visitors/alumni with a referral letter and valid ID. To enter, a student must present a validated school ID. Borrowing requires an original Certificate of Registration (COR) valid for the current year. Bags must be surrendered at the baggage counter, though valuable items like gadgets may be brought inside.\n\n regarding conduct, silence must be observed; idle conversations and loud noise are prohibited. Eating, sleeping, littering, and loitering are not allowed. Users must handle books with care, avoiding writing on or tearing pages. Charging of laptops and cell phones is prohibited inside the library. Chairs must be pushed back before leaving. Misbehavior may result in the loss of library privileges or suspension, with repeated cases reported to the discipline officer.",
    "keywords": [
      "authorized users",
      "Certificate of Registration",
      "COR",
      "baggage counter",
      "library conduct",
      "charging policy"
    ]
  },
  {
    "id": "lib_borrowing_policies_limits",
    "source": "EARIST Website",
    "category": "Library Services & Rules",
    "topic": "Borrowing Policies and Loan Periods",
    "content": "Regarding Borrowing Policies, students must present a valid Certificate of Registration (COR) and ID to borrow materials. The COR is non-transferable, and borrowing must be done personally. \n\nLoan limits are as follows: Students may borrow a maximum of two (2) books for overnight use. Full-time faculty and staff may borrow a maximum of five (5) books per semester. Part-time faculty may borrow a maximum of three (3) books per semester. \n\nLoan periods dictate that Filipiniana and general collection books are for overnight use only (Monday to Friday) and must be returned by 10:00 AM the following service day. Fiction books may be borrowed for one week. Theses, dissertations, general references (dictionaries, encyclopedias), newspapers, and journals are strictly for room use only. Reproduction of theses and dissertations is prohibited.",
    "keywords": [
      "loan period",
      "borrowing limits",
      "overnight use",
      "faculty loan",
      "room use only",
      "thesis restrictions"
    ]
  },
  {
    "id": "lib_penalties_facilities_contact",
    "source": "EARIST Website",
    "category": "Library Services & Rules",
    "topic": "Penalties, Lost Items, and Facilities Reservation",
    "content": "Under Library Penalties and Procedures, failure to return borrowed books results in the confiscation of the valid Certificate of Registration (COR) for a period of 3 days to 1 week. Suspension of library privileges may be imposed on habitual offenders. Lost books must be reported immediately to avoid sanctions and must be replaced with the latest edition of the same title or a related title if the original is unavailable.\n\nRegarding Facilities, requests for the reservation of the library or research equipment must be made at least 3 days in advance to avoid conflicts. The faculty in charge must provide a letter of request to the librarian. \n\nContact Information: Telephone 8243-9466 to 68 loc.122; Email library@earist.ph.education. The library is located at Nagtahan St, Sampaloc, Manila (Main Campus).",
    "keywords": [
      "library penalties",
      "lost book replacement",
      "COR confiscation",
      "facility reservation",
      "library contact"
    ]
  },
  {
    "id": "lib_collection_types_materials",
    "source": "EARIST Website",
    "category": "Library Collection",
    "topic": "Types of Library Materials",
    "content": "The EARIST Library Collection classifies materials into distinct categories based on their format and usage. \n\n**Books** are separated into two main types: \n1. **General Reference Books:** These include encyclopedic works, dictionaries, almanacs, atlases, directories, handbooks, manuals, indexes, and abstracts. These materials are strictly for room use only.\n2. **Circulation Books:** These cover subjects such as Philosophy, Religion, Social Sciences, Language, Arts, Pure Science, Applied Science, Literature, History, and Geography.\n\n**Periodicals** include all local and foreign journals, magazines, newspapers, government publications, and vertical files such as pamphlets, brochures, and newspaper clippings. Like reference books, periodicals are for room use only.\n\n**Electronic Resources** consist of e-books, e-journals, and other online databases or digital formats (such as PDF, HTML, and web pages). These resources are accessible via the internet using various hardware or equipment.",
    "keywords": [
      "general reference books",
      "circulation books",
      "periodicals",
      "electronic resources",
      "vertical files",
      "e-journals"
    ]
  },
  {
    "id": "lib_classification_ddc_system",
    "source": "EARIST Website",
    "category": "Library Collection",
    "topic": "Dewey Decimal Classification (DDC) System",
    "content": "The EARIST Library organizes its holdings according to the Dewey Decimal Classification (DDC) System, which divides knowledge into ten major classes. Under this system, books with the same call number are classified as the same subject. The ten major classes are:\n\n* **000:** General works, Computer science, and Information\n* **100:** Philosophy and psychology\n* **200:** Religion\n* **300:** Social sciences\n* **400:** Language\n* **500:** Pure Science\n* **600:** Technology\n* **700:** Arts & recreation\n* **800:** Literature\n* **900:** History & geography",
    "keywords": [
      "Dewey Decimal Classification",
      "DDC",
      "call number",
      "library classification",
      "subject classes"
    ]
  },
  {
    "id": "lib_arrangement_card_catalog",
    "source": "EARIST Website",
    "category": "Library Operations",
    "topic": "Arrangement of Books and Card Catalog",
    "content": "The EARIST Library operates on an open-shelf system where materials are arranged according to specific sections. Books are labeled with place marks or location symbols on top of the call number to indicate their section. For instance, the General Circulation collection utilizes the 'C' place mark on its call numbers, while undergraduate and graduate theses are labeled by their respective courses.\n\nTo assist in retrieval, the library uses the Union Card Catalog, which serves as an alphabetical index to the collections. Cards are interfiled following a word-by-word alphabetical arrangement. Each book in the library typically has three corresponding cards filed in the appropriate drawer: an **Author Card**, a **Title Card**, and a **Subject Card**.",
    "keywords": [
      "open-shelf system",
      "Union Card Catalog",
      "author card",
      "title card",
      "subject card",
      "location symbols"
    ]
  },
  {
    "id": "lib_sections_locations_floors",
    "source": "EARIST Website",
    "category": "Library Facilities",
    "topic": "Library Sections and Floor Locations",
    "content": "The EARIST Library is divided into specific sections distributed across four floors:\n\n**Ground Floor:**\n* **Museum:** Houses memorabilia and vital documents pertaining to 'Amang' Rodriguez, whose contributions to EARIST are preserved here.\n\n**Second Floor:**\n* **General Collection/Circulation:** Contains the bulk of the collection intended for undergraduate general education courses (e.g., psychology, economics, arts, history).\n* **Filipiniana Section:** Houses publications by Filipino authors or foreign authors writing about the Philippines.\n* **Technical Section:** Responsible for processing and labeling books (also available on the 3rd floor).\n\n**Third Floor:**\n* **General Reference Section:** Contains encyclopedias, dictionaries, yearbooks, and manuals intended for specific information lookup rather than continuous reading.\n* **Periodical Section:** Houses current and past issues of newspapers, journals, and magazines. Current issues are on open shelves.\n* **Graduate School Section:** Catered to graduate students and researchers. It houses theses and dissertations, which are strictly for room use only and cannot be reproduced.\n\n**Fourth Floor:**\n* **EARIST Learning Commons:** Formerly the ICT Room, this section provides internet access for research and offers open spaces for communication and collaboration.",
    "keywords": [
      "General Circulation",
      "Filipiniana Section",
      "Graduate School Section",
      "Learning Commons",
      "Reference Section",
      "Amang Museum",
      "Periodical Section"
    ]
  },
  {
    "id": "lib_coll_dev_policy_intro_objectives",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Introduction and Objectives",
    "content": "Under the Library Collection Development Policy, the library's collection directly reflects the vision, mission, and objectives of the institution. The primary goal is to provide a high-quality collection of books and materials, giving priority to instructional programs. The selection process aims to meet the individual needs of clientele while the librarian enriches the collection to cater to these needs. The policy acknowledges that creating information resources is essential for all library services.\n\nThe specific objectives of the EARIST library are to assist clientele, particularly students, in their academic and personal development. This is achieved by providing updated library resources and services that participate in attaining the institutional mission and responding efficiently to demands brought by technology and user needs.",
    "keywords": [
      "collection development",
      "instructional programs",
      "library mission",
      "academic development"
    ]
  },
  {
    "id": "lib_coll_dev_selection_responsibility",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Selection Responsibility and Library Objectives",
    "content": "Under the Library Collection Development Policy, the selection of library materials is a collaborative responsibility involving Deans, faculty, library staff, and students. The duties of these groups include screening books, evaluating the collection to monitor strengths and weaknesses, selecting retrospective and current titles, and offering bibliographic assistance. While faculty recommendations form the basis for acquisitions, library staff are responsible for areas not covered by these recommendations to ensure a balanced collection.\n\nThe objectives of the library in selecting materials are: to make available materials needed for instruction and extension programs; to provide materials needed by students and faculty for research; to supply general information in subject areas not covered by specific programs; and to preserve important materials relating to the history and development of the institution.",
    "keywords": [
      "selection responsibility",
      "faculty recommendations",
      "acquisition basis",
      "balanced collection"
    ]
  },
  {
    "id": "lib_coll_dev_acquisition_process",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Acquisition Process and Guidelines",
    "content": "Under the Library Collection Development Policy, acquisition is the process of securing materials through purchase, gifts, or exchange. The guidelines for acquiring materials require knowledge of the book and media trade, wide selection and collection development, organized recording for each item, and constant monitoring of fund expenditures.\n\nThe four primary internal objectives of acquisition are: to acquire materials promptly for immediate usability; to maintain accurate processes based on standards; to prioritize quality over quantity; and to maintain good working relationships with other libraries, bookstores, and marketing agencies.",
    "keywords": [
      "acquisition process",
      "purchase guidelines",
      "gift and exchange",
      "quality over quantity"
    ]
  },
  {
    "id": "lib_coll_dev_limitations_priorities",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Limitations and Priorities in Acquisition",
    "content": "Under the Library Collection Development Policy, specific limitations and priorities govern the acquisition of materials. Due to funding limits, priority is given to current publications of lasting scholarly value over older or out-of-print materials. If originals are unavailable or too expensive, other means are exhausted. Duplicate copies are purchased only upon justification of heavy and continuous use.\n\nVariant editions of a title are acquired only if they are standard editions or contain substantial changes needed for research. The library will not purchase extensive in-depth materials for the scientific research needs of graduate students or short-term research projects of staff unless the policy specifies intensive collection development in that area. Furthermore, the library will not purchase duplicate copies or biased publications intended solely for the use of specific individuals, academic departments, or administrative offices.",
    "keywords": [
      "acquisition limitations",
      "scholarly value",
      "duplicate copies",
      "variant editions",
      "biased publications"
    ]
  },
  {
    "id": "lib_coll_dev_formats_exchanges",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Editions, Formats, and Exchanges",
    "content": "Under the Library Collection Development Policy, the library acquires the latest editions of publications. Earlier editions are acquired only if they possess historical value. Hardbound books are preferred over paperbacks for durability, subject to the availability of funds. Paperbacks are purchased if no other edition is available, there is great demand, or the original title appeared in that form.\n\nRegarding duplication, materials needed for teaching, extension, and research are acquired based on multiple, heavy, and continuous demands. Additional copies are purchased for college libraries and the circulation reserve section. Regarding exchanges, the library trades publications with other institutions to maintain balance in the value of materials received. Exchange agreements are established when desired publications are available only through exchange or when such arrangements advantageously complement the resources needed for a particular program.",
    "keywords": [
      "hardbound vs paperback",
      "latest editions",
      "library exchange",
      "reserve section"
    ]
  },
  {
    "id": "lib_coll_dev_serials_filipiniana",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Serials and Filipiniana Materials",
    "content": "Under the Library Collection Development Policy, the library acquires serials and Filipiniana materials within its financial capabilities. \n\n**Serials:** The library acquires single copies of resources based on frequency of use, including: holdings of leading materials in major fields; serials devoted to public affairs, literature, and critics; serials presenting factual economic, political, and scientific information; selected foreign popular periodicals of research value; and government agency serials.\n\n**Filipiniana:** This collection includes books, serials, reports, maps, and pictures published in the Philippines, written by Filipinos, or written by foreign authors about the Philippines. Acquisition relies on endorsements by faculty and researchers. Sources include government agencies, state colleges and universities (catalogs, annual reports), private universities, and embassies.",
    "keywords": [
      "serials acquisition",
      "Filipiniana collection",
      "government publications",
      "periodicals"
    ]
  },
  {
    "id": "lib_coll_dev_examination_copies",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Examination Copies",
    "content": "Under the Library Collection Development Policy, the library handles examination copies provided by local dealers, jobbers, and publisher representatives. Upon delivery, the library checks these books for possible duplication and initiates recommendation steps. The library sends these books to Deans, Department Chairs, Faculty Members, and Library Committee Representatives for review. These personnel are given one to two weeks to examine the books and submit their recommendations for purchase.",
    "keywords": [
      "examination copies",
      "book review process",
      "faculty recommendation",
      "book dealers"
    ]
  },
  {
    "id": "lib_coll_dev_cataloging_classification",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Cataloging and Classification",
    "content": "Under the Library Collection Development Policy, cataloging and classification organize library materials. A catalog main entry is made for every document, containing subject statements, class numbers, and subject headings. Added entries (author, title, editor, series) are provided to create multiple access points for users, following the Anglo-American Cataloging Rules (AACR). The classification system used is the Dewey Decimal Classification (DDC).\n\nTools used include Sears List of Subject Headings, DDC, Cutter’s Table, and AACR2. The procedure involves classifying the book, creating a process slip, encoding it for student use, and providing access codes. The library utilizes an Online Public Access Catalog (OPAC) and maintains Koha, an open-source integrated library system, to manage circulation, cataloging, and acquisitions.",
    "keywords": [
      "Dewey Decimal Classification",
      "DDC",
      "AACR2",
      "OPAC",
      "Koha",
      "cataloging procedures"
    ]
  },
  {
    "id": "lib_coll_dev_readers_services_sections",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Readers Services and Sections",
    "content": "Under the Library Collection Development Policy, Readers Services are designed to support the institution's academic pursuits. The EARIST library serves as a major depository to promote reading and provide a learning environment conducive to creative enquiry.\n\nThe library is divided into specific sections:\n* **Reference Section:** Helps students and researchers in the choice of books.\n* **Filipiniana Section:** Handles materials regarding the Philippines, its people, history, and culture.\n* **Circulation Section:** Handles the charging and discharging (borrowing and returning) of books.\n* **Technical Section:** Handles mechanical preparation, classifying, and cataloging before materials are circulated.",
    "keywords": [
      "Readers Services",
      "Reference Section",
      "Filipiniana Section",
      "Circulation Section",
      "Technical Section"
    ]
  },
  {
    "id": "lib_coll_dev_binding_weeding_policy",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Binding, Mending, and Weeding Procedures",
    "content": "Under the Library Collection Development Policy, the library maintains the collection through binding, mending, and weeding. Mending or rebinding is determined by the degree of damage; simple mending is used for torn pages, while rebinding is for worn books with important content. \n\nWeeding is the process of removing unneeded materials to keep the collection fresh and responsive. Main reasons for weeding include limited space and high storage costs. Items targeted for weeding include textbooks without permanent value, books beyond repair, and outdated reference books. Factors that often discourage weeding include the perception that a high volume of books equals quality, professional work pressure, and the view that books are sacred records.",
    "keywords": [
      "book binding",
      "mending",
      "weeding policy",
      "collection maintenance",
      "discarding books"
    ]
  },
  {
    "id": "lib_coll_dev_weeding_criteria",
    "source": "EARIST Website",
    "category": "Library Collection Development Policy",
    "topic": "Basis for Weeding",
    "content": "Under the Library Collection Development Policy, the specific criteria (basis) for weeding materials are:\n* **Last date of circulation:** Items not used in ten years (or less depending on library type) are weeded.\n* **Physical condition:** Items in bad condition are weeded, with a decision made to repair or replace.\n* **Timeliness:** Out-of-date materials, especially in science and technology (older than 3-5 years), obsolete textbooks, and older editions no longer used are weeded.\n* **Reliability:** Materials with outdated viewpoints that are no longer useful explanations are discarded.\n* **Language:** Foreign language books are discarded if changes in the curriculum or community render them irrelevant. Translations should be checked periodically.",
    "keywords": [
      "weeding criteria",
      "obsolete textbooks",
      "circulation statistics",
      "physical condition",
      "timeliness"
    ]
  }
]