[
  {
    "id": "institutional_history_and_legal_basis",
    "source": "Student Handbook 2021",
    "category": "History of EARIST",
    "topic": "Historical Development and Legal Basis of the Institute",
    "content": "According to the History section of the Student Handbook, the Eulogio \"Amang\" Rodriguez Institute of Science and Technology (EARIST) was established after the liberation of Manila in 1945. It began as a Vocational High School located on the second floor of Mapa High School with 147 students under Principal Mr. Pantaleon Regala. The institution was originally named the Eulogio Rodriguez Vocational High School (ERVHS). On July 1, 1946, the Institute acquired its present site in Nagtahan, Sampaloc, Manila.\n\nThe Institute's growth is anchored on specific legislative acts. Republic Act No. 4072 (1964) authorized the establishment of the Technical Education Department. Republic Act No. 5088 (1967) renamed the school to Eulogio \"Amang\" Rodriguez Memorial School of Arts and Trades (EARMSAT) and separated it from the Division of City Schools, Manila. Republic Act No. 6595 (1972) converted EARMSAT into EARIST, appointing a President as its head and authorizing vocational-technical branches in Manila. Finally, Presidential Decree No. 1524, signed on June 11, 1978, converted EARIST into a Chartered State College with a Board of Trustees.\n\nThe leadership history includes Dr. Hilario G. Nudas as the first College President (1978-1982), followed by Dr. Frederick So Pada, Dr. Lydia M. Profeta, Dr. Arturo P. Casuga, Dr. Maura V. Bautista, Dr. Eduardo S. Caillo, and the 7th President, Dr. Editha V. Pillo.\n\nThe EARIST Cavite Campus (formerly GASAT) was established via Board Resolution No. 007-82 on March 24, 1982, in General Mariano Alvarez, Cavite. The campus sits on a 31,282 square meter lot donated by the National Housing Authority. Significant infrastructure development occurred between 1989 and 1999, primarily funded through congressional insertions by Hon. Renato P. Dragon.",
    "keywords": [
      "history",
      "foundation",
      "legal basis",
      "Republic Acts",
      "Presidential Decree 1524",
      "Cavite Campus history",
      "GASAT",
      "past presidents"
    ]
  },
  {
    "id": "institutional_mandate_vision_mission",
    "source": "Student Handbook 2021",
    "category": "Mission Statements",
    "topic": "Vision, Mission, Goals, and Objectives",
    "content": "Under the section on Mission Statements, the Institute outlines its strategic direction and educational mandate. \n\nThe Vision of EARIST is to be a center of excellence in trades, business, arts, science, and technology education.\n\nThe Mission of the Institute is to turn out vocationally, technically, technologically, and scientifically trained graduates who will be economically productive, self-sufficient, effective, responsible, and disciplined citizens of the Philippines.\n\nThe Goal of EARIST is to provide professional, scientific, technological, technical, and vocational instruction and training in trades, business, arts, sciences, and technology. It also aims to promote research, advanced studies, and progressive leadership in these fields, as specified in Section 2 of RA 6595 and Section 6 of PD 1524.\n\nThe Objectives of the Institute are as follows: to strive for academic excellence in instruction, research, extension, and production through accreditation; to provide appropriate and continuing faculty and staff development programs; to provide and maintain appropriate technologies, instructional facilities, materials, and equipment; to produce quality graduates who are globally competitive to meet the needs of business and industry; and to attain university status through unity, solidarity, and teamwork.",
    "keywords": [
      "vision",
      "mission",
      "goals",
      "objectives",
      "mandate",
      "strategic direction",
      "academic excellence"
    ]
  },
  {
    "id": "curricular_offerings_main_campus",
    "source": "Student Handbook 2021",
    "category": "Curricular Offerings",
    "topic": "Complete List of Main Campus Degree Programs",
    "content": "The Curricular Offerings section details the academic programs available at the Main Campus, organized by College.\n\nThe College of Architecture and Fine Arts (CAFA) offers the Bachelor of Science in Architecture (BS Archi.), Bachelor of Science in Interior Design (BSID), and Bachelor of Fine Arts (BFA) with majors in Painting or Visual Communication.\n\nThe College of Arts and Sciences (CAS) offers the Bachelor of Science in Applied Physics with Computer Science Emphasis (BSAP), Bachelor of Science in Computer Science (BSCS), Bachelor of Science in Information Technology (BS Info. Tech.), Bachelor of Science in Psychology (BSPsych), and Bachelor of Science in Mathematics (BSMath).\n\nThe College of Business and Public Administration (CBPA) offers the Bachelor of Science in Office Administration (BSOA), Bachelor of Science in Entrepreneurship (BSEntrep), Bachelor in Public Administration (BPA), and Bachelor of Science in Business Administration with majors in Human Resource Management or Marketing Management.\n\nThe College of Education (CED) offers the Bachelor in Secondary Education (BSE) with majors in Filipino, Mathematics, or Science; the Bachelor of Technology and Livelihood Education (BTLEd) with majors in Home Economics or Industrial Arts; the Bachelor of Special Needs Education (BSNEd); and a Professional Education unit earning program (18 units).\n\nThe College of Engineering (CEN) offers Bachelor of Science degrees in Chemical Engineering (BSChE), Civil Engineering (BSCE), Electrical Engineering (BSEE), Electronics and Communication Engineering (BSECE), Mechanical Engineering (BSME), and Computer Engineering (BSCoE).\n\nThe College of Hospitality and Tourism Management (CHTM) offers the Bachelor of Science in Tourism Management (BST) and Bachelor of Science in Hospitality Management (BSHM).\n\nThe College of Industrial Technology (CIT) offers the Bachelor of Science in Industrial Technology (BSIT) with majors in Automotive Technology, Electrical Technology, Electronics Technology, Food Technology, Fashion Apparel Technology, Industrial Chemistry, Drafting Technology, Machine Shop Technology, and Refrigeration and Air-conditioning.\n\nThe College of Criminal Justice Education offers the Bachelor of Science in Criminology (BSCrim).\n\nThe Graduate School offers Master's programs including MS in Mathematics, MA in Industrial Psychology, Master in Business Administration, Master in Public Administration, MA in Industrial Education (Hotel Management), MA in Education (Administration and Supervision, Guidance & Counseling, Special Education), and MA in Teaching (Electronics Technology, Mathematics, Science). Doctoral programs include PhD in Industrial Psychology, EdD in Educational Management, Doctor in Business Administration, and Doctor in Public Administration.",
    "keywords": [
      "Main Campus",
      "courses",
      "degrees",
      "engineering",
      "architecture",
      "business",
      "education",
      "graduate school",
      "master's degree",
      "doctorate",
      "industrial technology"
    ]
  },
  {
    "id": "curricular_offerings_cavite_campus",
    "source": "Student Handbook 2021",
    "category": "Curricular Offerings",
    "topic": "Complete List of Cavite Campus Degree Programs",
    "content": "The Curricular Offerings section lists the specific programs available at the EARIST Cavite Campus.\n\nThe Graduate Programs offered are the Doctor in Education (Major in Educational Management), Master of Arts in Education (Major in Administration and Supervision), and Master in Business Administration.\n\nThe Post Baccalaureate Program consists of Professional Education Subjects (18 units).\n\nThe Undergraduate Programs available in Cavite are: Bachelor of Science in Business Administration (Major in Marketing Management), Bachelor of Science in Computer Science, Bachelor of Science in Computer Technology, Bachelor of Science in Criminology, Bachelor of Science in Hospitality Management, Bachelor of Science in Office Administration, Bachelor of Science in Industrial Psychology, and Bachelor of Technology and Livelihood Education.\n\nAdditionally, the Cavite Campus offers the Bachelor of Science in Industrial Technology with majors in Automotive, Electrical, Electronics, Food Technology, and Drafting Technology.",
    "keywords": [
      "Cavite Campus",
      "GMA Cavite",
      "General Mariano Alvarez",
      "courses",
      "degrees",
      "graduate programs",
      "undergraduate programs",
      "industrial technology"
    ]
  },
  {
    "id": "article_i_admission_eligibility_and_requirements",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "Admission Eligibility and Documentary Requirements",
    "content": "Under Article I of the EARIST Student Handbook, the Admission Policy states that admission is primarily based on academic preparedness, including entrance examination results, interviews, academic records, character evaluation, and the applicant's ability to benefit from the programs. Admission for freshmen and transferees generally operates on a first-come-first-served basis, contingent upon available resources such as rooms and faculty.\n\nEligibility for admission requires specific qualifications. Freshmen applicants must be Grade 12 graduates (pursuant to CMO No. 105, s. 2017) or Senior High School Alternative Learning System (ALS) Accreditation and Equivalency passers. Transferees are eligible if they preferably have no grades of \"Dropped\", \"Incomplete\", or \"Failed\", subject to slot availability. Foreign students who graduated from high schools abroad and have not enrolled in international HEIs are also eligible.\n\nThe Institute mandates specific documentary requirements for admission. For Freshmen, the required documents are: Form 138 (Senior High School Report Card), a Certificate of Good Moral Character with the school seal, a PSA Authenticated Birth Certificate, the EARISTCAT Result, a satisfactory result from the Dean's Assessment and Evaluation, and a Medical/Health Examination result.\n\nFor Transferees, the requirements include: the Transcript of Records or Certification of Grades, a Certification of Good Moral Character, a satisfactory result from the Dean's Assessment and Evaluation, a recommendation from the Dean or Guidance Counselor of the previous school, Transfer Credentials or Honorable Dismissal, the EARISTCAT result, and a Medical/Health Examination result.\n\nForeign students graduating from high schools abroad must additionally submit a notarized affidavit of support, proof of adequate financial support, and an equivalent High School Diploma.",
    "keywords": [
      "admission requirements",
      "freshmen eligibility",
      "transferee requirements",
      "foreign students",
      "documents",
      "Form 138",
      "PSA Birth Certificate"
    ]
  },
  {
    "id": "article_i_screening_process_and_cut_off_scores",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "Screening Process, EARISTCAT, and Program Cut-Off Scores",
    "content": "Under Article I, the Institute enforces a three-level screening process for all applicants. \n\nScreening Level 1 is the EARIST College Admission Test (EARISTCAT). The rating is calculated using the formula: EARISTCAT Rating = (Total Score x 50 / No. Of Items) + 50. Applications are processed by the Student Admission, Registration and Records Management Services (SARRMS), while the test is administered by the Guidance and Counselling Office.\n\nScreening Level 2 is the College Admission Interview. This assessment evaluates leadership potential, determination, career choice, and communication skills. For applicants to the College of Architecture and Fine Arts (CAFA), a Drawing Ability Test (DAT) is required. The interviewer's evaluation is final and unappealable.\n\nScreening Level 3 involves Program Preparedness Tests. These are placement exams for specific technical programs. Students scoring below the cut-off may be conditionally admitted but must undergo an Enhancement Program. The cut-off scores for admission, waitlisting, and realignment are strictly defined by College and Program:\n\nFor the College of Architecture and Fine Arts (CAFA):\n- BS Architecture, BS Interior Design, and Bachelor of Fine Arts all require 70.00% or better for Admission, 50.00%–69.99% for Waitlist, and Realignment for scores below 50.00%.\n\nFor the College of Arts and Sciences (CAS):\n- BS Computer Science requires 75.00% for Admission (Waitlist: 70.00%–74.99%).\n- BS Psychology requires 77.00% for Admission (Waitlist: 73.00%–76.99%).\n- BS Applied Physics and BS Mathematics require 60.00% for Admission (Waitlist: 50.00%–59.99%).\n- BS InfoTech requires 75.00% for Admission (Waitlist: 70.00%–74.99%).\n\nFor the College of Business (CBPA/CBA):\n- BS Office Admin, BS Business Admin, and BS Entrepreneurship all require 55.00% for Admission (Waitlist: 50.00%–54.99%).\n\nFor the College of Education (CED):\n- Bachelor in Elementary Education and Bachelor in Secondary Education require 80.00% for Admission (Waitlist: 50.00%–79.99%).\n\nFor the College of Engineering (CEN):\n- All programs (Civil, Chemical, Computer, Electrical, Mechanical, and ECE) require 85.00% for Admission (Waitlist: 50.00%–79.99%).\n\nFor the College of Hospitality and Tourism Management (CHTM):\n- BS Tourism and BS Hospitality Management require 70.00% for Admission (Waitlist: 50.00%–69.99%).\n\nFor the College of Industrial Technology (CIT):\n- BS Industrial Technology requires 50.00% for Admission (Waitlist: 45.00%–49.99%).\n\nFor the College of Criminal Justice Education (CCJE/CPAC):\n- BS Criminology and Bachelor of Public Administration require 75.00% for Admission (Waitlist: 65.00%–74.99%).\n\nThe Institute ensures that no applicant meeting minimum requirements is deferred based on handicap, disability, or indigenous status, in compliance with RA 7277, RA 9442, and RA 8371.",
    "keywords": [
      "screening process",
      "EARISTCAT formula",
      "interview",
      "cut-off scores",
      "Program Preparedness Test",
      "College of Engineering admission",
      "conditional admission",
      "grading requirement"
    ]
  },
  {
    "id": "article_i_transferee_pledge_readmission_protocols",
    "source": "Student Handbook 2021",
    "category": "Article I - Admission Policy",
    "topic": "Transferee Protocols, Student Pledge, and Re-Admission",
    "content": "Under Article I, specific protocols govern the admission of transferees, the student pledge, and re-admission procedures.\n\nTransferees may be admitted based on slot availability and must meet all academic requirements found in Section A. Courses taken at a previous school may be credited following an evaluation by the Department Chairperson and the Registrar's Office upon submission of the Official Transcript of Records. Transferees may be placed on either the old or new curriculum depending on the credited courses. Students placed on the old curriculum are exempt from the Bridging Program. However, students placed on the new curriculum must enroll in and pass additional general education subjects identified in the Bridging Program for Lifelong Learners.\n\nUpon admission, every student is required to sign the Student's Pledge and a waiver of data privacy. Refusal to sign or violation of these terms constitutes sufficient cause for denial of admission or subsequent dismissal from the Institute.\n\nFor students seeking Re-Admission after a Leave of Absence (LOA), three specific documents are required: a copy of the approved Leave of Absence, an Evaluation Record Form from the Registrar's Office, and an Admission Recommendation from the College Dean.",
    "keywords": [
      "transferee credits",
      "bridging program",
      "student pledge",
      "data privacy waiver",
      "re-admission",
      "leave of absence",
      "curriculum accreditation"
    ]
  },
  {
    "id": "article_ii_registration_academic_load_substitution",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Registration, Academic Load, and Changing of Classes",
    "content": "Under Article II, Section 1 of the Student Handbook, the Institute mandates that a student must be officially registered to receive credit for course work. The registration procedure requires the issuance of a Notice of Admission, submission of requirements to the Registrar, pre-enrollment, validation of fees, payment (for paying students), and validation of the Certificate of Registration. A student is considered officially enrolled once the \"Copy for Student\" portion of the certificate is stamped \"ENROLLED\" and initialed by the Registrar's officer. Registration must occur within the dates specified in the school calendar, with a maximum extension of two weeks from the first day of classes allowed only under justifiable circumstances approved by the Vice President for Academic Affairs. Notably, the Institute does not accept applications for a second baccalaureate degree, and no student may enroll in more than one college to earn multiple degrees simultaneously.\n\nCross-enrollment is permitted only if the course is not offered at the Institute, limited to a maximum of six (6) units, and requires endorsement by the Dean and a written permit from the Registrar. Conversely, cross-enrollees from other schools entering EARIST must present written permission from their originating Registrar.\n\nRegarding Academic Load (Section 2), students must carry the regular load prescribed by their curriculum. A student cannot carry less than half the regular load unless they have academic deficiencies, are graduating, or the courses are unavailable. Overloading is restricted to a maximum of 6 units above the regular load, specifically for back subjects or courses without pre-requisites, and requires approval from the VP for Academic Affairs. For intersession classes, the regular load is 6 units, with a permissible addition of 3 units for back courses. \n\nSection 3 outlines the procedures for Changing Classes, Substitution, and Dropping. A Change of Class is allowed for schedule conflicts, dissolved subjects, or enrollment errors via a College Advisement Slip. Substitution of courses is authorized if the old curriculum is superseded or a required course is not offered. Substituted courses must have the same or higher number of units and similar scope. However, substitution is strictly prohibited for major courses the student has failed (unless the substitute is substantially similar) and for mandated courses. Dropping a course requires SARRMS Form No. 007 and must be done during the specified adjustment period.",
    "keywords": [
      "registration procedure",
      "cross-enrollment",
      "academic load",
      "overload",
      "intersession",
      "dropping subjects",
      "substitution",
      "second degree policy"
    ]
  },
  {
    "id": "article_ii_student_classification_special_needs",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Classification of Students and Special Needs Provisions",
    "content": "Article II, Section 4 classifies students based on admission status, academic load, and year level. \n\n**By Admission Status:**\n* **Beginning Freshmen:** Admitted via EARIST-CAT with no prior college enrollment.\n* **Returning Students (Returnees):** Previously enrolled students seeking readmission, subject to slot availability and evaluation of prior performance.\n* **Shifting Students (Shifters):** Students moving within the same college or to a different college. Shifting requires a letter of intent, justification, and for inter-college shifts, a clearance of good moral standing and release from the previous Dean. Shifters must meet the grade requirements of the receiving college.\n* **Transferring Students (Transferees):** Includes transfers between EARIST Cavite and Manila (vice versa) and from other schools. Admission depends on slot availability and evaluation of the Official Transcript of Records by the Department Chairperson.\n\n**By Academic Load:**\n* **Regular Student:** Carries the full load required for the semester.\n* **Irregular Student:** Carries less than the full load.\n* **Special Student:** Not earning formal credits or enrolled in the Special Opportunity Program.\n\n**By Year Level:**\n* **Freshman:** 1st year or completed less than 25% of total units.\n* **Sophomore:** 2nd year or completed 25% to <50% of total units.\n* **Junior:** 3rd year or completed 50% to <75% of total units.\n* **Senior:** 4th year or completed 75% or more of total units.\n* **Fifth Year:** In Engineering/Architecture, considered senior if 80% of requirements are complete.\n\n**Provisions for Students with Special Needs (PWD):**\nEARIST mandates minimum facilities for special education in compliance with CHED Memo 30 s. 2009 and the Accessibility Law (Batas Pambansa Blg. 344). This includes sensory/tactile materials and Braille for the visually impaired; hearing aids and speech kits for the hearing impaired; and adjustable desks and adapted physical education apparatuses for those with orthopedic handicaps. Instructional devices are also provided for learners with behavioral problems, autism, or learning disabilities.",
    "keywords": [
      "student classification",
      "shifters",
      "transferees",
      "regular student",
      "irregular student",
      "year level",
      "PWD",
      "special needs",
      "Batas Pambansa 344"
    ]
  },
  {
    "id": "article_ii_attendance_ojt_lms",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Attendance, OJT, and Learning Management Systems",
    "content": "Article II, Section 5 establishes strict Attendance Policies. Students must attend classes from the first meeting. Absences are incurred for non-attendance in any academic activity. A student is considered **absent** if they are not present within the first 1/6th of the scheduled class time. Specifically, a student is absent if they arrive after: 30 minutes for a 3-hour class; 20 minutes for a 2-hour class; 15 minutes for a 1.5-hour class; or 10 minutes for a 1-hour class. \n\n**Tardiness** occurs when a student arrives within that first 1/6th fraction (e.g., within the first 30 minutes of a 3-hour class). Three incidences of tardiness equal one absence. A student absent for more than 20% of the total scheduled hours in a subject shall be automatically dropped from the roll. Excused absences require a medical certificate verified by the Institute Medical Officer or an excuse slip from the College Dean. Three successive unexcused absences result in a report to the Prefect of Discipline.\n\nSection 12 outlines the **On-the-Job Training (OJT)/Practicum/Internship** rules. Students must enroll in the practicum course, be in good academic standing, complete all pre-requisites, and be medically fit. Students with additional academic subjects are generally not allowed to train outside the school unless the schedule does not conflict. In-house training is permitted for those with additional subjects. Ladderized programs with OJT are allowed per college requirements.\n\nSection 13 mandates the use of a **Learning Management System (LMS)** and flexible learning. Faculty are required to utilize online and offline delivery approaches to connect with students, pursuant to Board Resolution No. 352-2020.",
    "keywords": [
      "attendance policy",
      "tardiness",
      "absences",
      "dropping due to absence",
      "OJT",
      "practicum",
      "internship",
      "LMS",
      "flexible learning"
    ]
  },
  {
    "id": "article_ii_grading_system_retention_delinquency",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Grading System, Retention Policies, and Scholastic Delinquency",
    "content": "Article II consolidates the Grading System (Section 6), Retention Policies (Section 7), and Scholastic Delinquency (Section 11) to govern academic performance.\n\n**Grading System:**\nThe Institute uses a numerical system: \n* **1.00 (97-100%):** Highly Excellent\n* **1.25 (94-96%) to 1.75 (88-90%):** Excellent to Superior\n* **2.00 (85-87%) to 2.25 (82-84%):** Very Good to Good\n* **2.50 (79-81%) to 2.75 (76-78%):** Satisfactory to Fair\n* **3.00 (75%):** Passed\n* **5.00 (Below 75%):** Failed\n* **INC:** Incomplete. Must be removed within two semesters via SARRMS Form 006, or it automatically becomes 5.0.\n* **DRP:** Dropped.\n* **NC:** No Credit (for OJT/Thesis/Special Students).\n\n**Rectification of Grades:**\nChanges to grades due to calculation errors can be made by the faculty within 5 days of posting without a paper trail. Between 6 to 10 days, a Petition Form for Rectification is required, accompanied by an affidavit and class records, subject to approval by the Dean, VP for Academic Affairs, and President. Petitions filed after 10 days are handled by the Committee on Rectification of Grades.\n\n**Retention and Scholastic Delinquency:**\nScholastic standing is monitored through Warning, Probation, and Dismissal statuses:\n1.  **Warning:** A student obtaining a grade of \"5.00\" in three (3) courses, or Incomplete marks in 16-30% of units, receives a warning. Their load is reduced by 3 units.\n2.  **Probation:** A student is placed on probation if they accumulate failing grades in the succeeding semester after a warning, or if they accumulate 5 failing grades total. Freshmen failing 3 or more courses (or 50% of load) in the first semester are admitted under probation for the second semester. Probationary students cannot fail or drop *any* subject. Students can only be on probation twice; inability to lift the second probation results in ineligibility to enroll.\n3.  **Dismissal/Dropping from Rolls:** \n    * Old students (non-seniors) failing 3 or more courses in a semester or incurring 5 cumulative unauthorized withdrawals are not readmitted.\n    * Students failing/withdrawing thrice in the same course are dropped.\n    * Students failing 40%-75% of their units are dropped from the College.\n    * Students failing more than 75% of their units are permanently disqualified from the Institute.\n\nPre-requisite failures take precedence in succeeding enrollments. An \"INC\" grade is not computed for delinquency until it is replaced by a final grade.",
    "keywords": [
      "grading scale",
      "incomplete grade",
      "rectification of grades",
      "retention policy",
      "probation",
      "dismissal",
      "academic warning",
      "failure to enroll"
    ]
  },
  {
    "id": "article_ii_tenure_loa_graduation_honors",
    "source": "Student Handbook 2021",
    "category": "Article II - Academic Policies",
    "topic": "Tenure, Leave of Absence, Graduation Requirements, and Latin Honors",
    "content": "Article II covers the student lifecycle regarding Tenure, Leave of Absence (LOA), and Graduation (Sections 8, 9, 10).\n\n**Tenure (Residency):**\n* **Regular Students:** Must finish within the prescribed years + a grace period of two semesters (1 year).\n* **Athletics Scholars:** 5 years for a 4-year degree; 6 years for a 5-year degree (+ 1 year grace).\n* **Working Students:** Allowed 1.5 times the normal length of the program.\n* Official LOA is not counted in tenure computation.\n\n**Leave of Absence (LOA) and Honorable Dismissal:**\nStudents must apply for LOA if temporarily separating for non-academic/disciplinary reasons. The student must be in good standing. Studying in another school during LOA is prohibited. LOA generally should not exceed one academic year. Extension is possible up to two years maximum; beyond that, residency status is lost. Withdrawal without formal LOA requires re-application as a new student. An **Honorable Dismissal** is issued for voluntary withdrawal to transfer schools; students issued this cannot be readmitted.\n\n**Graduation Requirements:**\nCandidates must file an application, satisfy all academic requirements, and clear all accountabilities. Transfer students must earn more than 50% of their academic units at EARIST to be eligible for graduation.\n\n**Graduation with Honors:**\nLatin Honors are awarded based on cumulative grade point averages (GPA):\n* **Summa cum Laude:** 1.2500 to 1.0000\n* **Magna cum Laude:** 1.5000 to 1.2501\n* **Cum Laude:** 1.7500 to 1.5001\n\nTo qualify, a candidate must:\n1.  Carry the normal load every semester.\n2.  Complete the program within the prescribed years (4 or 5).\n3.  Have at least 3 years of residence prior to graduation.\n4.  Have **no final grade lower than 2.25** in any academic or non-academic course (including PE/NSTP) taken at EARIST or any other institution.\n5.  Have **no Incomplete, Dropped, or 5.0 grades**.\n6.  Have never repeated a course.",
    "keywords": [
      "tenure",
      "residency",
      "Leave of Absence",
      "LOA",
      "Honorable Dismissal",
      "graduation requirements",
      "Latin Honors",
      "Summa Cum Laude",
      "Magna Cum Laude",
      "Cum Laude"
    ]
  },
  {
    "id": "article_iii_financial_policies_refunds",
    "source": "Student Handbook 2021",
    "category": "Article III - Payments and Refund of Fees",
    "topic": "Tuition Fees, Charges, and Refund Policies",
    "content": "Under Article III, the Institute regulates payments and refunds in accordance with R.A. No. 10931 (Universal Access to Quality Tertiary Education Act). \n\n**Tuition and Fees:**\nFor tertiary students covered by R.A. 10931, educational expenses are free. For students who opt-out or are not covered (such as Graduate Programs or Payee Students), the Institute charges a fixed amount per unit/hour and variable laboratory fees. Matriculation fees for payee students include tuition, miscellaneous, and other fees, payable in cash or installments as determined by Financial Management Services.\n\n**Refund Policy:**\n* **R.A. 10931 Beneficiaries:** Students availing of free tuition **cannot** refund fees regardless of attendance.\n* **Payee/Graduate Students:** A student wishing to refund fees must formally cancel registration via a Dropping Form. The refund schedule is as follows:\n    * **100% Refund:** Before the start of classes.\n    * **80% Refund:** Within one (1) week from the start of classes.\n    * **50% Refund:** Within two (2) weeks from the start of classes.\n    * **No Refund:** After the 2nd week of classes.",
    "keywords": [
      "tuition fees",
      "refund policy",
      "RA 10931",
      "free tuition",
      "dropping charges",
      "payment schedule"
    ]
  },
  {
    "id": "article_iv_scholarships_and_financial_assistance",
    "source": "Student Handbook 2021",
    "category": "Article IV - Scholarship and Financial Assistance",
    "topic": "Comprehensive Guide to Scholarships, Grants, and Student Assistance",
    "content": "Under Article IV of the Student Handbook, the Institute, through the Office of Student Affairs and Services (SAS) and UniFAST, provides financial assistance to qualified students under the IRR of RA 10931. The Institute enforces a strict \"No Dual Scholarship\" policy, meaning a student cannot enjoy more than one scholarship or grant simultaneously; if eligible for multiple, they must choose the most beneficial one.\n\n**1. Tertiary Education Program**\nTo qualify, a student must be enrolled, carry a regular load of 18 units (except graduating students), not be a recipient of other government grants, and have no failing grades or dropped subjects in the previous semester. Requirements include the Scholarship Form, copies of current and previous Certificates of Registration (COR) and Reports of Grades, and a School ID photocopy.\n\n**2. Tulong Dunong Program**\nQualifications require the student to be a Filipino citizen, enrolled with a regular load of 18 units, have no failures or dropped subjects, and not have been expelled from any HEI. Specifically, the applicant must be a dependent of an Overseas Filipino Worker (OFW) who was repatriated, displaced, or deceased during the COVID-19 pandemic (certified by DOLE). Requirements mirror the Tertiary Education Program.\n\n**3. Faculty and Employees Union Scholarship**\nThis is available to qualified children of EARIST employees. The student must carry a minimum of 18 units and pass all subjects (including P.E. and NSTP) to renew. Conditions for retention include: not dropping subjects or shifting courses without approval, avoiding serious offenses, and finishing the course within the specified years. Requirements include the Scholarship Form, parent's Certificate of Employment, and academic records.\n\n**4. Special Grants**\nEARIST facilitates other grants such as the CHED-Student Financial Assistance Programs (StuFAPs), EARIST Faculty Sponsored Scholarship, DOST-SEI Scholarship Grant, and grants from NGOs.\n\n**5. Student Assistance (Work-Study)**\nThis refers to term-employment limited to 100 hours per month. The wage rates are P30.00 per hour for non-technical skills and P75.00 per hour for technical skills. Applicants must be bonafide students with at least one semester of residence, no failing grades in the previous semester, and a weighted average of at least 2.50.",
    "keywords": [
      "UniFAST",
      "Tulong Dunong",
      "student assistant",
      "working student",
      "scholarship requirements",
      "OFW dependent",
      "financial aid"
    ]
  },
  {
    "id": "article_v_rights_and_responsibilities",
    "source": "Student Handbook 2021",
    "category": "Article V - Rights and Responsibilities",
    "topic": "Student Rights and Academic Responsibilities",
    "content": "Article V delineates the Rights and Responsibilities of bonafide EARIST students.\n\n**Student Rights**\nStudents have the right to choose a field of study subject to admission requirements and to participate in matters affecting their welfare. They are entitled to career guidance, counseling, and access to official documents (diplomas, transcripts) upon request. Students possess the right to publish a student newspaper consistent with the Campus Journalism Act of 1991 and enjoy privacy of communication. The Institute explicitly protects the right of students to freely express their gender preference following institutional norms. Furthermore, students have the right to seek justification for contested grades by filing a rectification request through the Dean or Director of Instruction within the prescribed period.\n\n**Student Responsibilities**\nStudents are obligated to conduct themselves with respect and manners at all times. They must exert utmost diligence in their studies to become assets to their families and society. Responsibilities include upholding academic integrity, abiding by school rules, and promoting a pleasant, harmonious environment. Students must actively participate in co-curricular and extra-curricular activities for holistic development and strictly abide by the EARIST Code of Conduct and Discipline.",
    "keywords": [
      "student rights",
      "gender preference",
      "grade rectification",
      "campus journalism",
      "academic integrity",
      "student responsibilities"
    ]
  },
  {
    "id": "article_vi_general_conduct_uniform_id",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "General Conduct, Uniform Policy, and ID Regulations",
    "content": "Article VI, Sections 1 through 3, establishes the General Code of Conduct, emphasizing the motto \"DO the right thing, right!\" and regulating campus behavior.\n\n**Uniform and Grooming Policy**\n* **Schedule:** The prescribed uniform is worn on Mondays, Wednesdays, and Fridays. College Shirt uniforms are worn on Tuesdays and Thursdays. Organizational Shirt uniforms are worn on Saturdays. Laboratory and PE uniforms are worn only during their respective classes.\n* **Exemptions:** Pregnant students may be exempted upon validation of a Medical Certification by the EARIST Medical Officer.\n* **Grooming:** Male students must have a clean barber's cut (2x3 inches) without colorful highlights. Goatees, colored nail polish, and earrings for men are prohibited. Female students are prohibited from having colorful hair highlights. Exposed body piercing and loud tattoos are prohibited for all students.\n\n**Identification Card (ID) Policy**\nStudents must wear their ID at all times. Loss of ID requires an immediate report to Security and the Registrar. Replacement requires a Notarized Affidavit of Loss, a Clearance Form from the Prefect of Discipline, and payment. \n* **2nd Loss:** Considered a minor offense (\"negligence\"); requires a parent conference and warning.\n* **3rd Loss:** Considered a major offense (\"gross negligence\"); requires a parent conference and Disciplinary Probation.\n\n**Campus Conduct**\n* **Curfew:** Students must be out of campus by 9:30 PM unless authorized.\n* **Use of Name/Seal:** Students cannot use the EARIST name or logo for printed programs, tickets, or merchandise without approval from the activity adviser and Institute Official.\n* **Behavior:** Students must maintain peace and order, avoiding unnecessary noise and loitering. The use of gadgets during class hours and examinations is prohibited.",
    "keywords": [
      "uniform schedule",
      "haircut policy",
      "tattoo policy",
      "ID replacement",
      "curfew",
      "grooming standards",
      "campus conduct"
    ]
  },
  {
    "id": "article_vi_major_offenses_list",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Comprehensive List of Major Offenses",
    "content": "Under Article VI, Section 4.1.1, the Institute defines Acts Constituting Major Offenses. Commission of these acts warrants severe disciplinary sanctions.\n\n**Academic Dishonesty and Fraud**\n* **Cheating:** Includes unauthorized possession of notes, copying, allowing others to copy, looking at another's paper, having a proxy take an exam, and plagiarism.\n* **Falsification:** Forging or tampering with academic/official records, or making false statements/perjury in administrative proceedings.\n* **Computer Security:** Accessing networks without authority, altering/destroying data, introducing viruses, or unauthorized use of the EARIST name/logo on social media.\n* **Intellectual Property:** Violation of EARIST IPR policies or unauthorized reproduction of Institute materials.\n\n**Violence, Safety, and Security**\n* **Weapons & Explosives:** Possession of deadly weapons or firecrackers inside premises or during academic functions.\n* **Drugs & Alcohol:** Possession/use of prohibited drugs (RA 9165) or alcoholic beverages; entering the campus under the influence of alcohol.\n* **Hazing:** Any form of hazing or infliction of injury as a prerequisite for membership in any organization (RA 8049). Officers are liable whether present or not.\n* **Bullying:** Violation of the Anti-Bullying Act of 2013 (RA 10627).\n* **Physical Acts:** Brawls, direct assault, infliction of physical injuries, participation in violent acts, or provocation leading to confrontation.\n\n**Conduct and Morality**\n* **Immorality/Lewdness:** Necking, petting, being in a cubicle with another person regardless of gender, displaying pornographic materials.\n* **Gross Disrespect:** Acts in word or deed that put the Institute or its personnel in ridicule or contempt.\n* **Disrepute:** Public malicious imputation of crimes or vices tending to cause dishonor to the Institute.\n* **Sexual Harassment:** Making sexual advances in words or deeds.\n\n**Property and Order**\n* **Vandalism:** Deliberate destruction of property.\n* **Theft/Robbery:** Stealing or failure to turn over lost and found items (Unjust Enrichment).\n* **Disruption:** Deliberate disruption of academic functions creating disorder.\n* **Gambling:** Betting or gambling in any form.\n* **Financial Malfeasance:** Unauthorized collection of money or scalping tickets.\n* **Habitual Delinquency:** Commission of three (3) minor offenses of the same kind or five (5) of different kinds.",
    "keywords": [
      "major offenses",
      "cheating",
      "plagiarism",
      "hazing",
      "bullying",
      "drugs",
      "weapons",
      "computer breach",
      "sexual harassment",
      "gross disrespect"
    ]
  },
  {
    "id": "article_vi_minor_offenses_list",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Comprehensive List of Minor Offenses",
    "content": "Under Article VI, Section 4.1.2, the Institute defines Acts Constituting Minor Offenses. These are less grave infractions that may escalate to major offenses upon habitual commission.\n\n**Behavioral Infractions**\n* **Simple Disrespect:** Acts of disrespect in words or deeds against any member of the community or visitor.\n* **Disturbance:** Disturbing classes or school functions (short of a major offense).\n* **Loitering:** Loitering along corridors while classes are ongoing (for second and succeeding violations).\n* **Gaming:** Playing electronic gadgets, board games, or card games outside of official activities.\n* **Proselytizing:** Attempting to convert others by attacking their beliefs or offering inducements.\n* **Public Display of Physical Intimacy (PDPI):** Inappropriate displays of affection.\n\n**Campus Regulations & Facilities**\n* **ID Violations:** Refusal to present ID; Third and succeeding entry without ID; Third and succeeding non-wearing of ID.\n* **ID Loss:** Third and succeeding loss of ID constitutes a violation (See Major Offenses for Gross Negligence).\n* **Uniform:** Changing uniforms inside premises (except where allowed for PE/Shop).\n* **Sanitation:** Littering, unhygienic use of facilities, or smoking/vaping (e-cigarettes) on premises.\n* **Unauthorized Access/Use:** Entering restricted areas, using classrooms without reservation, or bringing in pets.\n* **Prohibited Items:** Bringing cutters, pointed scissors, or laboratory instruments without a permit/endorsement.\n* **Commerce:** Selling items or soliciting contributions without the Dean's approval.\n* **Drug Testing:** Refusal to undergo required random drug testing.",
    "keywords": [
      "minor offenses",
      "littering",
      "ID violations",
      "loitering",
      "PDPI",
      "smoking",
      "simple disrespect",
      "dress code violation"
    ]
  },
  {
    "id": "article_vi_disciplinary_procedures_sanctions",
    "source": "Student Handbook 2021",
    "category": "Article VI - Code of Conduct and Discipline",
    "topic": "Disciplinary Board, Procedures, and Sanctions",
    "content": "Article VI, Section 4.2 outlines the due process for handling disciplinary cases, ensuring corrective measures are formative rather than purely retributive.\n\n**Student Discipline Board (SDB) Composition**\n* **College Level (Minor Offenses):** Chaired by the Dean/Associate Dean. Members include the College Prefect of Discipline, Department Head, and CSG Governor.\n* **Institute Level (Major Offenses):** Chaired by the OSAS Director. Members include the Dean, ISG President, and CSG Governor. Additional members (Faculty/Employee Association rep) may be appointed by the VPAA for impartiality.\n\n\n**Sanctions and Corrective Measures**\n* **Major Offenses:** Penalties include Probation, Suspension, Dismissal/Non-Readmission/Exclusion, or Expulsion.\n* **Minor Offenses:** \n    * 1st Offense: Written warning.\n    * 2nd Offense: Written reprimand and letter from parents (possible conference).\n    * 3rd Offense: Escalates to Major Offense charges or strict written reprimand with mandatory parent conference.\n* **Mandatory Interventions:** Offenders may also be required to attend seminars, submit apology letters, undergo counseling, or pay restitution for damages.\n\n**Rules of Procedure**\n1.  **Filing:** Any community member (or Security via incident report) can file a complaint with the Dean (Minor) or OSAS (Major).\n2.  **Due Process:** The student must be informed in writing of the accusation and evidence. They have the right to answer allegations and present counter-evidence (under oath/notarized) with the assistance of an adviser/counsel.\n3.  **Decision:** School authorities render a decision after evaluating the evidence.",
    "keywords": [
      "Student Discipline Board",
      "disciplinary procedure",
      "sanctions",
      "due process",
      "suspension",
      "expulsion",
      "complaint filing"
    ]
  },
  {
    "id": "article_vii_viii_disciplinary_sanctions_and_procedures",
    "source": "Student Handbook 2021",
    "category": "Article VII & VIII - Discipline and Grievances",
    "topic": "Disciplinary Sanctions and Grievance Procedures",
    "content": "Under Article VII, the Institute imposes specific disciplinary sanctions for offenses defined in the Handbook. \n\n**Types of Sanctions:**\n1.  **Warning or Reprimand:** Issued in writing for minor offenses or verbally. It is recorded in the Dean's Office or OSAS for the first and second incidents of a minor offense.\n2.  **Suspension:** Bars a student from classes or the school for a prescribed period. Suspensions exceeding three days require approval from the Vice President for Academic Affairs.\n3.  **Probation:** Applied when behavior merits separation but the school grants a chance. It has two types:\n    * **Academic Probation:** Imposed for academic deficiencies (failure in 1 major course or 2 minor courses). It lasts for one semester and is lifted upon passing all courses. Further failure prevents readmission.\n    * **Discipline Probation:** Imposed for a major offense or three minor offenses. It lasts between 60 school days and one semester. A student may only be placed on probation twice; further violations result in dismissal.\n4.  **Non-Readmission:** Allows a student to finish the current semester but excludes them from the next. It disqualifies the student from receiving a Certificate of Good Moral Character.\n5.  **Dismissal:** Immediate exclusion from school rolls and issuance of transfer credentials. Used for major offenses of extreme urgency.\n6.  **Expulsion:** The extreme penalty excluding a student from admission to any public or private school in the Philippines, requiring Board of Trustees (BOT) approval. Preventive suspension is allowed during investigation if the student poses a risk.\n7.  **Sanctions on Graduating Students:** Those with major offenses are barred from commencement exercises and denied a Certificate of Good Moral Character.\n\n**Article VIII: Procedures for Settlement**\nThe Institute adheres to due process. The procedure follows a hierarchy:\n1.  **Consultation:** Aggrieved parties should first seek advice from a teacher or official. Psychological problems are referred to the Counseling and Testing Office.\n2.  **Filing a Complaint:** Complaints must be written. Minor offenses are filed with the Dean; major offenses with the Director of Student Affairs and Services (OSAS).\n    * Student vs. Faculty/Staff complaints are referred to the VPAA (academic) or VP for Administration (administrative).\n    * Faculty/Staff vs. Student complaints are referred to the Discipline Board.\n3.  **Arbitration & Investigation:** The unit attempts amicable settlement. If impossible, the case goes to the **EARIST Grievance Committee**, which recommends action to the President.\n4.  **Decision:** The Institute President's decision is final and executory unless appealed to the Board of Trustees.\n",
    "keywords": [
      "disciplinary sanctions",
      "suspension",
      "expulsion",
      "academic probation",
      "disciplinary probation",
      "grievance committee",
      "due process",
      "complaint procedure"
    ]
  },
  {
    "id": "article_ix_student_welfare_and_institutional_services",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Student Welfare, Medical, Safety, and Sports Services",
    "content": "Article IX outlines the Student Affairs and Services (SAS), mandated by CMO No. 09 (s. 2013) and CMO No. 08 (s. 2021). These services support student welfare and development.\n\n**Welfare Services:**\n* **Information & Orientation:** The Institute provides materials on the mission, vision, and relevant laws (e.g., Anti-Bullying Act, Anti-Hazing Law, Data Privacy). Comprehensive orientation is held for new and continuing students.\n* **Guidance & Counseling:** Services include individual/group counseling, testing and appraisal, and research. Special programs include pre-employment seminars and job fairs.\n* **Career & Job Placement:** Institutionalizes links with industries for student employment.\n* **Economic Enterprise:** Supports student cooperatives, loans, and entrepreneurial activities (e.g., photography, product selling). Organizations must secure permits from OSAS and the IGP for business activities.\n\n**Institutional Student Programs:**\n* **Medical & Dental:** EARIST provides free consultation, treatment for minor wounds, and routine dental examinations (including extraction if indicated). All bonafide students are covered by an external personal accident insurance policy funded by miscellaneous fees.\n* **Safety & Security:** The campus enforces a strict no-smoking policy, monitors via CCTV, and prohibits firearms, deadly weapons, and liquor. Properties brought to campus (laptops, cameras) must be reported to Security. Assets owned by the Institute cannot leave premises without a gate pass.\n* **Housing:** OSAS monitors student dormitories and housing facilities.\n* **Services for Special Needs (PWDs):** The Institute ensures reasonable accommodation and facilities for persons with disabilities.\n\n**Sports and Physical Development:**\nManaged by the Sports and Physical Development Office, this program selects and supports Student-Athletes.\n* **Athlete Qualifications:** Must be a bonafide undergraduate student, within the SCUAA age limit, and have no failed grades in the previous semester.\n* **Athlete Benefits:** Monthly allowance, travel allowances, free uniforms/shoes, and Certificates of Recognition.\n* **Responsibilities:** Athletes must attend classes, maintain scholastic eligibility, and attend mandatory training. Forfeiture of status occurs upon violation of rules or non-participation without valid reason.",
    "keywords": [
      "student welfare",
      "guidance counseling",
      "medical services",
      "student insurance",
      "campus security",
      "student athletes",
      "PWD services",
      "SCUAA"
    ]
  },
  {
    "id": "article_ix_student_development_and_government",
    "source": "Student Handbook 2021",
    "category": "Article IX - Student Affairs and Services",
    "topic": "Student Government, Organizations, and Publications",
    "content": "Article IX, Section 2, details Student Development Services, focusing on leadership, governance, and publications.\n\n**Student Organizations:**\nAccredited organizations are supervised by OSAS. Leadership Training Seminars (LTS) are mandatory for elected officers of the Institute Student Government (ISG) and College Student Government (CSG).\n\n**Institute Student Government (ISG):**\nThe ISG is the highest student governing body, serving as the official representative of the students and a mediator with the administration.\n* **Structure:**\n    * **Executive Board:** President, Vice President, Secretary, Treasurer, Auditor, and Committee Chairpersons (Ways and Means, Education, Socio-Cultural, Cleanliness, Special Projects, Grievance).\n    * **Legislative Board:** Composed of CSG representatives from the Manila Campus and Program Representatives from the Cavite Campus.\n* **Elections:** Executive Board members are elected at large, while Legislative members are elected by their respective colleges/programs. The term of office is one year (January to December).\n* **Qualifications for Officers:**\n    1.  Bonafide student carrying a minimum of 18 units (exceptions require Dean's certification).\n    2.  At least one year of residency.\n    3.  No major offenses.\n    4.  GPA of 2.50 or higher.\n    5.  No failing grades in the preceding semester.\n* **Disqualification:** Officers are disqualified if they obtain a failing grade during their term, commit a major offense, fail to enroll, or suffer permanent incapacity.\n\n**College Student Government (CSG):**\nEach college has a CSG led by a Governor, Vice Governor, and other officers. The Governor represents the college in the ISG. The CSG Legislative Department serves as a member of the impeachment committee.\n\n**Student Publications:**\nPursuant to the Campus Journalism Act of 1991 (RA 7079), OSAS supervises student publications like *The EARIST Technozette* and *The Champion*. Staff members are selected through competitive examinations. The official yearbook for graduates is *The EARISTians*.",
    "keywords": [
      "Institute Student Government",
      "ISG",
      "student elections",
      "officer qualifications",
      "student organizations",
      "campus journalism",
      "Technozette"
    ]
  },
  {
    "id": "article_x_organization_accreditation_renewal_status",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organizations",
    "topic": "Accreditation, Renewal, and Status of Student Organizations",
    "content": "Under Article X, the establishment and operation of student organizations at EARIST are governed by Batas Pambansa Blg. 232 (Education Act of 1982) and regulated by the Office of Student Affairs and Services (OSAS). The OSAS has the authority to formulate policies, approve activities, and issue or revoke Certificates of Recognition in consultation with the Institute Student Government (ISG).\n\n**Application for Accreditation**\nNew organizations must apply for accreditation within one month after the opening of the school year. The processing time is within 15 working days. . Required documents, submitted in duplicate to OSAS through the ISG, include:\n1.  Letter of application addressed to the SAS Director (endorsed by the Dean for college-based orgs).\n2.  Duly accomplished SAS Application Form.\n3.  Constitution and By-Laws (consistent with the Institution's Mission-Vision).\n4.  Updated roster of officers (with 2x2 ID pictures and contact details) and members.\n5.  Faculty Adviser's Conforme form.\n6.  Master Plan of activities with budget breakdowns.\n\n**Renewal of Accreditation**\nAccreditation is valid for one school year. Renewal applications are due one month after the school year opens. Requirements for renewal include an Accomplishment Report (with documentation), audited financial reports, amendments to By-Laws (if any), list of new officers, and the Master Plan for the upcoming year. Failure to seek recognition for one school year without justifiable cause results in the loss of privileges to use Institute facilities.\n\n**Status and Nature**\nThe Institute Student Government (ISG) acts as the mother organization monitoring all Recognized Student Organizations (RSO). Organizations are classified by status as either **Regular** (satisfactory performance) or **Probationary** (demoted due to failure to meet requirements). They are also classified by nature:\n* **College-Based Organizations:** Support the academic development of members in specific programs.\n* **Institute Organizations:** Focus on social, cultural, religious, literary, and recreational aspects.\n\n**Revocation**\nA Certificate of Recognition may be revoked after due process if an organization violates its own constitution, fails to comply with Institute policies, or ignores SAS circulars.",
    "keywords": [
      "student organization accreditation",
      "OSAS",
      "recognition requirements",
      "renewal of accreditation",
      "probationary status",
      "college-based organizations",
      "ISG",
      "revocation of recognition"
    ]
  },
  {
    "id": "article_x_activity_management_fundraising_off_campus",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organizations",
    "topic": "Activity Approvals, Off-Campus Events, and Fundraising Rules",
    "content": "Article X, Sections 7 through 9, mandates strict protocols for student activities and fundraising. All curricular and extra-curricular activities falling under ISG jurisdiction must be approved by the Institute President through the Vice President for Academic Affairs (VPAA) and the SAS Director. \n\n**Activity Approval Requirements**\nProposals must be supported by an Activity Proposal Form, a letter to the President, budgetary allocation, venue reservation, and profiles of speakers. For outside activities, parental waivers are required. Solicitation letters and external communications must be noted by the Adviser and Dean, recommended by the SAS Director, and approved by the President. Activities are prohibited one week before and during major examinations. Post-activity reports (Performance Report, Evaluation, and Financial Statement) must be submitted within 5 days; failure to do so prohibits future activities.\n\n**Off-Campus and Overnight Activities**\nTo authorize off-campus or overnight events, organizations must secure OSAS approval, notarized parental waivers, and the adviser's letter of conformity. Compliance with CHED requirements is mandatory. A faculty adviser must attend the activity; if unavailable, a substitute faculty member must be designated 2 days prior. The ideal ratio is one faculty guardian for every 30 student participants.\n\n**Fundraising Policies**\nRecognized organizations are limited to **one fundraising activity per school year**. Applications must be submitted 30 days in advance with a project proposal, IGP form, list of beneficiaries, and endorsements. An audited financial report certified by the faculty adviser must be submitted to OSAS within 5 days of the event. The SAS Director reserves the right to re-audit reports.\n\n**Posting of Notices**\nPosters and notices are restricted to freedom boards or locations authorized by the OSAS Director. Proponents must be clearly identified and are answerable for complaints.",
    "keywords": [
      "activity proposal",
      "fundraising policy",
      "off-campus activity",
      "parental waiver",
      "faculty ratio",
      "solicitation letter",
      "freedom board"
    ]
  },
  {
    "id": "article_x_financial_rules_advisers_awards",
    "source": "Student Handbook 2021",
    "category": "Article X - Student Organizations",
    "topic": "Financial Regulations, Faculty Advisers, and Awards",
    "content": "Article X, Sections 10 through 16, outlines the financial governance, supervision, and rewards system for student organizations.\n\n**Faculty Advisers**\nEach organization must have one full-time faculty adviser with at least one year of residency. Advisers are designated by the Dean (for college-based orgs) or the OSAS Director (for institutional orgs). A faculty member may advise only one organization per school year. Advisers must closely monitor fund disbursements and are essential for activity supervision.\n\n**Financial Guidelines**\n* **Membership Fees:** Collection is voluntary and not a prerequisite for enrollment. Fees for College-Based Organizations are capped at **P100.00 per school year**. Increases require majority agreement, confirmation by the Dean, and Presidential approval.\n* **Banking:** Organizations with funds accumulating to **P10,000** must open a government depository bank account. . Signatories include the Organization President/Treasurer and the College Dean (or designated faculty) for college-based groups, or the OSAS Director for institutional groups.\n* **Withdrawals:** Resolutions to withdraw funds require signatures from the majority of officers.\n* **Liability:** Officers with financial liabilities must pay the exact amount to the Financial Management Services (FMS). New officers may file cases against former officers for unsettled obligations via the EARIST Grievance Committee.\n\n**Electronic Delivery**\nAccreditation applications and activity proposals are submitted via the official OSAS email. Announcements are posted on official social media accounts.\n\n**Recognition and Awards**\nThe Institute grants various awards for outstanding performance:\n* **Academic Awards:** Summa Cum Laude, Magna Cum Laude, Cum Laude, and Academic Excellence.\n* **Service Awards:** Outstanding Student Organization and Outstanding Leader.\n* **Other Categories:** Cultural Awards, Sports and Development Awards, and Research Awards.\n* **Monetary Incentives:** Given for National Recognition in PRC/Government Exams and Skills Competitions.",
    "keywords": [
      "faculty adviser qualifications",
      "membership fees",
      "bank account requirements",
      "financial liability",
      "academic awards",
      "monetary incentives",
      "electronic submission"
    ]
  },
  {
    "id": "article_xi_campus_publication_guidelines",
    "source": "Student Handbook 2021",
    "category": "Article XI - Guidelines on Campus Publication",
    "topic": "Management, Editorial Policy, and Funding of Student Publications",
    "content": "Under Article XI, the Institute recognizes the right of students to free expression as embodied in the Constitution and the Campus Journalism Act of 1991 (Republic Act 7079). Student publications—including newspapers, magazines, yearbooks, and journals—are coordinated by the Office of Student Affairs and Services (OSAS) through the Chief of Student Publication.\n\n**Editorial Management and Appointments**\nThe Publication Chief and Technical Adviser are appointed by the Institute President upon the recommendation of the OSAS Director. For the Technical Adviser specifically, the Board of Editors submits three nominees to the OSAS Director for endorsement to the President. The Editorial Board is solely responsible for published materials, operating under Editorial Policies approved by the Board of Editors. Violations of these policies or professional journalism standards are subject to disciplinary action, including suspension or expulsion from the staff.\n\n\n**Funding and Financial Management**\nFunding is derived from student subscription fees collected during enrollment, as well as advertisements, donations, and grants. These funds are for the exclusive use of the publication (printing costs, training, supplies). Publication fees are determined by the Board of Editors in consultation with the student body and approved by the Board of Trustees (BOT). The Student Publication is required to open a passbook checking account in a government depository bank. Financial transactions require two signatories: the Editor-In-Chief or Managing Editor as one signatory, and the Director of OSAS as the co-signatory. Financial statements must be submitted to OSAS and Financial Management Services (FMS).\n\n**Digital Transition**\nIn compliance with CHED CMO No. 8, series of 2021, the Student Publication Office must provide software to convert print materials into E-publications.",
    "keywords": [
      "campus journalism",
      "RA 7079",
      "editorial board",
      "publication funds",
      "student newspaper",
      "financial signatories",
      "digital publication"
    ]
  },
  {
    "id": "article_xii_xiii_xiv_campus_expression_activities_information",
    "source": "Student Handbook 2021",
    "category": "Article XII, XIII & XIV - Activities and Information Policy",
    "topic": "Religious Services, Cultural Programs, and Information Dissemination Guidelines",
    "content": "Articles XII, XIII, and XIV consolidate the guidelines regarding student expression, activities, and the dissemination of information via physical and digital channels.\n\n**Religious Activities (Article XII)**\nThe Institute respects the free exercise of religion and maintains the interfaith character of the Institute Chapel. Religious activities must not violate existing policies or academic goals. The use of classrooms for religious groups requires permission from Institute authorities.\n\n**Cultural Programs (Article XIII)**\nAll cultural programs must align with academic objectives and secure prior approval from the Office of the President through the VPAA, as recommended by OSAS. Proponents must submit a letter of request, tentative program, production staff list, and budget to OSAS through the EARIST Cultural Affairs Division (ECAD). Changes to the project must be reported to ECAD two days prior, and post-activity documentation is due five days after the event.\n\n\n**Right to Proper Information and Social Media (Article XIV)**\n* **Social Media Policy:** Students act as representatives of the Institute online. The Institute reserves the right to request the removal of content that risks the reputation of EARIST. All digital materials for official accounts must be signed by the SAS Director and endorsed to the Information and Public Affairs Services (InfoPAS).\n* **Physical Posting:** Announcements require the SAS Director's signature and must be posted only on designated bulletin boards. Posters must be neat, clear, and free from excessive aesthetics. The posting group is responsible for removal and liable for damages.\n* **Logo and Trademarks:** The use or imitation of the EARIST Logo for documents, merchandise, or services requires a permit from InfoPAS. This includes institutional collateral (brochures, calling cards) and souvenir items (jackets, mugs).",
    "keywords": [
      "interfaith services",
      "cultural affairs",
      "event approval",
      "social media policy",
      "EARIST logo usage",
      "posting guidelines",
      "ECAD",
      "InfoPAS"
    ]
  },
  {
    "id": "article_xv_xvi_international_affairs_effectivity",
    "source": "Student Handbook 2021",
    "category": "Article XV & XVI - International Affairs and Effectivity",
    "topic": "International Linkages, Internships, and Handbook Effectivity",
    "content": "Under Article XV, the Office of the International Affairs Service (OIAS) serves as the technical secretariat coordinating international dimensions of EARIST, pursuant to CHED Memorandum Order 55, Series of 2016. The OIAS manages student mobility and partnerships involving international organizations.\n\n**International Linkages**\nThe Institute facilitates various programs:\n* **Exchange Visitors Program:** Implements the Mutual Education and Cultural Exchange Act.\n* **Cultural Exchange Program:** Promotes mutual understanding through the exchange of students, athletes, and artists.\n* **Study Abroad Program:** Allows students to live and study in a foreign country.\n* **Academic Short Courses:** Combinations of courses leading to certificates or concentrations.\n\n\n**International Internship**\nThis involves the application of classroom learning to actual work abroad (commercial, industrial, or government) for a duration ranging from six (6) months to one (1) year, for the purpose of completing an academic degree.\n\n**Effectivity (Article XVI)**\nThe policies and regulations within the Student Handbook apply to all bona fide students and take effect immediately upon approval by the Board of Trustees.",
    "keywords": [
      "International Affairs Service",
      "OIAS",
      "study abroad",
      "international internship",
      "exchange student",
      "cultural exchange",
      "CHED CMO 55"
    ]
  }
]