[
    {
        "id": "earist_institutional_mandate_vision_mission",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "General Information",
        "topic": "Mandate, Vision, Mission, and Philosophy",
        "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST) was created under Republic Act No. 6595 on September 30, 1972. Its mandate is to establish a trade technical education department, vocational-technical teacher education department, and graduate education department, offering opportunity and technician courses essential to the needs of Manila and the metropolitan area. The Institute's Vision is to be a center of excellence in trades, business, arts, science, and technology education. Its Mission is to produce vocationally, technically, technologically, and scientifically trained graduates who are economically productive, self-sufficient, effective, responsible, and disciplined citizens. The Goals of EARIST include providing professional, scientific, technological, technical, and vocational instruction; promoting research, advanced studies, and progressive leadership; and striving for academic excellence through accreditation. The Institute's Philosophy holds that education is a plexus of knowledge and skills applied to the economic, social, and moral development of self-actualized and productive citizenry. EARIST aims to attain university status through Unity, Solidarity, and Teamwork.",
        "keywords": [
            "Republic Act No. 6595",
            "trade technical education",
            "vocational-technical teacher education",
            "center of excellence",
            "university status"
        ]
    },
    {
        "id": "op_procurement_approvals",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of the EARIST President",
        "topic": "Approval of Procurement Documents (Purchase Requests, POs, Abstracts, Awards)",
        "content": "Under the Office of the EARIST President, several Government-to-Government (G2G) services manage the approval of procurement-related documents. These services are available to Executive Officials, Faculty, and Employees.\n\nFor the **Purchase of Materials and Equipment** (Service 1), the client must submit an Endorsement Letter from the Dean/Director, a Recommendation Letter from the concerned Vice President, and a photocopy of the Annual Procurement Plan (APP) reflecting the requested items. The Staff at the Office of the President checks the propriety of the request (15 mins), and the Procurement Services Staff verifies if the item is in the APP (15 mins). Total processing time is 30 minutes.\n\nFor the **Approval of Purchase Orders (PO)** (Service 14), the client requires an Approved Request, Certificate of Availability of Funds (CAF) from the FMS Office, a Special Order from the Office of the President, an Abstract of Canvass, a BAC/Board Resolution, and the signature of the end-user. The Staff at the Office of the President checks for signatory completeness (15 mins), and the Staff at the Procurement Office prepares the Board Resolution (15 mins). Total processing time is 30 minutes.\n\nFor the **Abstract of Bids** (Service 15) and **Award of Contract/Notice to Proceed** (Service 16), requirements include the initial request funded by FMS, a BAC Resolution with supporting documents, and Board approval of the project. The process involves the Executive Vice President or Staff checking signatory completeness (15 mins) and the College/Board Secretary preparing the Board Resolution (15 mins). The total processing time for each of these services is 30 minutes. All services in this cluster require no fees.",
        "keywords": [
            "Purchase Request",
            "Annual Procurement Plan",
            "APP",
            "Purchase Order",
            "Abstract of Canvass",
            "Notice to Proceed",
            "BAC Resolution",
            "Board Resolution",
            "Procurement Services"
        ]
    },
    {
        "id": "op_financial_approvals",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of the EARIST President",
        "topic": "Financial Approvals (Replenishment, Vouchers, Utilities, LDDAP)",
        "content": "The Office of the EARIST President processes several financial approvals for Faculty, Employees, and Executive Officials (G2G transactions).\n\nFor **Replenishment, Liquidation, and Reimbursement** (Service 4), the client must submit a Letter Request endorsed by the Dean/Director and recommended by the Vice President, the Approved Initial Request, Official Receipts, a photocopy of the Special Order, and a photocopy of the activity conduct report (e.g., Attendance Sheet). The Staff checks for endorsements and supporting documents. The total processing time is 30 minutes.\n\nFor **Vouchers** (Service 10) and **LDDAP, Checks, ACIC** (Service 12), the client must secure an Approved Request Resolution, Certificate of Availability of Funds (CAF) from FMS, a copy of the Special Order or Board Resolution, and an initial by the Director of IAS. For LDDAP/Checks, this service is also available to external clients (suppliers). The process involves checking for the completeness of signatories by the Staff of the Office of the President. The total processing time is 30 minutes for each service.\n\nFor the **Payment of Obligations** such as gasoline, electricity, and water (Service 11), the requirements include a Letter Request duly endorsed by the Dean/Director and recommended by the Vice President, and a Statement of Account checked by the FMS and IAS Office. The Staff at the Office of the President checks for endorsements by the Director of Administrative Services and recommendations by the Vice President. Total processing time is 30 minutes. There are no fees collected for any of these financial services.",
        "keywords": [
            "Replenishment",
            "Liquidation",
            "Reimbursement",
            "Vouchers",
            "LDDAP",
            "ACIC",
            "Certificate of Availability of Funds",
            "CAF",
            "Gasoline Payment",
            "Utility Payment"
        ]
    },
    {
        "id": "op_event_activity_approvals",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of the EARIST President",
        "topic": "Approval for Seminars, Conferences, and Activities",
        "content": "The Office of the EARIST President manages approvals for academic and extension activities. These services are classified as G2G (Government to Government) and G2C (Government to Citizen), available to Officials, Faculty, Employees, and Students.\n\nFor **Attendance to Seminars/Conferences** (Service 2), the client must provide an Endorsement Letter from the Dean/Director, a Recommendation Letter from the Vice President, an Invitation with the attached Initial Request, a Certificate of Availability of Fund (if budget is required), and a Recommendation for a Substitute (if applicable). The Staff at the Office of the President checks for proper endorsements (15 mins). If the event is on Official Time only or requires budget allocation, the Staff prepares the Office Order (15 mins). Total processing time is 30 minutes.\n\nFor **Budget for Activities** such as seminars or extension activities (Service 3), requirements include Endorsement and Recommendation Letters, a Program of Activities, a Certificate of Availability of Funds from FMS, and an Eligibility/Classification of Expenditure document from FMS. The process involves checking endorsements and preparing a Special Order. The total processing time is 30 minutes.\n\nFor the **Use of Institute Vehicle/Facilities** (Service 6), clients must submit a Letter Request duly endorsed by the appropriate Official and an Accomplished/Approved Trip Ticket secured from the Office of Administrative Services. The Staff checks for endorsements by the Dean/Director and Vice President. Total processing time is 30 minutes. No fees are required for these approvals.",
        "keywords": [
            "Seminar Attendance",
            "Conference Attendance",
            "Extension Activity",
            "Program of Activities",
            "Institute Vehicle",
            "Trip Ticket",
            "Special Order",
            "Office Order"
        ]
    },
    {
        "id": "op_personnel_administrative_actions",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of the EARIST President",
        "topic": "Personnel Administrative Actions (Reinstatement, Retirement, Change of Time)",
        "content": "The Office of the EARIST President handles administrative approvals regarding the employment status of Faculty and Employees (G2G transactions).\n\nFor **Reinstatement** (Service 5), the client must submit an Endorsement Letter from the Dean/Director, a Recommendation Letter from the Vice President, an Invitation/Initial Request, and a Certificate of Availability of Fund or Recommendation for a Substitute. The Executive Vice President or HRMS Staff checks the documents. Total processing time is 30 minutes.\n\nFor **Retirement** (Service 7), the client needs a Letter Request endorsed by the appropriate Official and a duly accomplished General Clearance from the HRMS Office. The Executive Vice President or HRMS Staff checks for the endorsement by the Dean/Director and Vice President. Total processing time is 30 minutes.\n\nFor **Change of Official Time** (Service 8), the requirement is a Letter Request duly endorsed by the appropriate Official and a duly accomplished form. The Staff at the Office of the President or HRMS Office checks for endorsements. Total processing time is 30 minutes. No fees are charged for these personnel actions.",
        "keywords": [
            "Reinstatement",
            "Retirement",
            "Change of Official Time",
            "General Clearance",
            "HRMS",
            "Faculty Status",
            "Employee Status"
        ]
    },
    {
        "id": "op_document_signatories_moa",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of the EARIST President",
        "topic": "Signatories for Clearances, Diplomas, and Memoranda of Agreement (MOA)",
        "content": "The Office of the EARIST President provides signature approvals for critical legal and academic documents. These services serve both Internal (Faculty, Employees, Students) and External clients.\n\nFor **Clearances, Leave Forms, Class Programs, Diplomas, and Certificates** (Service 13), the client must ensure the document has the following signatures before submission to the President: Dean/Director, Supervisor/AS Director/HR, Endorsement of the Vice President for Academic Affairs (VPAA), Registrar, and the concerned Vice President. The Staff at the Office of the President checks for the completeness of these signatories. Total processing time is 30 minutes.\n\nFor a **Memorandum of Agreement (MOA)** (Service 17), the requirements include an initial request funded by the FMS, a BAC Resolution with supporting documents, and Board approval of the project/procurement. The Executive Vice President or Staff checks for completeness of signatories and proper endorsement (15 mins), followed by the preparation of a Board Resolution by the College/Board Secretary (15 mins). Total processing time is 30 minutes. No fees are collected.",
        "keywords": [
            "Diploma Signature",
            "Clearance Signature",
            "Class Program",
            "Memorandum of Agreement",
            "MOA",
            "Board Resolution",
            "Signatory Completeness"
        ]
    },
    {
        "id": "op_tuition_refund",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of the EARIST President",
        "topic": "Refund of Tuition Fees",
        "content": "The Office of the EARIST President approves the **Refund of Tuition Fees** (Service 9), a Government-to-Citizen (G2C) transaction available to Students (External Clients). \n\nTo avail of this service, the student must secure a Basic Request letter that is endorsed by the Dean and recommended by the Vice President (secured from the Student and SAS Office) and a photocopy of the Certificate of Registration (COR) (secured from the SRRMS Office). \n\nThe client submits these required documents to the Staff at the Office of the President. The Agency Action involves checking for the endorsement by the Dean or Director and the recommendation by the Vice President. The persons responsible for this process include the Staff at the Office of the President, FMS Office, and SAS Office. The service requires no fees and has a total processing time of 30 minutes.",
        "keywords": [
            "Tuition Refund",
            "Student Refund",
            "Certificate of Registration",
            "COR",
            "SAS Office",
            "FMS Office"
        ]
    },
    {
        "id": "internal_audit_services_general",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Internal Audit Services",
        "topic": "Special Audit and Request for Audit Records",
        "content": "The Internal Audit Services (IAS) provides critical auditing functions for the Institute, available primarily to the President and other internal units (G2C/G2G).\n\nFor the **Special Audit (Assurance and Advisory)** (Service 1), which is classified as Highly Technical, the service is requested by the President to address issues on governance, risk assessment, and control processes. The President must submit a request letter to the IAS Director. The process begins with the Staff of the Office of the President sending the request, which is recorded by the Internal Auditing Assistant (15 mins). The IAS Director evaluates the request and assigns it to an Internal Auditing Assistant (2 Hours). The Assistant prepares the Audit Program for approval (4 Hours), and the Director sends a Notice of Audit (2 Hours). The field work is performed over 29 Working Days. Finally, the Exit Conference is scheduled, and the Audit Report is prepared, approved, and submitted to the President. The total processing time is 30 Days, 9 Hours, and 18 Minutes. No fees are required.\n\nFor the **Request for Audit Records** (Service 2), intended for the Commission on Audit (COA) and Heads of Offices (Internal/External), the client must secure an Approved Request from the Office of the President. The Internal Auditing Assistant receives the approved request (3 mins), forwards it to the IAS Director (3 mins), locates and reproduces the report (2 Hours), and records the distribution (3 mins). The report is then released to the recipient. The total processing time is 2 Hours and 12 Minutes. No fees are collected.",
        "keywords": [
            "Special Audit",
            "Audit Records",
            "Risk Assessment",
            "Notice of Audit",
            "Audit Report",
            "Commission on Audit",
            "COA"
        ]
    },
    {
        "id": "planning_services_infrastructure_projects",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Planning Services",
        "topic": "Infrastructure Project Proposals and Project Inspection",
        "content": "The Planning Services Office assists Internal Clients with infrastructure planning and monitoring (G2G transactions).\n\nFor **Assistance in the Production, Conceptual Plans/Design, Budgetary Estimates, and Initial Documents for Infrastructure Project Proposals** (Service 1), the client must submit an Approved Request Letter from the President, a sketch of ideas, a list of spatial requirements, and other reference documents. Upon approval, the President sends the letter to the Planning Director (15 mins), who assigns the project to the Project Management Unit (PMU) Director (3 Days). The PMU conducts an ocular visit, interviews personnel, and takes measurements (2 Days). The PMU then prepares the conceptual plans, designs, and budgetary estimates (7 Days). The documents are presented to the Planning Director (1 Day) and then submitted to the requesting College/Office (1 Day). The PMU keeps a receiving copy (1 Day). The total processing time is 15 Days and 15 Minutes.\n\nFor **Project Inspection and Similar Activities** (Service 2), which checks ongoing projects, the client requires an Approved Request Letter from the President, reference documents from the PMU, and an accepted schedule if external agencies (e.g., DPWH) are involved. The process involves the Planning Director assigning the task to the PMU (1 Day), followed by the PMU and Planning Director performing the inspection (1 Day). If coordination with an external consultant/agency is needed, it takes an additional 3 Days. The total processing time is 5 Days and 15 Minutes. No fees are charged for these services.",
        "keywords": [
            "Infrastructure Proposals",
            "Conceptual Plans",
            "Budgetary Estimates",
            "Project Inspection",
            "PMU",
            "Project Management Unit",
            "Ocular Visit"
        ]
    },
    {
        "id": "planning_services_reporting_compliance",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Planning Services",
        "topic": "Dissemination of Information and Regulatory Reporting (COA, DBM, PBB)",
        "content": "The Planning Services Office manages mandatory reporting and information dissemination for the Institute (G2G).\n\nFor **Dissemination of Information** (Service 3), regarding status, requirements, and government programs, the Director of Planning Services prepares and sends communication letters to respective offices based on new guidelines from government agencies. Total time: 1 Day.\n\nFor **Submission of Quarterly Report of Status of Government Projects to COA** (Service 4), the Planning Director signs the report (10 mins), prepares the communication signed by the Head of Agency (15 mins), and submits it to COA (10 mins). Total time: 35 minutes.\n\nFor **Submission of Reports on Physical Accomplishments to DBM** (Service 5) (Quarterly/Semi-annual/Annual), the Planning Director requests required documents such as Enrollment Data (SRRMS), Accreditation Status (Quality Assurance), Tracer Studies (VPAA), Research Status (R&D), and Extension Projects (Extension Services). Data is consolidated and encoded into the system (1 Day), submitted online (15 mins), and the physical accomplishment report is signed (15 mins). Total time: 2 Days and 35 Minutes.\n\nFor **Submission of Annual Performance-Based Bonus (PBB) Requirements** (Service 6), the Planning Office ensures compliance for PBB incentives. Requirements include Physical Accomplishment, Client Satisfaction (Planning), Transparency Seal (InfoPAS/Procurement), QMS Certification (QA), Financial Reports (FMS/IAS), and SALN/FOI (HRMS/InfoPAS). The Staff receives and gathers documents (15 mins), the Director reviews them (15 mins), reproduces documents (5 Days), prepares the communication (15 mins), and submits to the AO25 Secretariat (1 Day). Total time: 9 Days and 20 Minutes. No fees apply.",
        "keywords": [
            "Dissemination of Information",
            "COA Report",
            "DBM Report",
            "Physical Accomplishment",
            "PBB",
            "Performance-Based Bonus",
            "AO25 Secretariat",
            "Transparency Seal"
        ]
    },
    {
        "id": "legal_unit_student_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Institute Legal Unit",
        "topic": "Student Legal Services (MOA Review and Legal Opinions)",
        "content": "The Institute Legal Unit provides Highly Technical legal services to Students (G2C).\n\nFor the **Review of Memorandum of Agreement (MOA) of Students** (Service 1), students must submit a draft MOA or request letter, supporting documents, an Endorsement Letter from the Dean/Head of Office, and a soft copy sent to legal@earist.edu.ph. The Staff receives the request (27 mins). The Legal Counsel/Assistant reviews and drafts comments (6 Days, 21 Hours). The Counsel reviews the assistant's draft (2 Days). If revisions are needed, the assistant revises (13 Hours) and the Counsel reviews again (13 Hours). The final draft is transmitted to the Office of the President for approval (5 Days). Upon return, it is registered, photocopied, and released. Total processing time: 19 Working Days, 1 Hour, and 54 Minutes.\n\nFor **Legal Opinion for Students** (Service 2), the student submits a request letter with pertinent documents. The Legal Counsel assigns the query (3 mins). The Legal Assistant drafts the opinion (7 Days, 15 Hours). The Counsel reviews the draft (2 Days). If revisions are required, the assistant revises (16 Hours), and the Counsel reviews again (16 Hours). The final opinion is sent to the President for approval (5 Days). Upon return, it is recorded and released. Total processing time: 17 Working Days, 1 Hour, and 25 Minutes. No fees are charged.",
        "keywords": [
            "Student MOA",
            "Memorandum of Agreement",
            "Legal Opinion",
            "Legal Review",
            "Student Contract"
        ]
    },
    {
        "id": "legal_unit_administrative_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Institute Legal Unit",
        "topic": "Administrative Legal Services (Opinions, Contract Reviews, Letter Drafting)",
        "content": "The Institute Legal Unit supports Administrative Employees, Faculty, and Offices (G2G) with legal documentation and advice.\n\nFor **Legal Opinion for Employees and Faculty Members** (Service 3), the client submits a request letter and documents. The process mirrors the student service: assignment, drafting by Legal Assistant, review by Counsel, revision cycles, and Presidential approval. Total time: 19 Working Days and 39 Minutes.\n\nFor **Review of MOA and Contracts of Colleges and Offices** (Service 4), the client submits the draft/request, supporting documents, Endorsement from the Dean, and a soft copy. The Legal Unit identifies the classification, evaluates compliance, and registers the document (27 mins). The Legal Assistant reviews/drafts comments (6 Days, 21 Hours), followed by Counsel review (2 Days). After necessary revisions and re-reviews, the document goes to the President for approval (5 Days). Total time: 19 Working Days, 1 Hour, and 54 Minutes.\n\nFor **Drafting of Letter Response** (Service 5), ensuring outgoing correspondence meets legal standards, the client submits a request letter and documents. The Legal Assistant drafts the response (5 Days, 15 Hours), the Counsel reviews (2 Days), and revisions are handled if necessary. The final draft is approved by the President. Total time: 17 Working Days and 39 Minutes. No fees apply.",
        "keywords": [
            "Legal Opinion",
            "Faculty Legal Support",
            "MOA Review",
            "Contract Review",
            "Letter Response",
            "Drafting"
        ]
    },
    {
        "id": "legal_unit_special_proceedings",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Institute Legal Unit",
        "topic": "Special Legal Services (Procurement, Administrative Cases, CODI)",
        "content": "The Institute Legal Unit handles specialized legal proceedings and committee support (G2G/G2C).\n\nFor **Legal Services on Procurement/Special Committees/Technical Working Groups** (Service 6), Chairpersons or Members submit a request letter and documents. The Legal Counsel assigns the query, the Assistant drafts the opinion (7 Days, 15 Hours), and the Counsel reviews (2 Days). Following revisions and Presidential approval, the opinion is released. Total time: 19 Working Days and 39 Minutes.\n\nFor the **Disposition of Ordinary Administrative Cases** (Service 7), involving employees or faculty, the Legal Unit reviews the Resolution drafted by Human Resources. This process is governed by the 2017 Rules on Administrative Cases in the Civil Service (RACCS) and is **exempted from RA 11032**. The processing time is within 30 days from the date the case is submitted for resolution.\n\nFor the **Disposition of Sexual Harassment Cases (CODI)** (Service 8), involving employees, faculty, or students, the investigation is handled by the Committee on Decorum and Investigation (CODI). The Legal Office receives complaints, transmits them to CODI, and writes the Resolution after CODI submits the case. This is governed by the CODI Manual and CSC Resolution No. 01-0940, and is also **exempted from RA 11032**. The processing time is 30 Working Days. No fees are charged for these services.",
        "keywords": [
            "Procurement Legal Service",
            "Administrative Cases",
            "Sexual Harassment",
            "CODI",
            "Committee on Decorum and Investigation",
            "RACCS",
            "RA 11032 Exemption"
        ]
    },
    {
        "id": "pmu_project_proposals",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Project Management Unit",
        "topic": "Institute and End-User Initiated Project Proposals",
        "content": "The Project Management Unit (PMU) handles Highly Technical architectural and engineering services for internal clients (EARIST Administration and Offices).\n\nFor **Institute Initiated Project Proposals** (Service 1), the process begins with a Direct Instruction from the President. The PMU receives the Capital Outlay instruction (1 Day) and conducts a meeting/interview with the end-user (1 Day). The Technical Staff performs an ocular inspection of the site (1 Day) and collaborates to formulate the initial design solution and Conceptual Plan (21 Days). The requesting party reviews and approves the initial design (7 Days for review, 1 Day for return). The PMU then formulates the final design, Scope of Work (SOW), and Budgetary Estimate (21 Days). After a final review (3 Days), documents are submitted to the President for final approval (3 Days). The total processing time is 60 Working Days.\n\nFor **End-Users Initiated Project Proposals** (Service 2), departments or colleges must submit a Request Letter approved by the President. The PMU receives the request (1 Day), conducts an interview (1 Day), and performs an ocular inspection (1 Day). The team formulates the initial design solution (21 Days), which the end-user reviews (7 Days). Upon approval, the PMU prepares the final plans, SOW, and budget costing (21 Days). Following a final review (3 Days) and submission (1 Day), the President gives final approval (3 Days). The total processing time is 60 Working Days. No fees are charged for these services.",
        "keywords": [
            "Project Proposal",
            "Conceptual Plan",
            "Scope of Work",
            "SOW",
            "Budgetary Estimate",
            "Ocular Inspection",
            "Capital Outlay"
        ]
    },
    {
        "id": "pmu_technical_assistance",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Project Management Unit",
        "topic": "Technical Assistance to BAC and Project Monitoring",
        "content": "The Project Management Unit (PMU) provides Highly Technical assistance to internal committees.\n\nFor **Assistance to the Bids and Awards Committee (BAC)** (Service 3), the PMU serves as a Technical Working Group (TWG) for infrastructure projects. The process requires an Approved Letter by the President. The PMU receives instructions (1 Day) and prepares required technical documents like Technical Drawings and Bill of Quantities (21 Days). The PMU Director reviews the documents (3 Days), submits them to the End-user (1 Day), who then reviews them (3 Days). Finally, the documents are submitted to the President (1 Day). Total processing time is 30 Working Days.\n\nFor **Assistance to Project Monitoring Officer** (Service 4), the PMU assists the Administrative Services in inspecting ongoing projects. Upon receiving an Approved Request from the President (1 Day), the PMU provides assistance such as project inspection and report preparation (21 Days). The Director conducts a final review (3 Days) and submits the documents to the President (1 Day). Total processing time is 26 Working Days. No fees are required.",
        "keywords": [
            "Bids and Awards Committee",
            "BAC Assistance",
            "Technical Working Group",
            "TWG",
            "Project Monitoring",
            "Infrastructure Inspection"
        ]
    },
    {
        "id": "mis_it_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Management Information Services",
        "topic": "Email, Internet, System Access, and IT Resources",
        "content": "The Management Information Services (MIS) Office provides IT support to Internal and External Clients.\n\nFor **Institute Email** (Service 1), the client submits a filled-up Access/Request Form. The Head Unit receives it (5 mins), the Director evaluates/approves it (15 mins), and the Head Unit creates the account (15 mins). Total time: 35 Minutes.\n\nFor **Request for Internet/Network Connection** (Service 2), the client submits a letter request approved by their Office Head. The MIS Director evaluates the location and approves the connection type (5 Days). Total time: 5 Days and 15 Minutes.\n\nFor **Request for Access to Campus Information System** (Service 3), the client submits an Access/Request Form. The Head Unit receives it (5 mins), the Director approves (10 mins), and the Head Unit adds the user rights (10 mins). Total time: 25 Minutes.\n\nFor **Request for IT Resources** (Service 4), the client identifies IT equipment (desktop, laptop, etc.) and submits a request to the Head of IT. The Director evaluates the request against office needs (3 Days). Total time: 3 Days and 5 Minutes. No fees are collected for these services.",
        "keywords": [
            "Institute Email",
            "Internet Connection",
            "Network Access",
            "Campus Information System",
            "IT Equipment Request"
        ]
    },
    {
        "id": "web_infopas_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Web Development & InfoPAS",
        "topic": "Website Posting and Freedom of Information (FOI)",
        "content": "This section covers public information services provided by the Web Development Services and Information and Public Affairs Services (InfoPAS).\n\nFor **EARIST Official Website** postings (Service 1), clients (HRMS, FMS, Procurement, InfoPAS, IPMO) submit required documents (e.g., Transparency Seal, BAC documents). The Web Development Staff posts the content. Each posting type takes approximately 15 minutes. Total processing time is 60 Minutes if all types are processed .\n\nFor **Freedom of Information (FOI) Request** (Service 1), available to the public (G2C), the client must present a Government Issued ID and sign the logbook (5 mins). The client fills up the FOI Request Form (5 mins) and submits it. The FOI Receiving Officer screens the request (10 mins) and forwards it to the FOI Decision Maker (FDM) (1 Day). The FDM assesses the request (3 Days). The Officer prepares the documents (5 Days for simple, 10 Days for complex). The client claims the documents (5 mins). Total processing time is 14 Days and 25 Minutes. No fees are charged.",
        "keywords": [
            "Official Website",
            "Transparency Seal",
            "Freedom of Information",
            "FOI",
            "Public Records"
        ]
    },
    {
        "id": "ipmo_registration",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Intellectual Property Management Office",
        "topic": "Request for Assistance on Intellectual Property Registration",
        "content": "The IPMO-ITSO assists Faculty (Internal Clients) with **Intellectual Property Registration** (Service 1) to the IPOPHL. \n\nClients must submit electronic and printed copies of the IPMO-ITSO Invention Disclosure Form, Notarized Deed of Assignment, Notarized Student-Faculty Research Agreement (if applicable), and screenshots/pictures of the creation. The client signs the logbook (5 mins). The Staff screens documents and endorses the application (10 mins). The Staff prepares a Prior Art Search Report (7 Days), which the Director checks (3 Days). The Director facilitates payment and drafts the IP Specification (10 Days). If a formality report requires revisions, the Director evaluates the revision (5 Days) and resubmits to IPOPHL (5 Days). Finally, the Director receives and releases the Certificate of IP Registration (10 mins). Total processing time is 24 Days and 25 Minutes. No fees are collected by the agency.",
        "keywords": [
            "Intellectual Property",
            "IP Registration",
            "Patent Application",
            "Prior Art Search",
            "Invention Disclosure",
            "Copyright"
        ]
    },
    {
        "id": "ialms_international_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "International Affairs and Linkages Management Services",
        "topic": "International Internship, Student Mobility, and Faculty Mobility",
        "content": "The IALMS handles highly technical international programs for Students and Faculty.\n\nFor **International Internship** (Service 1), students need a College Grade Evaluation, Endorsement Letters, Parent's Waiver, and Invitation Letter. The Director evaluates grades (7 Days) and checks documents. The College informs students of programs (7 Days) and endorses them (7 Days). IALMS screens documents (7 Days) and recommends successful candidates for a Final Interview. Candidates attend PDOS (7 Days). IALMS recommends approval to the Board of Trustees (BOT) (7 Days) and presents to BOT (3 Days). Finally, CHED approval is sought (3 Months) and Clearance is issued (1 Month). Total time: 5 Months and 23 Days.\n\nFor **Student Mobility (Temporary)** (Service 2), students apply for Outbound Cross International Study or Exchange. IALMS processes eligibility (3 Days) and secures approvals from the Program Chair/Dean (1 Day). Total time: 20 Days.\n\nFor **Faculty Mobility** (Service 3), covering Scholarships, Research Presentations, and Teaching Invitations, the faculty submits an Invitation, Endorsements, and Institute Approval. IALMS assists and processes documents with HRMS, FMS, and VPAA. Total time for each category is 3 Months. No fees are listed.",
        "keywords": [
            "International Internship",
            "Student Mobility",
            "Faculty Mobility",
            "Exchange Student",
            "Study Abroad",
            "CHED Approval"
        ]
    },
    {
        "id": "bdc_canteen_clearance",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Business Development Center",
        "topic": "Request for Issuance of Canteen Clearance",
        "content": "The Business Development Center (BDC) issues Canteen Clearances to concessionaires. This service is a requirement for the renewal of the lease contract and is a Government-to-Citizen (G2C) transaction available to Canteen Concessionaires or Tenants (External Clients) .\n\nTo avail of this service, the interested party must submit the **Original Copy of the Latest Billing/Statement of Accounts** and **Original or Photocopy of Official Receipts**.\n\nThe process begins with the client submitting the required documents to the Staff at the BDC, who verifies and validates them (5 Minutes). The Staff then prepares the Certificate of Canteen Clearance showing no outstanding balance (5 Minutes). The Director of the BDC signs the certification (5 Minutes). The Staff records the transaction in the Certified (Outgoing) Logbook (5 Minutes) and releases the documents to the interested party (5 Minutes). The total processing time is **25 Minutes**, and there are no fees collected for this specific clearance step.",
        "keywords": [
            "Canteen Clearance",
            "Concessionaire Clearance",
            "No Outstanding Balance",
            "Lease Renewal Requirement"
        ]
    },
    {
        "id": "bdc_facility_rental",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Business Development Center",
        "topic": "Rental of Institute Facilities",
        "content": "The Business Development Center manages the **Rental of the Institute's Facilities** for activities or events within school premises. This service is available to Student Organizations, Faculty, Employees, and Private Companies/Individuals (G2C/G2G) .\n\nThe client must submit a **Letter of Intent** stating the schedule of the activity (Original or Photocopy). The process involves the following steps:\n1.  **Submission and Evaluation**: The client submits the Letter of Intent. The BDC Staff receives and evaluates the availability of the venue (5 Minutes). If unavailable, the client must revise the date.\n2.  **Application Form**: The client secures an Application Form from the BDC Staff (5 Minutes).\n3.  **Approvals**: The concerned officials and the In-Charge of the Venue sign the form to acknowledge the schedule (1 Hour). The In-Charge personnel are Ferdinand Alvaro (Amphi-theater), Engr. Jorge Bautista (CEAFA Quad), or Pedro Rommel Kirong (Main Quad).\n4.  **Payment**: The client secures an Order of Payment from the BDC Director (5 Minutes) and pays the **Rental Fee of PHP 1,000.00/day** (or as indicated) at the Cashier, securing an Official Receipt (5 Minutes).\n5.  **Final Endorsement**: The BDC Director endorses the use of the facility to the Administrative Services and the Institute President, attaching the application, letter, and receipt (1 Hour). The BDC Director confirms the schedule with the venue in-charge (5 Minutes) .\n\nThe total processing time is **1 Hour and 30 Minutes**.",
        "keywords": [
            "Facility Rental",
            "Venue Rental",
            "Amphitheater",
            "CEAFA Quad",
            "Main Quad",
            "Event Venue"
        ]
    },
    {
        "id": "bdc_concessionaire_contracts",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Business Development Center",
        "topic": "Renewal and Application of Canteen Concessionaires",
        "content": "The Business Development Center handles lease contracts for Canteen Concessionaires (G2C).\n\n**Renewal of Contract of Lease (Service 3)**:\nExisting tenants must submit a Letter of Intent, Clearance/Certificate of No Outstanding Balance, and updated Legal Documents (Business Permits, Health/Sanitary Permits, BIR/DTI Registration, NBI/Police Clearance). The BDC Staff verifies documents (5 mins) and prepares an endorsement to the President (5 mins). The Staff prepares the Occupancy Permit and Contract (1 Hour). The Concessionaire signs the contract (5 mins). The Institute President signs the contract (1 Hour). The contract is notarized, recorded, and filed (15 mins total). Total processing time: **2 Hours and 40 Minutes** .\n\n**Application of New Canteen Concessionaire (Service 4)**:\nNew applicants must submit a Letter of Intent and Legal Documents. The process is Complex. The BDC Staff validates documents (5 mins) and prepares a shortlist (5 mins). The BDC Director posts the shortlist and contacts applicants for **Food Tasting** (7 Days). Applicants undergo an interview and Food Tasting activity to check food quality and affordability (3 Days). The Staff prepares the list of passers (1 Day). Successful applicants proceed to the contract preparation, signing, and notarization process similar to renewal (approx. 2 hours). Total processing time: **11 Days, 2 Hours, and 45 Minutes**.",
        "keywords": [
            "Canteen Lease",
            "Concessionaire Contract",
            "Food Tasting",
            "Occupancy Permit",
            "Lease Renewal"
        ]
    },
    {
        "id": "colleges_academic_records_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Vice President for Academic Affairs (Colleges)",
        "topic": "Curriculum, Grades, and Faculty Load Services",
        "content": "The Colleges provide academic record services to Students and Faculty (G2C/G2G).\n\n**Program Curriculum (Service 1)**: Clients request a copy of the Course Syllabus, Description, or Crediting. Requirements include a Log-in request and a Letter of Request. The Area Chairperson/Dean evaluates the request (1 Day) and endorses it to the SRRMS (1 Day). Total time: **2 Days**.\n\n**Completion of Grade (Service 2)**: This validates the Completion Form submitted by faculty. Requirements include the Completion Form with OR Number and Faculty Signature, and a Log-in receipt. The Dean's Office staff assists the client, signs the form, and returns the Student's Copy. Total time: **35 Minutes**.\n\n**Faculty Teaching Load (Service 3)**: This involves the preparation and assignment of teaching loads. Faculty must log in their request. The Dean's Office staff assists the faculty and provides the Computer System Generated Faculty Load Sheet Copy. Total time: **30 Minutes**.",
        "keywords": [
            "Program Curriculum",
            "Course Syllabus",
            "Completion of Grade",
            "Faculty Load Sheet",
            "Teaching Load"
        ]
    },
    {
        "id": "colleges_admission_registration_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Vice President for Academic Affairs (Colleges)",
        "topic": "Admission, Cross-Registration, and Subject Enlistment",
        "content": "The Colleges manage admission and subject enlistment processes (G2C/G2G) for students.\n\n**Admission/Enrollment - College Interview (Service 4.1)**: For new/transferee students. Requirements: Notice of Admission/ECAT Result, App Form, Chair's Evaluation. The Program Chairperson conducts the interview/assessment and issues the Advisement Slip. Total time: **2 Days**.\n\n**Cross-Registration (Service 4.2)**: For students taking subjects at other schools. Requirements: App Form, Chair's Evaluation, Dean's Approval, Withdrawal Form, Request Letter. The Dean's Office/Chairperson recommends approval. Total time: **1 Day**.\n\n**Withdrawal, Dropping, Changing, Adding Courses (Service 4.3)**: Requirements: App Form, Evaluation, Dean's Approval. The Program Chairperson/Dean assists the student. Total time: **1 Day**.\n\n**Approval of Excess/Overload (Service 4.4)**: For graduating students (max 12 units). Requirements: App Form, Evaluation, Dean's Approval, Request Letter. The Program Chairperson/Dean recommends approval. Total time: **1 Day**.",
        "keywords": [
            "College Interview",
            "Cross-Registration",
            "Dropping Subjects",
            "Adding Subjects",
            "Subject Overload",
            "Advisement Slip"
        ]
    },
    {
        "id": "colleges_student_affairs",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Vice President for Academic Affairs (Colleges)",
        "topic": "Student Activities and Complaints",
        "content": "The Colleges handle student organizations and grievances (G2C/G2G).\n\n**Student Activities (Service 5)**: This service validates requests to conduct activities or use facilities. Requirements include a Letter of Request recommended by the Program Chairperson and documents stated in **CHED Memorandum Order No. 63, s. 2017**. The College Dean reviews and recommends approval (1 Day). The VPAA endorses it to the President for final approval (1 Day). Total time: **2 Days**.\n\n**Student Complaints (Service 6)**: For verification and investigation of complaints. The student submits a **Written Complaint**. The College Dean assists the student and investigates, potentially endorsing the matter to the Grievance and Legal Counsel Office for proceedings. Total time: **3 Days**.",
        "keywords": [
            "Student Activities",
            "CHED Memo 63",
            "Student Complaints",
            "Grievance",
            "Event Approval"
        ]
    },
    {
        "id": "library_circulation_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Library Services",
        "topic": "Circulation, Photocopying, and Overnight Use of Materials",
        "content": "The Library Services manages the borrowing and reproduction of library materials for Students, Faculty, and Staff (G2C/G2G).\n\nFor **Circulation of Books (Students)** (Service 1.1), students present their COR/Student ID, search the OPAC, fill up a Borrower's Slip, and submit the Book Card at the charging desk. Returning materials involves handing them to the staff in exchange for the ID. Total time: 9 Minutes.\n\nFor **Circulation of Books (Faculty/Administrators)** (Service 1.2), the process is similar but requires an Employee ID. Borrowing and returning each take about 3-5 minutes, with a total processing time of 8 Minutes.\n\nFor **Online Library Services** (Service 1.3), users query via Facebook, Email, or Website. The Librarian verifies the scanned COR/ID (5 mins). For document delivery, users fill out a Google Form, and the library notifies them when ready for pickup (5 mins). Returns are handled via drop box and email acknowledgment (3 mins). Total time: 13 Minutes.\n\nFor **Photocopying Services** (Service 2), users present their ID, fill up a book card, and return the material after photocopying. Total time: 6 Minutes.\n\nFor **Overnight/Weekend Use** (Service 3), Students can borrow 2 books, while Staff/Full-time Faculty can borrow 5 (Part-time 3) per semester. Books must be returned by 10:00 AM the next service day. Lost books must be replaced. Processing time: 5 Minutes.",
        "keywords": [
            "Library Circulation",
            "Borrowing Books",
            "OPAC",
            "Online Library",
            "Overnight Book Use",
            "Photocopying"
        ]
    },
    {
        "id": "library_referral_facility_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Library Services",
        "topic": "Referrals and Facility Reservation",
        "content": "The Library Services facilitates access to external resources and internal facility usage (G2C/G2G).\n\nFor **Issuance of Referrals** (Service 4), enrolled students and faculty wishing to use other libraries present their ID/COR. The Librarian checks the schedule of the target institution (2 mins), fills up the referral slip (2 mins), and issues the referral letter with advice on guidelines (2 mins). Total time: 6 Minutes.\n\nFor **Reservation for Use of Equipment and Facilities** (Service 5), users must submit a Request Letter and ID/COR at least 3 days in advance. The staff checks availability (3 mins), the client fills up the log sheet (2 mins), and the staff provides guidelines (2 mins). Total time: 7 Minutes.",
        "keywords": [
            "Library Referral",
            "Library Reservation",
            "Facility Use",
            "Equipment Reservation",
            "Referral Letter"
        ]
    },
    {
        "id": "rds_awards_incentives",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Research and Development Services",
        "topic": "Research Awards and Incentives (AORA, ORA, Citation, Special Award)",
        "content": "The Research and Development Services (RDS) administers awards to promote quality research among Faculty and Staff (G2G).\n\nFor the **Annual Outstanding Research Award (AORA)** (Service 1), proponents submit an Abstract and Full Paper. The RDS verifies documents (3 days), Internal Reviewers evaluate (3 days), External Judges judge (3 days), and the President awards the plaque (1 day). Total time: 10 Days.\n\nFor the **Outstanding Researcher Awards (ORA)** (Service 2), proponents submit a Nomination Letter and documents. RDS verifies (3 days), lists nominees (2 days), the ICRA Chair evaluates (3 days) and recommends (3 days), and the President awards (1 day). Total time: 12 Days.\n\nFor the **Research Citation Award** (Service 3), available to tenured faculty/officials with 3 years of service, applicants submit proof of 10 citations. RDS screens (1 day) and endorses to ICRA (2 days). ICRA evaluates (3 days) and recommends (3 days). Awarding takes 1 day. Total time: 10 Days.\n\nFor the **Special Research Award** (Service 7) for winners in competitions, the proponent submits an application and proofs. RDS verifies (2 days) and endorses to the President (1 day). Awarding takes 1 day. Total time: 4 Days.",
        "keywords": [
            "AORA",
            "Outstanding Research Award",
            "ORA",
            "Research Citation",
            "Special Research Award",
            "Research Incentives"
        ]
    },
    {
        "id": "rds_presentation_proposals",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Research and Development Services",
        "topic": "Research Presentation and Proposals",
        "content": "The RDS supports the presentation and conduct of research projects (G2G).\n\nFor **Research Presentation** (Service 4), proponents submit an Invitation, Abstract, Notice of Acceptance, and Recommendation. RDS verifies (2 days) and recommends to the VPAA (1 day). The VPAA evaluates (1 day) and recommends to the President. The President verifies funds with FMS (2 days + 1 day confirmation) and issues a Staff Development Order (1 day). RDS accepts the liquidation report (2 days). Total time: 10 Days.\n\nFor **Research Proposal and Undertaking** (Service 5), proponents submit a Capsule Proposal and College Endorsement. RDS evaluates (2 days) and consolidates for VPAA (2 days). The Research Evaluation Committee assesses (2 days). FMS verifies funds (2 days + 1 day confirmation). The President approves, and the VPAA informs the proponent (2 days). The Memorandum of Research Undertaking is signed (2 days). Total time: 11 Days.\n\nFor **Research Publication Incentives** (Service 6), researchers submit Form No. 10 and supporting documents. RDS verifies (1 day) and recommends to VPAA (1 day). VPAA evaluates (1 day). The President approves (1 day), and awarding follows (1 day). Total time: 5 Days and 5 Minutes.",
        "keywords": [
            "Research Presentation",
            "Research Proposal",
            "Research Undertaking",
            "Publication Incentives",
            "Research Funding"
        ]
    },
    {
        "id": "nstp_certifications_serial_numbers",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "National Service Training Program",
        "topic": "Issuance of NSTP Certificates and Serial Numbers",
        "content": "The National Service Training Program (NSTP) Office provides certification services to Students (External Clients) who have passed their NSTP subjects. These are simple Government-to-Citizen (G2C) transactions.\n\nFor the **Issuance of Certification of Completion in NSTP 1** (Service 1), the student must present the Report of Grades (ROG) showing they passed NSTP 1. The Director of NSTP issues the certificate. The processing time is 30 minutes.\n\nFor the **Issuance of Certification as Graduate of NSTP CWTS/LTS** (Service 2), the student must present the ROG showing they passed both NSTP 1 and 2 with the same component. The Director of NSTP issues the certificate. The processing time is 30 minutes.\n\nFor the **Issuance of Serial Number (CWTS and LTS)** (Service 3), the student provides the ROG for NSTP 1 and 2. The Director of NSTP issues the serial number. The processing time is 30 minutes.\n\nAll services in this office require no fees.",
        "keywords": [
            "NSTP Certificate",
            "CWTS",
            "LTS",
            "Serial Number",
            "NSTP Completion",
            "Report of Grades",
            "ROG"
        ]
    },
    {
        "id": "extension_community_services_projects",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Extension and Community Services",
        "topic": "Conduct of Extension Programs, Projects, and Training",
        "content": "The Extension and Community Services (ECS) Office facilitates programs that validate curricular relevance through activities with LGUs, NGOs, and industries. This Highly Technical service is available to adopted Barangays, Schools, and Organizations (G2C).\n\nTo avail of **Extension and Community Services** (Service 1), the requesting party must secure a Community Needs Assessment Survey, a Letter of Request addressed to the ECS Director (signed by the Extension Project Chair and Dean), an Extension Project Proposal, Budgetary Requirements, MOA/MOU (if applicable), and Evaluation Forms.\n\nThe process begins with the Administrative Staff receiving the survey and request (30 mins). The Director coordinates with the requesting party and drafts the MOA/MOU if necessary (2 hours). Consultative meetings are held to discuss project details (2 hours). The Administrative Staff and Project Chair prepare and submit necessary documents (Proposal, Budget, Resource Persons) for endorsement (2 days). The Director prepares the Endorsement Letter (1 hour 30 mins).\n\nThe VPAA recommends approval (1 day), and the Institute President approves the activity and funds (1 week). The ECS implements and documents the activity (8 hours). Finally, the Project Chair/Dean submits the Liquidation Report, Terminal Report, and Evaluation Results (1 week). The total processing time is 17 Days and 14 Hours. No fees are collected.",
        "keywords": [
            "Extension Services",
            "Community Needs Assessment",
            "Extension Project Proposal",
            "MOA",
            "LGU Partnership",
            "Terminal Report"
        ]
    },
    {
        "id": "gad_programs_budgeting",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Office of Gender and Development",
        "topic": "GAD Plan and Budget (GPB) and Activity Proposals",
        "content": "The Office of Gender and Development (GAD) manages the Institute's gender-responsive programs and budgeting. This Highly Technical service is available to Internal and External Stakeholders (G2C).\n\nFor the **GAD Plan and Budget (GPB)** process, the GAD Staff gathers and reviews data from colleges (2 hours) and prepares the Annual GPB using the specified form (1 week). Deficiencies are returned for revision, and the final GPB is reviewed for the President's approval (1 day). Data is encoded into the PWC Website (5 hours) and endorsed to the CHED Regional Office (30 mins).\n\nFor **GAD Activities/Projects**, the requesting college/agency must submit a GAD Request Letter, Activity Proposal, and Budgetary Requirements. The Staff prepares the Project Proposal based on agreed details (2 days) and an Endorsement Letter (1 hour). The VPAA recommends approval (30 mins), and the President approves the activity and funding (1 day). The activity is implemented (1 week) and documented (8 hours). Finally, the Project Chair submits Liquidation, Terminal, and Evaluation Reports (1 week).\n\nThe total processing time for the complete cycle is 25 Days and 17 Hours. No fees are required.",
        "keywords": [
            "Gender and Development",
            "GAD Plan and Budget",
            "GPB",
            "PWC Website",
            "CHED Endorsement",
            "GAD Proposal"
        ]
    },
    {
        "id": "quality_assurance_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Quality Assurance",
        "topic": "Request for Documents and Accreditation Visit Attendance",
        "content": "The Quality Assurance (QA) Office provides services related to accreditation and document control for Internal Clients (G2G).\n\nFor the **Request for Quality Assurance Documents** (Service 1) (e.g., accreditation/ISO docs), the client submits a Request Letter to the QA Director. The Staff receives and reviews the request (1 hour), reproduces the documents (1 day), consults with the Unit Head for release (2 hours), logs the outgoing documents (1 hour), and issues them to the client (1 day). Total processing time is 2 Days and 5 Hours.\n\nFor the **Request to Attend Accreditation Survey Visits** (Service 2), applicable to EARIST AACCUP Accreditors, the client submits an Invitation Letter. The QA Staff evaluates the invitation and recommends it to the President (2 hours). Upon receiving the Special Order (1 day), the Accreditor attends the visit. Afterward, the Accreditor submits a report, which the QA Staff receives and reviews (1 hour). Total processing time is 2 Days and 4 Hours. No fees are charged for these services.",
        "keywords": [
            "Quality Assurance Documents",
            "Accreditation Survey Visit",
            "AACCUP",
            "ISO Documents",
            "Accreditor Report"
        ]
    },
    {
        "id": "srrms_enrollment_new_students",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Registration and Records Management Services",
        "topic": "Enrollment for New Students and Transferees (Undergraduate, TCP, and Graduate)",
        "content": "The Student Registration and Records Management Services (SRRMS) manages the entry of new students (G2C).\n\nFor **New Students and Transferees (Undergraduate)** (Service 1.1), the process begins with the College Dean conducting the qualifying exam and interview (1 hour 30 mins). Accepted applicants proceed to the Medical Laboratory (1 hour). They submit admission credentials (Form 138/TOR, Good Moral, Birth Certificate, etc.) to the Registrar's Office (30 mins). Students may purchase an enrollment envelope at the IGP. The College Enrollment Officer assists with subject selection and scholarship tagging (10 mins). Students may choose the **Voluntary Opt-Out** for tuition. Payments are made at the Cashier (5 mins). Total processing time is 3 Hours and 15 Minutes. Fees: PHP 550.00 (Medical) + PHP 25.00 (IGP) + Tuition (if opted out).\n\nFor **New Students (TCP & Graduate School)** (Service 1.2), applicants submit admission applications, TOR, Transfer Credentials, and Marriage Certificate (if applicable). After passing the EARIST-GAT/TCP Test, they obtain an Advisement Slip from the GS/CED Office (15 mins), pay tuition at the Cashier (5 mins), and submit credentials to the Registrar for COR printing (5 mins). Total processing time is 25 Minutes. Fees: PHP 25.00 (IGP) + Tuition.",
        "keywords": [
            "Enrollment",
            "Freshmen Enrollment",
            "Transferee Enrollment",
            "Graduate School Enrollment",
            "TCP Enrollment",
            "Voluntary Opt-Out",
            "Admission Credentials"
        ]
    },
    {
        "id": "srrms_enrollment_continuing_special",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Registration and Records Management Services",
        "topic": "Enrollment for Continuing, Irregular, Shifters, and Cross-Enrollees",
        "content": "SRRMS facilitates enrollment for continuing and special student categories (G2C).\n\n**Continuing Regular Students (Online)** (Service 1.3) log in to the portal, select subjects, and wait for validation by the Enrollment Officer. The COR is auto-generated. Total time: 5 Minutes. No fees.\n\n**Continuing Irregular Students/Returnees (On-site)** (Service 1.4) apply for Academic Program Evaluation (APE) at the Registrar's Office (5 mins). Returnees present an approved LOA. Students pay APE/RFLOA fees (PHP 40.00) at the Cashier (5 mins). Evaluators assess grades (5 working days). The College assists with subject enlistment (5 mins) and ID validation (5 mins). Total time: 5 Working Days and 35 Minutes.\n\n**Shifters** (Service 1.5) obtain a Shifter's Form from the College, signed by previous and accepting Deans (5 mins). The Registrar updates the curriculum (5 mins). The College assists with enlistment (2 hours). Fees: PHP 40.00. Total time: 2 Hours and 20 Minutes.\n\n**Cross-Enrollment** (Service 1.6) requires a Letter of Intent, COR, and ID. The Registrar evaluates grades (2 mins). Students pay PHP 120.00 at the Cashier (3 mins). The Dean approves the Permit to Cross-Enroll (3 mins), which is released by the Registrar (3 mins). Total time: 14 Minutes.",
        "keywords": [
            "Online Enrollment",
            "Irregular Student",
            "Returnee",
            "Shifter",
            "Cross-Enrollment",
            "Academic Program Evaluation",
            "APE"
        ]
    },
    {
        "id": "srrms_registration_changes_loa",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Registration and Records Management Services",
        "topic": "Withdrawal, Dropping, and Leave of Absence",
        "content": "SRRMS handles changes to student registration (G2C).\n\nFor **Withdrawal/Dropping (Undergraduate)** (Service 2.1) and **Graduate** (Service 2.2), students submit a Letter of Intent and Withdrawal/Dropping Form. Withdrawal is within 2 weeks of classes; Dropping is before Midterms. Students pay PHP 80.00 at the Cashier (3 mins). The Registrar issues the form (2 mins). For Graduate students, the form must be signed by the Dean/Faculty, and refunds processed at FMS. Total time: 8-10 Minutes.\n\nFor **Leave of Absence (LOA)** (Service 3), students submit a Letter of Intent with Parent/Guardian signature to the Registrar (2 mins). They pay PHP 80.00 at the Cashier (5 mins) and submit the accomplished LOA Form and ID to the Registrar (3 mins). Total time: 7 Minutes.",
        "keywords": [
            "Withdrawal of Registration",
            "Dropping Subjects",
            "Leave of Absence",
            "LOA",
            "Refund of Fees"
        ]
    },
    {
        "id": "srrms_id_graduation_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Registration and Records Management Services",
        "topic": "Student ID and Graduation Application",
        "content": "SRRMS provides ID and graduation-related services (G2C).\n\n**School ID Issuance (First Copy)** (Service 4) is free for freshmen. The student fills out a request/Google form. SRRMS processes and prints the ID (1 hour). Total time: 1 Hour and 4 Minutes.\n\n**Re-Issuance of School ID** (Service 5) for loss/update requires an Affidavit of Loss (if applicable) and Payment of PHP 200.00. Processing and printing take 1 hour. Total time: 1 Hour and 9 Minutes.\n\n**Final Evaluation of Graduating Students** is available **Online** (Service 6, 5 mins) via Google Link, or **Face-to-Face** (Service 7, 5 mins) by submitting an Application for Evaluation. Evaluators determine if the student qualifies for the graduating list.\n\n**Application for Graduation** (Service 8) involves submitting the accomplished form (signed by Professor/Dean) and paying the Graduation Fee. SRRMS evaluates the form (5 mins). Total time: 12 Minutes.",
        "keywords": [
            "School ID",
            "ID Replacement",
            "Graduation Application",
            "Final Evaluation",
            "Graduating Students"
        ]
    },
    {
        "id": "srrms_transcript_of_records",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Registration and Records Management Services",
        "topic": "Processing of Transcript of Records (TOR)",
        "content": "SRRMS processes requests for Transcripts of Records (TOR) for various purposes (G2C).\n\n**First Request Automated (2011-Present)** (Service 9.1): Fees are PHP 100.00/page + PHP 25.00 envelope. First copies for first-time job seeker graduates are free (RA 11261). Processing time: 5 Working Days.\n\n**First Request Manual (2010 and Below)** (Service 9.2): Fees are PHP 100.00/page + PHP 25.00. Processing time: 6 Working Days.\n\n**Second Request/Recopy Automated** (Service 9.3): Fees are PHP 100.00/page + PHP 25.00. Processing time: 3 Working Days.\n\n**Second Request/Recopy Manual** (Service 9.4): Fees are PHP 100.00/page + PHP 25.00. Processing time: 5 Working Days.\n\n**TOR Copy for Another School** (Service 9.5): Requires Honorable Dismissal. Processing time: 5 Working Days.\n\nAll services involve verifying the School ID/Authorization, payment at the Cashier, and claiming the document on the scheduled date.",
        "keywords": [
            "Transcript of Records",
            "TOR",
            "First Time Job Seekers",
            "Academic Records",
            "Manual Grades",
            "Automated Grades"
        ]
    },
    {
        "id": "srrms_credentials_crediting",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Registration and Records Management Services",
        "topic": "Honorable Dismissal, Certifications, Diploma, and Crediting",
        "content": "SRRMS handles legal credentials and subject crediting (G2C).\n\n**Honorable Dismissal (HD) or Transfer Credentials** (Service 10): Requires Clearance and ID. Fees: PHP 100.00/page (TOR) + PHP 105.00 (HD, Good Moral, Envelope). Processing time: 5 Working Days and 38 Minutes.\n\n**Request for CAV, SAD Forms, ROG, etc.** (Service 11, 12): For employment/legal purposes. Fee: PHP 40.00/copy. CAV takes 4 Working Days; SAD Forms take 1 Hour and 18 Minutes.\n\n**Duplicate/Recopy of Diploma** (Service 13): Fee: PHP 40.00/copy. Processing time: 1 Hour and 18 Minutes.\n\n**Crediting of Subjects/Subject Equivalency** (Service 14): For Transferees (Crediting Form) or Shifters (Equivalency Form). Requires Original TOR and Course Description. The College Chairperson/Dean signs the form, and SRRMS credits the subjects in the system. Fee: PHP 40.00. Total time: 1 Hour and 18 Minutes.",
        "keywords": [
            "Honorable Dismissal",
            "Transfer Credentials",
            "CAV",
            "Certification Authentication Verification",
            "Diploma Recopy",
            "Subject Crediting",
            "Subject Equivalency"
        ]
    },
    {
        "id": "ecc_campus_admin_personnel_clearances",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Office of the Campus Administrator",
        "topic": "Clearances, Leaves, and Personnel Requests",
        "content": "The Office of the ECC Administrator handles administrative and personnel-related approvals for the Cavite Campus (G2C/G2G).\n\nFor the **General Clearance for Application of Student Academic Records** (Service 1), students or alumni must present a clearance form signed by the Cashier/Accounting and the Chief of OSA. The Campus Administrator signs the clearance within 5-10 minutes. No fees are required.\n\nFor the **Signing of Faculty Clearance (End of School Year)** (Service 2), faculty members must submit the Faculty Clearance Form, printed/signed grade sheets, Annual Report, Financial Report (if applicable), and updated Course Syllabi. The Administrator evaluates and signs the clearance within 15 minutes.\n\nFor the **Signing of Locator's Slip** (Service 3), faculty and non-teaching personnel fill out the slip indicating departure details. The Administrator signs and records it within 10 minutes.\n\nFor the **Application for Leave of Absence (Form 6)** (Service 4), personnel submit Form 6 for signature before submission to EARIST-Manila HRMS. The process takes 3-5 minutes.\n\nFor **Request for Faculty Development** (Service 6) such as seminars or training, the faculty submits a request letter with the invitation. The Administrator signs for recommending approval within 15 minutes.",
        "keywords": [
            "Student Clearance",
            "Faculty Clearance",
            "Locator Slip",
            "Leave of Absence",
            "Form 6",
            "Faculty Development",
            "Cavite Campus"
        ]
    },
    {
        "id": "ecc_campus_admin_activity_access",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Office of the Campus Administrator",
        "topic": "Approval of School Activities and Campus Entry",
        "content": "The Office of the ECC Administrator manages approvals for campus activities and access (G2C/G2G).\n\nFor the **Approval to Conduct School Activity/Program/Project** (Service 5), students, faculty, or personnel must submit a Request Letter with complete details and a Program of Activities. The Administrator verifies the attachments, checks if the activity is in the consolidated action plan, and signs for approval. The total processing time is 20 minutes.\n\nFor the **Approval of Request/Permit for Students to Enter the Campus and Conduct Activity Outside Regular Class Schedule** (Service 7), the client submits a Letter of Request endorsed by the faculty/personnel and a Parent's Permit/Waiver. The request must include a list of students signed by the supervising personnel. The Administrator checks the information (5 mins), verifies authenticity (10 mins), and signs for approval (2 mins). The approved letter is then submitted to the Guard on Duty. Total processing time is 12 minutes. No fees are charged for these services.",
        "keywords": [
            "School Activity Approval",
            "Campus Entry Permit",
            "Student Activity",
            "Parent's Waiver",
            "Event Approval"
        ]
    },
    {
        "id": "ecc_academic_instructional_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Academic & Instructional Services",
        "topic": "Completion of Grades and Program Interviews",
        "content": "The Academic & Instructional Services (Program Chairs) at ECC handle academic deficiencies and admissions (G2C).\n\nFor the **Approval of Completion of Grades** (Service 1), students with an \"INC\" grade must submit an Accomplished Completion Form (secured from the Registrar) and an Official Receipt for the SAD Form. The student submits the form with the new grade signed by the instructor. The Program Chair checks the form for completeness (10 mins) and signs for approval (5 mins). Total processing time is 10 minutes.\n\nFor **Program Interview and Evaluation** (Service 2), incoming freshmen and old students must present their ECAT Result, Form 138 (freshmen), or TOR (transferees). The Program Chair evaluates the credentials and conducts the interview. Total processing time is 15 minutes.",
        "keywords": [
            "Completion of Grades",
            "INC Grade",
            "Program Interview",
            "Student Evaluation",
            "Program Chair"
        ]
    },
    {
        "id": "ecc_administrative_security_cashier",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Administrative Services",
        "topic": "Security, Maintenance, and Cashier Services",
        "content": "The Administrative Services at ECC provide essential support functions (G2C/G2G).\n\n**Security Services** (Service 1) manages entry. Students present a valid School ID/COR, while Visitors present a valid ID and sign the logbook to receive a Visitor's Pass. The security check takes about 4 minutes.\n\n**Utility and Maintenance Services** (Service 2) handles repair requests. Personnel submit a Job Request Form approved by the Campus Administrator. The Admin Staff examines the request and assigns utility personnel. Total time is 5 minutes.\n\n**Payment and Other School Fees** (Service 3) is handled by the Cash and Disbursement Service. Clients present their assessment/billing and Student ID/COR. The Staff verifies the documents (5 mins) and issues an Official Receipt upon payment (5 mins). Total transaction time is 10 minutes.",
        "keywords": [
            "Security Check",
            "Visitor Pass",
            "Maintenance Request",
            "School Fees",
            "Cashier",
            "Official Receipt"
        ]
    },
    {
        "id": "ecc_registrar_admission_enrollment",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Registrar's Office",
        "topic": "Admission and Enrollment Procedure",
        "content": "The Registrar's Office at ECC manages the admission and enrollment of students (G2C).\n\nFor **Admission and Enrollment** (Service 1), the process varies by student type:\n* **New Applicants:** Apply online via EARIST Pinnacle, upload credentials (Form 138, Good Moral, Birth Certificate), and take the ECAT (2 hours). Staff processes credentials (3 days).\n* **Old Students:** Submit the Report of Grades (ROG) to the Program Chair for evaluation and issuance of the Advisement Slip (1 day).\n* **Final Step:** Submit original entrance credentials to the Registrar's Office (5-10 mins). \n\nThe total processing time is approximately 4 Days, 2 Hours, and 10 Minutes. No fees are explicitly listed for the enrollment step itself, though entrance exam fees may apply in other contexts.",
        "keywords": [
            "ECC Enrollment",
            "EARIST Pinnacle",
            "ECAT",
            "Advisement Slip",
            "Freshmen Admission"
        ]
    },
    {
        "id": "ecc_registrar_registration_adjustments",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Registrar's Office",
        "topic": "Withdrawal, Dropping, Adding, and Overload of Subjects",
        "content": "The Registrar's Office at ECC handles changes to student registration (G2C).\n\nFor **Withdrawal of Enrollment, Changing, Dropping, and Adding of Subjects** (Service 2), students avail of the specific form from the Assistant Registrar. They must secure the Program Chair's evaluation and the Academic Supervisor's approval (15 mins). After paying the fee of **PHP 20.00** at the Cashier (5 mins), they submit the accomplished form to the Registrar for processing (10 mins). Total time is 45 minutes.\n\nFor **Approval of Excess/Overload** (Service 3), graduating students requesting a maximum of 12 units overload must submit a Program Chair's Evaluation and a Letter of Request recommended by the Program Chair and Academic Supervisor. The Registrar's Staff evaluates the records and assists the student. Total time is 30 minutes.",
        "keywords": [
            "Dropping Subjects",
            "Adding Subjects",
            "Subject Overload",
            "Excess Units",
            "Registration Adjustment"
        ]
    },
    {
        "id": "ecc_registrar_records_id",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Registrar's Office",
        "topic": "Student Records Request and ID Issuance",
        "content": "The Registrar's Office at ECC provides document and ID services (G2C).\n\nFor **Request for Student Records** (Service 4) (TOR, Honorable Dismissal, Certification, etc.), students fill out an Application Form and process their Clearance with the Cashier, OSA, and Administrator (30 mins). They pay the corresponding fees (TOR: 100/page, Cert/HD: 20-40) at the Cashier (5 mins). The Registrar processes the request and schedules the release (15 mins). Total time is 1 Hour.\n\nFor **Student's Identification Card** (Service 5), students submit a Request Form, COR, and Clearance (plus Affidavit of Loss for replacements). Payment is made at the Cashier (**PHP 100.00 New / PHP 150.00 Replacement**). The Registrar records and accepts the application. Total time is 25 minutes.",
        "keywords": [
            "Transcript of Records",
            "Honorable Dismissal",
            "Student ID",
            "ID Replacement",
            "ECC Records"
        ]
    },
    {
        "id": "ecc_student_affairs_library_medical",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Support Services",
        "topic": "Student Affairs, Library, and Medical Services",
        "content": "The ECC provides various support services to students and staff (G2C/G2G).\n\n**Office of Student Affairs (OSAS):**\n* **Student Activities:** Requests require a Letter with Program Chair recommendation and CHED-compliant documents. The Chair reviews (1 day) and the Administrator approves (1 day). Total: 2 Days.\n* **Student Complaints:** Written complaints are submitted to the College Dean, who assists and investigates (3 days). Total: 3 Days.\n\n**Medical and Dental Services:**\n* **Regular Consultation:** Includes assessment and treatment/referral. Emergency cases: 30 mins; Non-emergency: 30 mins. Total: 1 Hour.\n* **Medical Certificate for OJT:** Students submit lab results (X-ray, CBC, Urinalysis, Drug Test). The MDS assesses the client and signs the medical form. Total: 2 Hours.\n\n**Library Services:**\n* **Circulation:** Students/Faculty search OPAC, sign Book Card, and exchange ID for the book. Returns involve exchanging back. Total time: ~10 minutes.\n* **Referrals/facilities:** Staff issues referral letters or reserves equipment upon request. Total time: ~10 minutes.",
        "keywords": [
            "OSAS",
            "Student Complaints",
            "Medical Consultation",
            "OJT Medical Certificate",
            "Library Circulation"
        ]
    },
    {
        "id": "ecc_property_management_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "EARIST Cavite Campus - Property Management Services",
        "topic": "Supplies and Property Inventory",
        "content": "The Property Management Services (PMS) at ECC handles logistics for Faculty and Employees (G2G).\n\nFor **Request and Issuance of Supplies** (Service 1), personnel visit the PMS office, fill out the Requisition and Issue Slip (RIS), and secure signatures from the Head of Office and Campus Administrator. The PMS releases the supplies. Total time is 20 Minutes.\n\nFor **Inventory and Signing of Faculty Clearance** (Service 2), retiring faculty or those closing the school year request a property inventory. PMS checks records (20 mins), conducts the physical inventory (3 hours), and receives the Turn-in Slip to sign the clearance (30 mins). Total time is 3 Hours and 50 Minutes.",
        "keywords": [
            "Supply Request",
            "RIS",
            "Property Inventory",
            "Faculty Clearance",
            "Property Accountability"
        ]
    },
    {
        "id": "sas_scholarship_student_activities",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Affairs and Services",
        "topic": "Scholarship Requests and Student Activity Permits",
        "content": "The Student Affairs and Services (SAS) office handles scholarship documentation and activity permits for students (G2C).\n\nFor **Scholarship** (Service 1), students request a Certificate of Recognition and Report of Grades (ROG). They submit PDF copies to the SARRMS Staff. The process takes 1 day. If documents are lost, a fee of P20.00 applies; otherwise, it is free.\n\nFor **On-Campus Student Activities** (Service 1.1), officially enrolled students or organizations submit a Request Letter, Budget Proposal, and Student Activity Proposal Form to the Institute Student Government (ISG) (5 mins). The ISG endorses it to the Leadership Division (5 mins), which reviews and forwards it to the SAS Director, VPAA, and President for approval (2 days). The student secures the approved proposal from SAS (1 minute). Total time: 2 Days and 12 Minutes.\n\nFor **Off-Campus Student Activities** (Service 1.2), proponents submit the Off-Campus Form, Notarized Parent's Consent, Medical Clearance, and Board Resolution. SAS conducts an initial evaluation (30 mins) and a detailed officer evaluation (2 days). Upon compliance with findings (1 day), SAS issues a Certificate of Compliance and requests Presidential endorsement to CHEDRO (10 mins). The documents route through the signatories to the President (3 days) and are submitted to CHEDRO (6 days). Total time: 6 Days, 1 Hour, and 52 Minutes.",
        "keywords": [
            "Scholarship",
            "Student Activity Permit",
            "On-Campus Activity",
            "Off-Campus Activity",
            "Educational Trip",
            "CHED Endorsement",
            "ISG Endorsement"
        ]
    },
    {
        "id": "sas_student_organization_accreditation",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Affairs and Services",
        "topic": "Accreditation and Renewal of Student Organizations",
        "content": "The SAS Leadership Division manages the accreditation of student organizations (G2C).\n\nFor **Newly-Founded Organizations** (Service 3), students secure the Accreditation Checklist and Forms from the ISG (5 mins). They submit the completed requirements (Constitution, By-Laws, Officer List, Financial Plan, etc.) to the ISG for initial evaluation (2 days). The ISG submits evaluated documents to SAS (10 mins). SAS evaluates (2 days) and issues findings. Upon compliance (1 day), SAS prints the Certificate of Accreditation and routes it for signature by the Director, VPAA, and President (3 days). The student receives the certificate (5 mins). Total time: 7 Days and 50 Minutes.\n\nFor **Renewal of Accreditation** (Service 3.2), the process is similar. Existing organizations submit updated requirements (Accomplishment Report, Financial Report) to the ISG (5 mins). After ISG evaluation (2 days) and SAS review (2 days), the organization complies with any deficiencies (1 day). The Renewal Certificate is routed for signature (3 days) and issued (30 mins). Total time: 7 Days and 50 Minutes.",
        "keywords": [
            "Student Organization Accreditation",
            "Org Renewal",
            "ISG",
            "Constitution and By-Laws",
            "Financial Report",
            "Accomplishment Report"
        ]
    },
    {
        "id": "sas_complaints_discipline",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Student Affairs and Services",
        "topic": "Student Complaints and Investigation",
        "content": "The SAS Student Discipline Board (SDB) handles student complaints (G2C). \n\nTo file a complaint (Service 4), the student submits a **Complaint Letter** and **Proof/Evidence** (2 copies) to the SDB Member (10 mins). The SDB notifies parties of the hearing schedule (10 mins). A hearing is conducted (1 day). The SDB submits a Resolution to the VPAA for Presidential approval (20 mins). The student secures a copy of the Resolution (10 mins). The total processing time is 1 Day, 2 Hours, and 50 Minutes.",
        "keywords": [
            "Student Complaint",
            "Discipline Board",
            "SDB",
            "Student Hearing",
            "Grievance"
        ]
    },
    {
        "id": "guidance_counseling_testing_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Guidance, Counseling, and Testing Services",
        "topic": "Psychological Testing, Needs Assessment, and Inventory",
        "content": "The Guidance Office provides testing and data profiling services for students (G2C).\n\nFor **Administering of ECAT** (Service 1.1), the student presents the Examination Permit. The staff administers the test (1 hour 30 mins). Results are scanned, summarized, and posted/forwarded to Deans (5 days). Total time: 5 Days, 1 Hour, and 45 Minutes.\n\nFor **Psychological Test** (Service 1.2), the student fills out a Consent Form. The Chief secures a schedule letter (1 day). The test is administered, scored, and interpreted (2 hours). The student receives a call slip to discuss results (1 day). Total time: 1 Day and 2 Hours.\n\nFor **Needs Assessment Inventory** (Service 1.3), the process involves scheduling (1 day), administering the inventory (1 hour), scoring/interpreting (3 days), and discussing results (1 day). Total time: 5 Days and 1 Hour.\n\nFor **Individual Inventory Service** (Service 2), students fill out the Personal Inventory Form. The staff distributes the form (1 day), administers it (1 hour), profiles the data (1 day), and encodes it (1 day). Total time: 3 Days and 1 Hour.",
        "keywords": [
            "ECAT",
            "Psychological Test",
            "Needs Assessment",
            "Individual Inventory",
            "Student Profiling"
        ]
    },
    {
        "id": "guidance_counseling_interventions",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Guidance, Counseling, and Testing Services",
        "topic": "Counseling, Exit Interviews, and Referrals",
        "content": "The Guidance Office offers various counseling interventions (G2C).\n\n**Walk-in Counseling** (Service 3.1): Students sign the log sheet and undergo an interview/counseling session. Total time: 1 Hour.\n\n**Guidance-Initiated Counseling** (Service 3.2): Students receive a call slip, undergo counseling, and sign the log. Total time: 1 Hour.\n\n**Exit Interview/Career Counseling** (Service 3.3): Students accomplish the Exit Interview Form and receive counseling. Total time: 1 Hour and 10 Minutes.\n\n**Referral Service** (Service 4): Students present a Referral Form from faculty/admin and undergo counseling. Total time: 1 Hour.\n\n**Information Service** (Service 5): Involves conducting seminars. The Chief secures a schedule (1 day). Students attend the seminar (3 hours) and evaluate it. Total time: 1 Day and 3 Hours.\n\n**Follow-up Service** (Service 6): Students receive a call slip (1 hour) and undergo a follow-up interview (1 hour). Total time: 2 Hours.\n\n**Good Moral Certificate** (Service 7.1): Students present the form issued by the Registrar. The Counselor signs it. Total time: 15 Minutes.",
        "keywords": [
            "Counseling",
            "Walk-in Counseling",
            "Exit Interview",
            "Career Counseling",
            "Referral Service",
            "Good Moral"
        ]
    },
    {
        "id": "admin_finance_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Vice President for Administration and Finance (VPAF)",
        "topic": "Signing of BUR and Endorsing Documents",
        "content": "The Office of the Vice President for Administration and Finance (VPAF) and Administrative Services handles financial and documentary approvals (G2G).\n\nFor the **Signing of Budget Utilization Request (BUR)** (Administrative Services - Service 1), internal clients must submit the BUR form along with supporting documents (e.g., OR of Performance Bond, Notice of Award, BAC Resolution for Fund 164; or Obligation Request, Disbursement Voucher for Fund 101). The Officer In Charge accepts, verifies, and signs the BUR. The process takes 6 minutes.\n\nFor **Endorsing Documents to the President** (VPAF - Service 1), Institute personnel submit requests such as Clearances, IPCR, Travel Endorsements, or Activity Permits. The VPAF assesses and recommends them for approval. The total processing time is 1 Day.",
        "keywords": [
            "Budget Utilization Request",
            "BUR",
            "Document Endorsement",
            "VPAF Approval",
            "Fund 101",
            "Fund 164"
        ]
    },
    {
        "id": "hrms_hiring_faculty",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Human Resource Management Services",
        "topic": "Hiring of Temporary/Permanent Faculty Member",
        "content": "The Human Resource Management Services (HRMS) manages the highly technical process of hiring Faculty (G2C/G2G). \n\nApplicants must submit an Application Letter, PDS/Resume, Original TOR, Certificates (Units Earned, Eligibility, Training, Employment), Performance Rating (IPCR), Birth/Marriage Certificate, NBI Clearance, Medical Results, and other HR forms. \n\nThe process begins with the Dean submitting a request (2 mins) and HR publishing the vacancy (1 hour). HR receives applications (10 days), screens documents (3 days), and the Faculty Selection Board evaluates them (1 day). Applicants are notified (2 hours) and undergo Teaching Demonstration and Interview (2-5 hours). Shortlisted candidates take a pre-employment exam (4 hours). HR prepares the ranking (2-4 days) and conducts a background check (30 mins). The Recommendation Letter is routed for approval (2 hours). The hired applicant submits requirements (20 mins), and HR conducts onboarding (20 mins). Total processing time is 18 Days, 15 Hours, and 12 Minutes.",
        "keywords": [
            "Faculty Hiring",
            "Teaching Demonstration",
            "Faculty Selection Board",
            "Pre-employment Exam",
            "Job Vacancy"
        ]
    },
    {
        "id": "hrms_hiring_non_teaching_job_order",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Human Resource Management Services",
        "topic": "Hiring of Permanent Non-Teaching and Job Order Personnel",
        "content": "HRMS handles the recruitment of Non-Teaching staff (Permanent and Job Order).\n\nFor **Hiring Permanent Non-Teaching Personnel** (Service 4), the process involves publishing the vacancy (1 hour), receiving applications (10-14 days), screening (2 days), conducting interviews/exams (2-5 hours), and psychological tests (3 hours). The Personnel Selection Board (PSB) interviews candidates. Ranking and background checks follow. Total processing time is 16 Days, 16 Hours, and 59 Minutes.\n\nFor **Hiring Job Order Personnel** (Service 3), the Director/Chief waits for the posting (1 hour). HR screens applicants (3 hours) and notifies them of the interview/exam schedule (30-45 mins). The Chief of HRMS conducts the interview. HR prepares the Job Order contract and coordinates biometrics/onboarding. Total processing time is 8 Hours and 23 Minutes.",
        "keywords": [
            "Non-Teaching Hiring",
            "Job Order Hiring",
            "Personnel Selection Board",
            "PSB",
            "Civil Service",
            "Job Order Contract"
        ]
    },
    {
        "id": "hrms_personnel_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Human Resource Management Services",
        "topic": "Personnel Documents, Loans, Travel, and Leave",
        "content": "HRMS provides various services for existing employees (G2G).\n\n**Request for Personnel-Related Documents** (Service 1) and **Service Records** (Service 9): Employees submit a Request Letter/Slip. HR verifies and prepares the document. Processing time is 3 Days and 9 Minutes.\n\n**Request for Certificate of Employment** (Service 8): Requires clearance check. Processing time is 3 Days and 13 Minutes.\n\n**Request for Travel Authority** (Service 5): Employees submit an Approved Request, Substitute Letter, Itinerary, and Ticket. HR prepares the Authority. Total time is 10 Days and 5 Minutes.\n\n**Request for Landbank Salary Loan** (Service 6): Employees submit the ESL Form, Insurance Form, ID, Pay Slips, and a Flash Drive. HR encodes data, prints the transmittal, and submits to the Cashier. Total time is 2 Days and 33 Minutes.\n\n**Application for Leave** (Service 7): Employees submit Form 6 (Vacation/Sick Leave) signed by the supervisor. HR records it. Total time is 10 Minutes.",
        "keywords": [
            "Service Record",
            "Certificate of Employment",
            "Travel Authority",
            "Salary Loan",
            "Leave Application",
            "Landbank Loan"
        ]
    },
    {
        "id": "admission_services_process",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Admission Services",
        "topic": "Student Admission Process",
        "content": "The Admission Services manages the intake of students (G2C).\n\nTo avail of **Admission** (Service 4), students must submit Form 138 (Report Card), Good Moral Character, Birth Certificate, Transfer Credentials (if applicable), Grades, and Personal Data Form. \n\nThe Staff determines available slots (5 mins) and issues the **ECAT Form** (15 mins) and Examination Permit (5 mins). On examination day, the student takes the ECAT (2 hours). Results are released after 2 days. Qualified students undergo a Personal Interview with College Deans (30 mins) and a Physical Examination (1 hour). Total processing time is 2 Days and 4 Hours.",
        "keywords": [
            "Student Admission",
            "ECAT",
            "Entrance Exam",
            "College Interview",
            "Physical Exam"
        ]
    },
    {
        "id": "instruction_services_faculty_evaluation",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Instruction Services",
        "topic": "Faculty Evaluation (NBC 461/Reclassification)",
        "content": "The Instruction Services Office manages the **Faculty Evaluation** (Service 1) under DBM-CHED Joint Circular No. 03, s. 2022. This is a Highly Technical G2G transaction for Regular Faculty.\n\nThe faculty submits documents and the Individual Summary Sheet (ISS) to the **College Evaluation Committee (CEC)** (15 mins). The CEC checks for veracity (10 days) and schedules a meeting to discuss deficiencies (5 days). The Faculty complies with additional requirements (15 days) and finalizes the ISS (5 days). \n\nThe folder is submitted to the **Institutional Evaluation Committee (IEC)** (15 mins), which reviews it (15 days) and discusses deficiencies (5 days). The Faculty finalizes and scans documents (5 days). The IEC signs the ISS (3 days) and submits the folder to the Regional Evaluation Committee (REC) or Accreditation Committee (EAC) (2 days). Total processing time is 65 Days and 30 Minutes.",
        "keywords": [
            "Faculty Evaluation",
            "NBC 461",
            "Faculty Reclassification",
            "CEC",
            "IEC",
            "Individual Summary Sheet",
            "ISS"
        ]
    },
    {
        "id": "pms_requisition_issuance_supplies",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Property Management Services",
        "topic": "Requisition and Issuance of Supplies (Available and Not Available)",
        "content": "The Property Management Services (PMS) handles supply requests for Internal Clients (G2G).\n\nFor **Requisition and Issuance of Supplies** (Service 1) based on the Annual Procurement Plan (APP), the client prepares 4 copies of the Requisition and Issue Slip (RIS), secures the Head of Office's signature, and submits it to PMS. The PMS Staff issues the supplies, and the client signs for acceptance. Total time: 20 Minutes.\n\nFor **Requisition of Supplies Not Available at PMS** (Service 2), the client submits 2 copies of the Supplies Availability Inquiry (SAI) Form. PMS verifies availability against the Stock Card (5 mins). If unavailable or available, the SAI is signed and recorded in the logbook (10 mins). The client acknowledges receipt (5 mins). Total time: 25 Minutes.\n\nFor **Requisition of Supplies Available at PMS** (Service 3), the client submits the verified SAI signed by the Head of Office (5 mins). PMS prepares the Advance Issuance of Supplies Form (10 mins). The client acknowledges receipt of items (5 mins). PMS releases the items (5 mins). Total time: 25 Minutes. No fees are charged for these services.",
        "keywords": [
            "Supply Requisition",
            "RIS",
            "Requisition and Issue Slip",
            "SAI",
            "Supplies Availability Inquiry",
            "Stock Card"
        ]
    },
    {
        "id": "pms_property_accountability_transfer",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Property Management Services",
        "topic": "Returning and Transferring of Property/Accountability",
        "content": "PMS manages the accountability of property and equipment for Internal Clients (G2G).\n\nFor **Returning of Property/Accountability** (Service 4), employees inform PMS and submit a copy of the Property Acknowledgement Receipt (PAR) or Inventory Custodian Slip (ICS) with pictures (5 mins). The client surrenders the item (5 mins). PMS prepares the Property Turned-In Slip (PTIS) (5 mins), which the client signs (5 mins). PMS secures the returned item in the stockroom (5 mins). Total time: 25 Minutes.\n\nFor **Transfer of Property/Accountability** (Service 5), the process is similar. The employee submits the PAR/ICS and pictures (10 mins). PMS prepares the Property Transfer Report (PTR) (5 mins). The client signs the PTR (5 mins), and PMS releases the transferred property to the new user (5 mins). Total time: 25 Minutes. No fees apply.",
        "keywords": [
            "Property Return",
            "Property Transfer",
            "PAR",
            "Property Acknowledgement Receipt",
            "ICS",
            "Inventory Custodian Slip",
            "PTIS",
            "PTR"
        ]
    },
    {
        "id": "pms_receipt_inspection_goods",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Property Management Services",
        "topic": "Receipt, Inspection, Acceptance, and Recording of Procured Goods",
        "content": "This service involves the acceptance of delivered goods from External Suppliers (G2B). Requirements include the Approved PO, Delivery Receipt (DR), and Sales Invoice (SI).\n\nThe supplier notifies PMS of the delivery schedule (5 mins). PMS inspects items against the PO/DR/SI for quantity and specifications (5-10 mins). If compliant, the Inspection and Acceptance Report (IAR) is signed. The Report on Satisfactory/Dissatisfactory Delivery Compliance (RSDDC) is prepared and signed by the End-User (5 mins). PMS records items in Stock Cards (5 mins) and stores them pending issuance (5 mins). Total processing time is 30 Minutes.",
        "keywords": [
            "Goods Inspection",
            "Delivery Acceptance",
            "IAR",
            "Inspection and Acceptance Report",
            "RSDDC",
            "Stock Card Recording"
        ]
    },
    {
        "id": "procurement_services_documents_noa_ntp",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Procurement Services",
        "topic": "Issuance of NOA, Contract, PO, and NTP",
        "content": "The Procurement Services (PS) manages the issuance of award documents for Civil Works, Consultancy, and Goods (G2B).\n\n**Release of Notice of Award (NOA)** (Service 1.1): The External Client registers in the logbook (3 mins) and receives the approved NOA (3 mins). Total time: 6 Minutes.\n\n**Acceptance of Performance Security Bond** (Service 1.2): The Client submits the Performance Security Bond (3 mins). The Chief PS reviews it and releases the Contract for signature/notarization (10 mins). Total time: 13 Minutes.\n\n**Issuance of Notarized Contract/PO** (Service 1.3): The Client registers (3 mins). PS releases the Notarized Contract (Civil Works) or Purchase Order (Goods) for signature (20 mins). The Client acknowledges receipt (13 mins). Total time: 36 Minutes.\n\n**Issuance of Notice to Proceed (NTP)** (Service 1.4): The Client registers (3 mins). The Chief PS assists in signing/discussing the NTP (10 mins). PS releases the original NTP (5 mins). Total time: 18 Minutes.",
        "keywords": [
            "Notice of Award",
            "NOA",
            "Notice to Proceed",
            "NTP",
            "Performance Security Bond",
            "Contract Issuance",
            "Purchase Order"
        ]
    },
    {
        "id": "procurement_services_goods_bidding",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Procurement Services",
        "topic": "Procurement of Goods (1 Million and Above) - Public Bidding",
        "content": "This Highly Technical G2G service handles large-scale procurement for Internal Clients.\n\nThe process begins with submitting the **Approved Funded Purchase Request (APR)**. PS receives and pre-numbers the APR (5 mins). Staff reviews documents (Terms of Reference, SOW, BOQ) (5 mins) and prepares the Invitation to Bid (ITB) (5 mins). The End User signs the PO (15 days posting period). Bids are received and submitted to the BAC (2 hours). The BAC prepares the Abstract of Bids and Resolution (3 days). PS prepares the Purchase Order based on the winning bid (10 mins), reviews it (5 mins), and the End User signs it (5 mins). Total processing time is 18 Days and 2 Hours.",
        "keywords": [
            "Public Bidding",
            "Goods Procurement",
            "Invitation to Bid",
            "ITB",
            "BAC Resolution",
            "Abstract of Bids"
        ]
    },
    {
        "id": "procurement_services_alternate_mode",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Procurement Services",
        "topic": "Procurement of Goods (Below 1 Million) - Alternate Mode",
        "content": "This service handles smaller procurements via Alternate Mode (G2G/G2B).\n\n**Internal Process (G2G)** (Service 3): Submitting the APR (3 mins), pre-numbering (2 mins), reviewing documents (15 mins), and preparing the Request for Quotation (RFQ) (10 mins). The RFQ is posted on PhilGEPS (7 days). Bids are received (1 day), and the Abstract of Bids/BAC Resolution is prepared (5 days). The PO is prepared (45 mins), reviewed (15 mins), and signed by the End User (15 mins). Total time: 14 Days and 45 Minutes.\n\n**External Process (G2B)** (Service 4): External bidders receive the Blank RFQ (10 mins). They submit the Quoted RFQ and Mandatory Requirements. PS reviews the submission and serves the signed PO (40 mins). Total time: 50 Minutes.",
        "keywords": [
            "Alternate Mode Procurement",
            "Small Value Procurement",
            "RFQ",
            "Request for Quotation",
            "PhilGEPS",
            "Purchase Order"
        ]
    },
    {
        "id": "security_services_entrance",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Security Services",
        "topic": "Gain Entrance to EARIST Campus",
        "content": "The Security Services manages the entry of Students and Visitors to the EARIST Campus (G2C). \n\nTo **Gain Entrance to the Campus** (Service 1), students must present their Student ID or Certificate of Registration (COR). Visitors must present a valid Government or Legal Entity ID. \n\nFor Students, the Security Guard on Duty checks the uniform, identity, and ID validity (5-10 seconds). For Visitors, the guard asks for the purpose, checks identity, and requires signing the Visitor's Logbook (3-5 minutes) before issuing a Visitor's Pass. The total processing time is approximately 5 minutes and 10 seconds. No fees are charged for entry.",
        "keywords": [
            "Campus Entry",
            "Security Check",
            "Visitor Pass",
            "Student ID Check",
            "Gate Entrance"
        ]
    },
    {
        "id": "rms_document_requests",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Records Management Service",
        "topic": "Online and Physical Request for Documents",
        "content": "The Records Management Service (RMS) handles requests for official documents (Memoranda, Special Orders, etc.) for Internal and External Clients (G2C/G2G).\n\nFor **Online Request of Documents** (Service 1), internal clients access the RMS Facebook/Messenger or email record@earist.edu.ph. If requesting for another person, a clearance from the Data Protection Officer (DPO) is required. The Staff acknowledges receipt (15 mins), the Chief approves (included in time), and the Staff locates/retrieves the document (1 hour). The soft copy is sent to the client. Total time: 1 Hour and 15 Minutes.\n\nFor **Request for a Copy of Documents on File** (Service 2), clients fill up Form No. 1 (Request for Document Form). If for another person, DPO clearance is attached. If confidential, President's approval is needed. The Staff issues the form (10 mins), the Chief approves (5 mins), and the Staff locates the files (3 days for Simple, 5 days for Complex). The client is notified of the result (5 mins). Total time: 3 Days and 20 Minutes (Simple) or 5 Days and 20 Minutes (Complex). No fees are charged.",
        "keywords": [
            "Document Request",
            "Online Document Request",
            "Records Management",
            "Data Protection Clearance",
            "Confidential Documents"
        ]
    },
    {
        "id": "rms_correspondence_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Records Management Service",
        "topic": "Incoming and Outgoing Correspondence/Mail",
        "content": "RMS manages the flow of official communication (G2C/G2G).\n\n**Incoming Correspondence (Internal/Issuances)** (Service 3.1): Staff receives and records items in the incoming logbook (1 hour), reproduces copies (1 hour), and records in the outgoing logbook (1 hour). Documents are delivered to concerned offices. Total time: 3 Hours.\n\n**Incoming Correspondence (Courier)** (Service 3.2): Staff receives the package, stamps date/time (5 mins), records in the logbook (30 mins), and records in the outgoing logbook (1 hour 30 mins). Items are delivered to recipients (included). Total time: 2 Hours and 10 Minutes.\n\n**Outgoing Correspondence** (Service 3.3): Clients accomplish the Mailing/Posting Request Form and provide the recipient's address. Staff issues the form (5 mins) and checks availability of funds with FMS (5 mins). Staff checks pages, prepares the envelope and Registry Return Receipt Card (5 mins), and records in the outgoing logbook (5 mins). Mailing/posting takes up to 4 hours for bulk requests. Postage fees vary by courier. Total time: 4 Hours and 25 Minutes.",
        "keywords": [
            "Incoming Mail",
            "Outgoing Mail",
            "Correspondence Tracking",
            "Courier Service",
            "Mailing Request"
        ]
    },
    {
        "id": "rms_authentication_documents",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Records Management Service",
        "topic": "Authentication of Documents",
        "content": "RMS validates the accuracy of documents for Internal/External Clients (G2G).\n\nFor **Authentication of Documents** (Service 4), clients must submit the Original Document, an Extra Photocopy for RMS file, and the Document Authentication Request Form. \n\nThe process starts with the Staff issuing and checking the request form (10 mins). The Staff validates the submitted documents against the original (10 mins). The Certificate of Authenticity is stamped (Certified True Copy for originals, Certified Photo Copy if original is presented) (30 mins). The Chief/Staff signs the documents (30 mins). The transaction is recorded in the Outgoing Logbook (10 mins), and documents are released (5 mins). \n\nTotal processing time is 1 Hour and 35 Minutes (for 1-100 pages). No fees are charged.",
        "keywords": [
            "Document Authentication",
            "Certified True Copy",
            "CTC",
            "Certified Photo Copy",
            "Document Verification"
        ]
    },
    {
        "id": "fms_payroll_honoraria_processing",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Financial Management Services",
        "topic": "Payroll and Honorarium Processing",
        "content": "The Financial Management Services (FMS) manages the salary and honorarium processing for EARIST personnel (G2G).\n\nFor **Processing of Payroll (National/City Paid)** (Service 1), the Human Resources Management Services (HRMS) submits the Abstract of Absences and Billings. The FMS Staff receives the documents (1 day), prepares the payroll/ORS/BURS/DV/JEV, and signs them. The Budget Staff obligates funds. The payroll is reviewed and signed by the Chief of Budget, Chief Accountant, and FMS Director. Finally, the LDDAP-ADA and other documents are released to the Admin Office. The total processing time is **1 Day and 4 Hours**.\n\nFor **Processing of Teaching Honorarium Payroll** (Service 2), Faculty members submit signed DTRs/Form 48, Accomplishment Reports, Honorarium Budget, Designation, and Grade Encoding Certification. The FMS Staff receives and reviews documents (1 day), computes hours, prepares the payroll, and checks tax computations. The payroll is obligated, and BURS/DV/JEV are prepared. After reviews by the In-charge of Fund 05, Chief Accountant, and FMS Director (1 day), the documents are released to the Administrative Services. The total processing time is **2 Days**.",
        "keywords": [
            "Payroll Processing",
            "Honorarium Processing",
            "Teaching Honorarium",
            "Abstract of Absences",
            "DTR",
            "LDDAP-ADA"
        ]
    },
    {
        "id": "fms_payments_suppliers_training",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Financial Management Services",
        "topic": "Payments to Suppliers/Contractors and Training Funding",
        "content": "FMS handles payments for external obligations and staff development (G2G/G2B).\n\nFor **Processing of Payments to Suppliers/Contractors** (Service 3), the End-user submits the Approved Request, APP/PPMP, PO/Contract, IAR, and other bidding documents. The FMS Staff logs and reviews documents (1 hour). The Budget Staff certifies fund availability. The Procurement Service submits the PO for obligation (1 day). The End-user signs the ORS/BURS (4 hours). Property Management submits documents for DV/JEV preparation (1 day). After final reviews by the Chief Accountant and FMS Director, documents are released for payment (check or LDDAP-ADA). Total processing time is **2 Days and 5 Hours**.\n\nFor **Request Funding for Training/Seminars** (Service 4), employees submit an Approved Request, Invitation, CHED/Dean Endorsement, and Itinerary. The FMS Director approves funding (1 hour). The President issues a Special Order. FMS prepares the DV and Obligation Request (1 hour). Total processing time is **2 Hours and 5 Minutes**.",
        "keywords": [
            "Supplier Payment",
            "Contractor Payment",
            "Training Funding",
            "Seminar Funding",
            "Obligation Request",
            "Disbursement Voucher"
        ]
    },
    {
        "id": "fms_student_financial_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Financial Management Services",
        "topic": "TES, Tuition Refund, Student Clearance, and SOA",
        "content": "FMS provides financial services directly to students (G2C).\n\n**Processing of Financial Assistance to TES Grantees** (Service 5): The SAS submits the Approved Request and CHED Grantee List. FMS reviews documents, prints SOAs, and prepares the payroll (1 day). Documents are routed for signatures (1 day). Total time: **2 Days**.\n\n**Payment of Refund of Tuition** (Service 6): Students submit a Request Letter, COR, Official Receipt, and Scholarship Certificate. FMS verifies documents (4 hours), evaluates them (5 mins), prepares the payroll/DV (2 hours), and secures signatures from officials (1 day). Checks/LDDAP are prepared and signed (20 mins). Total time: **2 Days, 6 Hours, and 30 Minutes**.\n\n**Application for Student Clearance** (Service 7): Students present the Clearance Form. FMS checks the account and signs the form. Total time: **2 Minutes**.\n\n**Issuance of Statement of Account (SOA)** (Service 8): Students submit a request. FMS checks the account, prints, and signs the SOA. Total time: **2 Minutes**.",
        "keywords": [
            "TES Financial Assistance",
            "Tuition Refund",
            "Student Clearance",
            "Statement of Account",
            "SOA",
            "Scholarship Refund"
        ]
    },
    {
        "id": "mds_medical_consultation_certificates",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Medical and Dental Services",
        "topic": "Consultation, Medical Certificates (OJT, Fit to Work/Play), and Permits",
        "content": "The Medical and Dental Services (MDS) provides health care to the EARIST community (G2C/G2G).\n\n**Regular Consultation and Check-up** (Service 1): Patients visit the clinic for assessment. Emergency cases are treated/referred (35 mins). Non-emergency cases are managed/prescribed (1 hour).\n\n**Issuance of Medical Certificate to OJT Students** (Service 2): Students submit Chest X-ray, CBC, Urinalysis, and Drug Test results. The staff assesses the patient and signs the Fit for OJT certificate. Total time: **1 Hour**.\n\n**Issuance of Return/Fit to Work Certificate** (Service 3): Employees submit a Medical Certificate, Lab Results, and Abstract. The Physician assesses fitness and signs the form. Total time: **2 Hours**.\n\n**Issuance of Permit to Teach** (Service 4): Faculty submit lab results/medical certificates. The Officer assesses and signs the permit. Total time: **1 Hour**.\n\n**Issuance of Fit to Play (Athletes)** (Service 5): Athletes submit Medical History and PE Form. The Officer issues the form. Total time: **1 Hour**.\n\n**Issuance of Excuse Slip** (Service 6): Students present an Excuse Letter. The Officer issues the slip. Total time: **1 Hour and 10 Minutes**.",
        "keywords": [
            "Medical Consultation",
            "OJT Medical Certificate",
            "Fit to Work",
            "Permit to Teach",
            "Fit to Play",
            "Excuse Slip"
        ]
    },
    {
        "id": "mds_pre_enrollment_ape_dental",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Medical and Dental Services",
        "topic": "Pre-Enrollment, Annual Physical Exam, and Dental Services",
        "content": "MDS manages large-scale health assessments (G2C/G2G).\n\n**Pre-Enrollment for First-Year Students** (Service 7): Incoming students submit a Chest X-Ray. The Officer assesses health and issues the **Fit to Enroll Form**. Total time: **1 Hour**.\n\n**Annual Physical Examination (APE)** (Service 8): Employees undergo lab workups (X-ray, Blood Chem, Urinalysis, etc.) coordinated with a service provider (2 hours). The Officer releases results and signs the clearance (1 hour). Total time: **4 Hours and 40 Minutes**.\n\n**Dental Check-up and Tooth Extraction** (Service 9): Clients fill out forms (30 mins). The Dentist performs the treatment/extraction (2 hours). Total time: **2 Hours and 40 Minutes**.",
        "keywords": [
            "Pre-Enrollment Medical",
            "Fit to Enroll",
            "Annual Physical Exam",
            "APE",
            "Dental Check-up",
            "Tooth Extraction"
        ]
    },
    {
        "id": "ppgs_tms_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Physical Plant & General Services / Transportation Services",
        "topic": "Repair Requests and Vehicle Utilization",
        "content": "These offices manage facility maintenance and transport (G2G).\n\n**Request for Job Order Repair and Maintenance** (PPGS Service 1 & 2): Internal clients submit an Approved Letter Request and a copy of the damaged property. The Staff receives the request (5 mins). The Chief assigns personnel (5 mins). For repairs, the Chief schedules the job (10 mins), identifies the problem (10 mins), assembles the team (10 mins), and executes the work (time varies). The Job Order is signed upon completion (5 mins). Total time: **25-45 Minutes + Execution Time**.\n\n**Utilization of Vehicle** (TMS Service 1): Clients submit an Approved Letter Request. The Staff receives it (2 mins). The Trip Ticket is issued/signed (2 mins). The request is forwarded (5 mins), and a Driver/Vehicle is assigned (10 mins). Total time: **19 Minutes**.",
        "keywords": [
            "Job Order Request",
            "Repair and Maintenance",
            "Vehicle Request",
            "Trip Ticket",
            "Motorpool"
        ]
    },
    {
        "id": "cash_disbursement_services",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Cash and Disbursement Services",
        "topic": "Fee Collection and Check Disbursement",
        "content": "The Cashier's Office handles all monetary transactions (G2C/G2G/G2B).\n\n**Collection of Fees** (Services 1, 2, 3): For Enrollment, Rental, or Documents (TOR, Certification), clients present the Advisement Slip/Order of Payment/SAD Form. The Teller verifies the document (2 mins) and accepts payment/issues Official Receipt (3 mins). Total time: **5-10 Minutes**.\n\n**Online Payment (Landbank Link.BizPortal)** (Service 4): Clients select EARIST on the portal, enter details (Student No., Amount), and pay. Confirmation is emailed to the Registrar/FMS. FMS verifies (5 mins) and issues the OR (2 mins). Total time: **3 Working Days** (for bank processing) + **8 Minutes**.\n\n**Disbursement of Checks** (Service 6): Suppliers/Payees present ID and Authorization. The Staff verifies (2 mins), prepares the OR (10 mins), and releases the check (5 mins). Total time: **17 Minutes**.",
        "keywords": [
            "Tuition Payment",
            "Fee Collection",
            "Online Payment",
            "Link.BizPortal",
            "Check Disbursement",
            "Official Receipt"
        ]
    },
    {
        "id": "feedback_complaints_mechanism",
        "source": "EARIST Citizen's Charter 2025 (1st Edition)",
        "category": "Feedback and Complaints",
        "topic": "Feedback and Complaints Mechanism",
        "content": "The EARIST ARTA Secretariat manages client feedback and complaints.\n\n**Feedback**: Clients fill out the feedback form and drop it in the box. The Secretariat records it. Feedback requiring answers are forwarded to relevant offices (3 days response time). The answer is relayed to the client.\n\n**Complaints**: Clients file a complaint via the drop box, email (admin_arta@earist.ph.education), or phone (02-8243-9460 Loc 103). Required info: Name of Person Complained, Incident, Evidence. The Secretariat opens the box weekly. The Administrative Officer investigates and submits a report to the Head of Agency. Feedback is given to the client.\n\n**Contact Info**: ARTA (complaints@arta.gov.ph), PCC (8888), CCB (0908-881-6565).",
        "keywords": [
            "Client Feedback",
            "Complaint Filing",
            "ARTA",
            "Anti-Red Tape",
            "PCC 8888"
        ]
    }
]