[
  {
    "id": "sarms_overview_mission_governance",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - General Information & Governance",
    "topic": "Mission, Vision, Objectives, and Organizational Structure of SARMS",
    "content": "According to the Proposed Office of the Registrar Manual, the Student Admission, Promotions, & Records Management Services (SARMS), also known as the Office of the Registrar, serves as the repository of all student records and the main frontline service of the Institute regarding curricular and academic matters. It handles admissions, registration, evaluation, accreditation, graduation, and records management.\n\nThe SARMS Mission is to provide academic and administrative support to instruction to enable the Institute to attain its educational mandate. The Vision is for SARMS to be completely automated and able to provide online services to clientele. The service Dictum emphasizes being service-oriented, effective, efficient, clientele-friendly, honest, trustworthy, and possessing integrity.\n\nThe core Objectives of the office include selective admission, selective retention of students, efficient and effective management of student records, and providing total quality service. The General Functions encompass Student Admission, Registration, Promotions/Evaluation of Student Records, Records Management, Curricular Information Dissemination, and Graduation.\n\n regarding Governance, the Office of the Registrar is under the direct supervision of the President in coordination with the Vice-President for Academic Affairs and the Vice-President for Administration & Finance. The College Registrar (Registrar IV) serves as the Head of the Office and is designated as the Director of Admissions, Registrations, Promotions & Records Management Service. The organizational structure includes academic and non-academic personnel such as Registrar III, Registrar I, Instructors, Clerks, and Utility Workers. The College Registrar/Director is a member of both the Academic Council and the Administrative Council and may be appointed by the President to act as Secretary of the Academic Council.",
    "keywords": [
      "SARMS",
      "Office of the Registrar",
      "Mission and Vision",
      "Governance",
      "College Registrar",
      "organizational structure",
      "academic records"
    ]
  },
  {
    "id": "sarms_college_registrar_duties",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Personnel Responsibilities",
    "topic": "Functions and Responsibilities of the College Registrar",
    "content": "The Proposed Office of the Registrar Manual outlines the comprehensive functions and responsibilities of the College Registrar. The College Registrar assists top administration in the formulation and enforcement of policies on admissions, enrollment, accreditation, graduation, and related academic matters.\n\nThe Registrar plans, supervises, and holds responsibility for the admission and selective retention of students, compliance with academic requirements, and the registration or enrollment of students. This role involves the enforcement of government regulations on scholarships, delinquency, transferees, accreditation, student loading, subject-sequence, cross-enrollment, and graduation with honors. The Registrar evaluates scholastic records for accreditation of transfer units and determines curricular levels and scholastic standing.\n\nAdministrative duties include managing commencement exercises, selecting honor students, and ensuring the custody, security, integrity, and confidentiality of student records. The Registrar oversees the management, accounting, control, maintenance, and issuance of academic records. The role requires disseminating information on curricular offerings and CHED issuances, orienting students on academic policies, and preparing memoranda and statistical data on enrollment and graduates.\n\nFurthermore, the College Registrar signs Transcripts of Records, resolves questions on academic regulations, performs curricular consultations, and assists in revising the EARIST Code, Faculty Manual, and Student Handbook. Operational responsibilities include setting standard operating procedures, designing process flow charts, designing forms, maintaining property and equipment, maintaining records of production income, and requesting supplies. The Registrar submits Annual Accomplishment Reports to the President, creates development plans for SARMS, serves as the Institute's contact person with CHED and the Bureau of Immigration, and evaluates the performance of SARMS personnel.",
    "keywords": [
      "College Registrar",
      "job description",
      "academic policies",
      "graduation requirements",
      "CHED liaison",
      "records custody",
      "transcript signing"
    ]
  },
  {
    "id": "sarms_admissions_and_college_records_staff",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Personnel Responsibilities",
    "topic": "Roles of Admissions and College Records Personnel",
    "content": "The Proposed Office of the Registrar Manual details the specific duties of the In-charge of Admissions and the In-charge of Records/Evaluation (College).\n\nThe In-charge of Admissions is responsible for preparing admission and enrollment paraphernalia and coordinating the admission and enrollment of new students. This role involves reviewing, checking, and verifying the authenticity of submitted credentials. The In-charge requests Form 137A and the Official Transcript of Records (OTR) for newly admitted students, arranges and files these credentials before turning them over to the records section, prepares the freshmen enrollment list, and prepares statistics on transferees. Additionally, this personnel serves as the liaison officer of SARMS for foreign students.\n\nThe In-charge of Records/Evaluation (College) focuses on the ongoing management of student academic progress. Responsibilities include preparing individual student records such as worksheets of consolidated grades and permanent records. This staff member coordinates student enrollment, posts grades, updates records regularly, and reconstructs lost or missing files. They advise students on curricular programs, subject loads, and sequences, and evaluate records regarding curricular level, scholastic standing, and graduation eligibility. The role also entails evaluating subjects earned in other schools, assisting in the enforcement of academic policies, serving as a specialist for their assigned course, informing students of deficiencies, and assisting in graduation activities. They prepare enrollment lists, lists of academic scholars and candidates for graduation, and statistical data for drop-outs, shifters, and transferees. They check and sign prepared Transcripts of Records and certifications, and make follow-up requests for records from previous institutions.",
    "keywords": [
      "Admissions Officer",
      "Records Evaluator",
      "student credentials",
      "enrollment coordination",
      "foreign students",
      "grade encoding",
      "transfer evaluation"
    ]
  },
  {
    "id": "sarms_support_staff_secondary_request_processing",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Personnel Responsibilities",
    "topic": "Roles of Secondary Records, Request Processing, and Data Processing Staff",
    "content": "The Proposed Office of the Registrar Manual defines the roles of specialized support staff including the In-charge of Records for Secondary & Post-Secondary Special Courses, the In-charge of Requests, and the In-charge of Data Processing.\n\nThe In-charge of Records (Secondary & Post-Secondary Special Courses) prepares and issues F-137A and certifications for secondary students. This role involves reading and checking entries on Form 138 and Form 18-T at the end of every school year, assisting in the graduation activities of the Secondary-Laboratory School, and preparing enrollment lists and graduation candidate lists. This staff member assists in selecting honor students and maintains all past and present secondary records, ensuring their integrity and confidentiality.\n\nThe In-charge of Request, Receiving and Releasing serves as the frontline for document processing. This person accommodates, receives, processes, and releases requests for transcripts of records, certifications, and transfer credentials. Duties include keeping daily records of incoming and outgoing documents, generating requested academic records, preparing SARMS forms, maintaining logbooks, and classifying, arranging, filing, and storing both active and inactive records.\n\nThe In-charge of Data Processing handles the digital management of academic information. Responsibilities include encoding data on course and subject codes, encoding complete data for new students, and updating student grades. This role generates worksheets of consolidated grades, transcripts of records, certifications, and enrollment lists with statistical data. The Data Processing staff member accounts for and secures the integrity of digital records and assists in the accomplishment of various survey forms.",
    "keywords": [
      "Secondary Records",
      "Form 137A",
      "Document Releasing",
      "Data Processing",
      "grade encoding",
      "Laboratory School",
      "transcript generation"
    ]
  },
  {
    "id": "sarms_location_layout_file_management",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Office Management",
    "topic": "Office Location, Layout, and File Arrangement",
    "content": "Under the Office Management section of the Proposed Office of the Registrar Manual, the physical location, layout, and file organization of the Student Admission, Promotions, & Records Management Services (SARMS) are strictly defined. The SARMS is located at the Student Center, in the left wing of the Apilado Hall, fronting Nagtahan Street. The office occupies two levels: the ground floor and the mezzanine. The ground floor houses the Request/Receiving/Releasing Section, the Evaluation Section for all Colleges/Programs, the ID Section, and the Records Room for graduated, active, and inactive files. The mezzanine houses the Office of the SARMS Director/College Registrar, the Mini-SARMS Library/Reference Corner/Research Room, the Data Processing Section, and the stockroom for forms and supplies.\n\nThe manual mandates that the office layout must be spacious and adequate for the number of employees, with enough service counters to accommodate students from different colleges. Specific rooms must be provided for inactive files, graduated files, and computers. Active files are required to be located in the working space or immediate vicinity of the Evaluators. The facility requires adequate furniture, equipment, supplies, ventilation, and lighting. Technologically, there must be one computer for every personnel, separate from the units used as servers or for data banking, all connected via Local Area Networking.\n\nFile arrangements follow a specific classification system. Active Files and Records are arranged by College and alphabetized, located in the immediate vicinity of the concerned College In-charge. Inactive Files and Records are alphabetized and stored on the Ground Floor. Graduated Files and Records are arranged by College and by Year, also stored on the Ground Floor.",
    "keywords": [
      "Apilado Hall",
      "SARMS location",
      "office layout",
      "file arrangement",
      "active files",
      "inactive files",
      "records room"
    ]
  },
  {
    "id": "sarms_personnel_assignments_and_staffing",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Personnel",
    "topic": "Staff Assignments, Roles, and Proposed Manpower",
    "content": "The Proposed Office of the Registrar Manual details the specific Personnel Assignments and staffing requirements for SARMS. The manual stipulates that the number of employees should be proportional to the number of students and the volume of work, with a maximum ratio of one (1) personnel to 500 students. Every personnel must have definite duties and responsibilities.\n\nThe specific assignments designated in the manual are as follows:\n\n* **Sheila M. Matias:** Registrar IV / Director (Mezzanine).\n* **[Vacant]:** Registrar III / Asst. Registrar In-charge, Graduate School (Ground Floor).\n* **Teresita B. Del Rosario:** Registrar I, Chief of Evaluations & Promotions Section, In-charge of Graduate School (Ground Floor).\n* **Guillerma M. Belarmino:** Instructor III (detailed), Chief of Request/Receiving & Releasing Section, Chief of Records Section, and In-charge of the College of Engineering (BSCE, ECE, BSME, BSEE).\n* **Fernando N. Filler, Jr.:** Instructor II (detailed), Chief of Records Section, and In-charge of the College of Industrial Technology (BSIT).\n* **Irma F. Filler:** Instructor I (detailed), Chief of Documentation & Authentication Section (ID Section), and In-charge of the College of Arts & Sciences.\n* **Alfredo G. Matias, Jr.:** Clerk III, Chief of Diploma & Certificate Section, In-charge of College of Business & Public Administration, and College of Industrial Technology (BSHRM).\n* **[Vacant]:** Clerk III, In-charge of College of Office & Business Education, Data Encoder.\n* **[Vacant]:** Clerk III, In-charge of Transcript Production (Graduate Program), Data Encoder.\n* **Willie Gapasin:** Clerk I, Chief of Data Processing Section, In-charge of College of Education and Secondary Records/LHS (Mezzanine).\n* **Antonette Ocampo:** Clerk I, Chief of Admission & Registration Section, In-charge of College of Architecture and College of Engineering (BSCOE).\n* **Antonio Del Rosario:** Clerk I, In-charge of College of Fine Arts, Encoder.\n* **Bernardita P. Penalba:** Utility Worker, Chief of Transcript Production Section, In-charge of Special Evening Program, TSAT, TCMS, EARIST-Cavite.\n* **Dorina Carera:** Utility Worker, In-charge of Receiving & Releasing Section, SARMS Maintenance, Encoder.\n* **Michael Natividad:** Utility Worker, In-charge of Request, Releasing & Receiving Section, Liaison Officer to different Agencies, Maintenance of SARMS.\n\nFurthermore, the manual proposes the creation of additional positions to address manpower needs, including a Registrar V (University Registrar), Registrar II (Admission/Testing Officer), Credit Evaluator, Computer Programmer/Administrator, Data Encoder, Records Clerk, and Regular Student Assistants.",
    "keywords": [
      "personnel assignments",
      "staffing ratio",
      "Registrar IV",
      "records officer",
      "manpower needs",
      "organizational chart"
    ]
  },
  {
    "id": "sarms_operating_procedures_security_safety",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Operations & Security",
    "topic": "Operating Procedures, Record Security, and Facility Safety",
    "content": "According to the Operating Procedures and Safety protocols in the Proposed Office of the Registrar Manual, SARMS personnel are required to be punctual and may be required to render honorarium services after regular hours to accommodate evening and working students. Office days and hours must be posted for public guidance.\n\nRegarding the handling of communications, the In-charge of Admission is responsible for receiving, sorting, classifying, and recording all incoming credentials and distributing them to the concerned personnel. Outgoing communications must be recorded with the name of the communication, destination, date, and receiver's signature. Designated personnel handle correspondence regarding curricular offerings and statistical data.\n\nSecurity of files and records is a critical mandate. Classified or strictly confidential records (such as student academic records) are not allowed to be accessed by unauthorized persons, taken out of the office, or borrowed. Unclassified files (like statistical records) may be accessed only with the permission of the SARMS Director. Any file borrowed must be logged in a record book detailing the file name, borrower, date, and issuing personnel. The storeroom is a restricted area, and only authorized personnel or Data Processing staff may access student records in the computer system. The manual recommends microfilming documents for maximum security.\n\nSafety measures for the Working Area and Records Room require that spaces be free from fire hazards or combustible materials. Files and cabinets must be occasionally inspected and treated with insecticides. The Records Room must be capable of accommodating accumulating volumes of files, and proper temperatures must be maintained to preserve records and equipment. Only authorized personnel are allowed in the Computer Room. Finally, equipment must be kept in good working condition, with malfunctions reported immediately, and economy must be observed in the use of supplies.",
    "keywords": [
      "security of records",
      "confidentiality",
      "operating hours",
      "fire safety",
      "restricted access",
      "record borrowing",
      "microfilm"
    ]
  },
  {
    "id": "sarms_files_records_management_classification_system",
    "source": "Office of the Registrar Manual",
    "category": "Records Management - Classification and Storage",
    "topic": "Classification, Filing Systems, and Storage of Student Records",
    "content": "Under the Files and Records Management section of the Office of the Registrar Manual, records are strictly categorized based on confidentiality and usage. Records are classified as 'Strictly Confidential' if they are submitted in pursuance of the special relationship between the student and the school, intended solely for admission or promotion. These include academic reports, adoption papers, Alien Certificate of Registration (ACR), baptismal or birth certificates, disciplinary records, medical and guidance reports, and personal academic records. Conversely, 'Unclassified or Non-confidential' records are those that must necessarily be made public to enable the State and stakeholders to assess the school's performance. These include course approvals, catalogues, class/faculty/room programs, directories of graduates, enrollment lists, permits, recognition documents, prospectuses, school annuals, statistical records, and teaching contracts.\n\nThe manual mandates specific credentials to be filed in the student’s individual jacket. These documents include Accreditation/Validation forms, Adding/Changing/Dropping forms, Admission slips, Affidavits for name changes, Applications for admission or graduation, permits for cross-enrollment or OJT, Certificates of Transfer Credentials, Clearance forms, Evaluation forms, Forms 138 and 137-A, Transcripts of Records, and machine copies of the ACR, Birth Certificate, and Marriage Contract. Other documents such as Notices of Deficiency, Permanent Records, photographs, and study permits for working or foreign students are also stored here.\n\nRegarding the Operating Procedure for file locations, active or current files are stored in separate cabinets in the immediate vicinity of the concerned College Evaluators. Inactive (dropped) files and Graduated files are located on the SARMS Ground Floor. The filing system utilizes an alphabetic arrangement for students' permanent records to prevent misplacement. Student numbers are used for encoding and accessing records in the computer system. Subject filing is used for sundry matters (such as CHED Memos, DBM Circulars, and Annual Reports), which are further classified by year. Strict control measures dictate that files must be returned to their proper alphabetic order immediately after use, and great care must be taken to ensure papers are placed in the correct student jacket.",
    "keywords": [
      "Strictly Confidential Records",
      "Unclassified Records",
      "Student Jacket",
      "Filing System",
      "Active Files",
      "Inactive Files",
      "Form 137-A"
    ]
  },
  {
    "id": "sarms_general_workflow_registrar_office",
    "source": "Office of the Registrar Manual",
    "category": "SARMS - General Workflow",
    "topic": "End-to-End Workflow from Pre-Registration to Graduation",
    "content": "The General Workflow at the Office of the Registrar outlines the sequential operational phases from Pre-Registration to Graduation. The Pre-Registration phase involves the preparation, issuance, and control of pre-enrollment forms and paraphernalia, preparation of admission slips indicating deficiencies for old students, and the administration of the College Admission Test (ECAT) in coordination with the SSC. This phase also includes the dissemination of the school calendar and enrollment procedures.\n\nThe workflow proceeds to Admission and Registration of both old and new students. Following this is the Post-Registration phase, which entails sorting registration forms by College, Course, Major, Level, and Sex. Personnel prepare enrollment lists and statistics, create jackets for new students, and file entrance credentials and registration forms. Student records are then sorted, with specific attention to dropped-out or transferred students.\n\nDuring Student Records Preparation and Encoding, the office requests Form 137-A for freshmen and Transcripts for transferees. Personnel encode personal data, currently enrolled subjects, and update permanent records. This phase includes the preparation of consolidated worksheets and lists of academic scholars. The Posting, Encoding, and Updating of Grades involves transferring data from grade sheets to permanent records and computer systems.\n\nThe Evaluation phase is critical for promotion to the next curriculum year. It involves identifying student deficiencies, advising on pre-requisites, and processing applications for graduation. Finally, the Graduation phase includes preparing the list of candidates for graduation and honor students, processing PD 907 awardees, presenting candidates to the Academic Council, and securing approval from the President and the EARIST Board of Trustees. The workflow concludes with the Preparation and Issuance of Requested Academic Records, such as transcripts, certifications, and good moral certificates.",
    "keywords": [
      "Pre-Registration",
      "Post-Registration",
      "Grade Encoding",
      "Graduation Processing",
      "ECAT",
      "Student Records Workflow",
      "Enrollment Statistics"
    ]
  },
  {
    "id": "sarms_admissions_credential_verification_procedures",
    "source": "Office of the Registrar Manual",
    "category": "SARMS - Admissions Procedures",
    "topic": "Admissions Policies and Verification of Credentials",
    "content": "Under the Office Procedures and Operations for Admissions, the SARMS Admissions Unit is responsible for admitting new freshmen, transferees, and foreign students in coordination with the different Colleges. The In-charge of Admission coordinates the number of students to be admitted and sections to be opened. They examine entrance credentials and inform students of any incomplete requirements. Specifically, the In-charge is responsible for requesting Form 137-A for freshmen and Official Transcripts of Records (OTR) for transferees from their previous institutions. For foreign students, the In-charge processes requirements and manages reports to the Bureau of Immigration.\n\nThe manual explicitly defines invalid credentials for registration purposes. These include: a Transfer Card (Form 138) that does not state eligibility for the course, is unsigned, is marked 'cancelled' or 'used for enrollment in another school,' or contains erasures; a diploma used in lieu of a transcript; or a Transcript of Record marked 'For Evaluation Only,' 'For Personal Reference Only,' or 'For Employment Purposes.' Furthermore, credentials from private schools without government permits or recognition are not honored.\n\nTo ensure the Verification of Authenticity, the In-charge of Records verifies all hand-carried Transcripts of Records by sending a copy to the originating school for authentication or dispatching a liaison officer. Erasures on documents are inspected using a magnifying glass or light source. Any credential with detected alterations is dishonored unless initialed by the Registrar concerned. Transcripts for students entering Graduate School or pursuing second degrees must contain the degree obtained, date of graduation, and CHED Special Order Number.",
    "keywords": [
      "Admissions Unit",
      "Foreign Students",
      "Invalid Credentials",
      "Verification of Authenticity",
      "Transfer Credentials",
      "Form 138",
      "Bureau of Immigration"
    ]
  },
  {
    "id": "sarms_enrollment_registration_procedures",
    "source": "Office of the Registrar Manual",
    "category": "SARMS - Registration Procedures",
    "topic": "Registration, Enrollment Guidelines, and Policies",
    "content": "The Office Procedures regarding Registration and Enrollment mandate that the SARMS provide all Colleges with an Enrollment Memorandum to serve as a guide. The schedule follows the Academic Calendar. Colleges are responsible for enrolling their students and submitting reports to SARMS. Graduating students must be provided with Notices of Deficiencies. For old students, requirements include a complete set of class cards from the previous semester, the previous registration form, and a clearance.\n\nSpecific rules apply to the enrollment process. A schedule form is used to indicate proposed subjects and must be approved before transfer to the official Registration Form. Enrollment of scholastic delinquent students is guided by delinquency rules, while academic scholars must adhere to scholarship contracts. Procedures for adding, changing, dropping, overloading, and substituting subjects must be strictly observed. Notably, Practice Teaching cannot be taken simultaneously with any other subjects to ensure total immersion (CMO No. 11, s. 1999). Transferees cannot enroll in advanced subjects unless prerequisites are validated. Students who fail to submit Registration Forms to SARMS are not considered officially enrolled. Late submission is not entertained unless permitted by the Dean of Student Affairs with necessary sanctions. The preparation of the Enrollment List and Statistics is based on these submitted forms, arranged alphabetically and sorted by College, Course, Major, Year, Section, and Sex.",
    "keywords": [
      "Enrollment Memorandum",
      "Practice Teaching",
      "Class Cards",
      "Late Enrollment",
      "Scholastic Delinquency",
      "Enrollment List"
    ]
  },
  {
    "id": "sarms_special_academic_requests_policies",
    "source": "Office of the Registrar Manual",
    "category": "SARMS - Academic Exceptions",
    "topic": "Policies on Cross-Enrollment, Overloading, Waivers, and Substitution",
    "content": "The Office of the Registrar Manual defines specific protocols for handling special academic requests including Cross-Enrollment, Overloading, Waivers, and Substitution.\n\n**Cross-Enrollment:** A student may cross-enroll in another school only if they are graduating at the end of the academic year, the subject is not a major subject, and the subject is either not offered at the University or belongs to an old curriculum. The maximum allowance is six (6) units, unless these are the final units required for graduation. Requests must be recommended by the Dean, noted by the University Registrar, and approved by the VP for Academic Affairs.\n\n**Overloading:** Overloading is permitted only for graduating students, with a maximum cap of twenty-eight (28) units. Education students undergoing Practice Teaching (12 units) are allowed to overload. However, overloading is strictly prohibited for delinquent students or students who failed a subject while overloading in the previous semester. Approvals follow the Dean-Registrar-VP Academic Affairs hierarchy.\n\n**Sit-in and Tutorial Classes:** The University explicitly prohibits sit-in and tutorial classes.\n\n**Waiver of Prerequisites:** Taking a prerequisite and an advanced subject simultaneously is allowed only if the student is graduating and the prerequisite is a 'repeated subject' (previously failed). If the prerequisite is failed again, the advanced subject is automatically invalidated.\n\n**Subject Substitution:** Substitution is allowed if the substitute subject has the same number of units and is allied to the required subject. This is applicable when the subject belongs to an old curriculum no longer offered by the University. All such requests require the recommendation of the Dean, notation by the Registrar, and approval by the VP for Academic Affairs.",
    "keywords": [
      "Cross-Enrollment",
      "Overloading",
      "Waiver of Prerequisite",
      "Subject Substitution",
      "Tutorial Classes",
      "Academic Policies"
    ]
  },
  {
    "id": "sarms_evaluation_grading_record_maintenance",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Academic Evaluation & Grading",
    "topic": "Student Record Evaluation, Grading Procedures, and Record Maintenance",
    "content": "According to the Proposed Office of the Registrar Manual, the Evaluation of Student Records is conducted at the end of each period to determine scholastic standing, curricular level, and graduation eligibility. An Evaluator assigned to each College or Program prepares the Worksheet for Consolidated Grades, indicating all enrollees, subjects, and units. Permanent records are updated with subjects taken, grades earned, and units credited. Strict adherence to prerequisite rules is mandated; advanced subjects taken without passing the prerequisite are invalidated and not credited regardless of the grade obtained. Subjects not officially enrolled are also excluded from permanent records. Evaluators only process approved requests for overloading, waiver of prerequisites, substitution, and cross-enrollment.\n\nFor transferees and foreign applicants, evaluation is based on the specific degree curriculum and the catalog of the previous school. Credits are not given for unvalidated subjects; if descriptions are unclear, the student must submit certified course descriptions. If a subject's units are lower than the EARIST requirement, the student must retake the subject. The computation of scholastic delinquency excludes 'Incomplete' grades until they are replaced by final grades. For candidates for graduation with honors, the General Weighted Average is computed following the EARIST Code guidelines.\n\nRegarding the names in school records, entries must match the birth certificate, admission credentials, or Alien Certificate of Registration. Discrepancies require an Amended Birth Certificate from the NSO (PSA). Legal name changes require a court order and affidavits. For lost or missing records, the In-charge of Records reconstructs them using enrollment lists, consolidated worksheets, or faculty grading sheets. If records from another school are lost, a duplicate must be requested from the originating institution.\n\nThe manual strictly regulates the Entry and Submission of Grades. Faculty members must submit grade sheets within the period prescribed in the Academic Calendar. Failure to meet deadlines results in reports to authorities and sanctions. Grade sheets must contain alphabetical listings grouped by college/course. Changes or corrections to ratings are permitted only within one month of submission and require an authorization letter from the College Dean accompanying the corrected grade sheet.",
    "keywords": [
      "Evaluation of Records",
      "Prerequisites",
      "Grading System",
      "Scholastic Delinquency",
      "Honors Computation",
      "Record Reconstruction",
      "Grade Submission Deadline",
      "Change of Grades"
    ]
  },
  {
    "id": "sarms_records_management_authentication_production",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Document Management",
    "topic": "Authentication, Falsification Policies, and Document Production",
    "content": "The Records Management section of the Manual outlines procedures for the authentication and production of official documents. For Authentication of Records, students may request verification of their documents. The In-charge of requests counterchecks the authenticity, stamps the machine copy with 'CERTIFIED TRUE COPY OF THE ORIGINAL', and obtains the Registrar's signature. A Certificate of Authentication may also be issued. The manual defines Falsification of Credentials as the alteration, erasure, or forgery of signatures on any document. This is classified as a criminal act punishable under the Revised Penal Code, and any EARIST student found falsifying records is reported to the Office of Student Affairs for disciplinary sanctions.\n\nThe Production of Certifications follows a standard form with a uniform heading, format, and paper size. All certifications must be verified as correct by the Records In-charge and signed by the Registrar. Certifications not produced by the SARMS office are not entertained for signing or sealing. Similarly, the Production of Transcript of Records (OTR) requires the use of official paper with a control number and release date. The student's name on the OTR must exactly match the birth certificate. The OTR includes the course, degree, admission date, birth date, and previous schools attended. For graduate students, it includes the degree obtained and the Special Order (SO) or Registry Number. The manual mandates that all subjects, units, and grades (including failures and dropped subjects) be clearly printed without erasures. If an erasure is necessary, it must be signed by the Registrar. The document must bear the school seal, documentary stamps, and the signatures of the preparer, the verifier, and the Registrar.",
    "keywords": [
      "Authentication of Records",
      "Falsification of Documents",
      "Transcript of Records",
      "OTR",
      "Certified True Copy",
      "Documentary Stamps",
      "Registrar Signature"
    ]
  },
  {
    "id": "sarms_request_release_issuance_rights",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS - Issuance & Rights",
    "topic": "Request Protocols, Release of Records, Specific Issuances, and Stakeholder Rights",
    "content": "The policies governing the Request and Release of Academic Records dictate that requests from other schools for Form 137A or transcripts are attended to promptly. Students must request records personally; if unable, they may authorize a proxy with a written authority. Requests for second copies to replace lost ones are honored, but requests for copies previously forwarded to other schools are not. Records are released directly to the requesting school in a sealed envelope signed by the Registrar. If the record is for the student, it must indicate a valid purpose such as 'For Employment' or 'For Record Purposes'. Remarks like 'For Transfer' or 'For Enrollment' are prohibited on student-held copies.\n\nSpecific guidelines apply to the Issuance of Form 137A, Transcripts, and Certifications. Form 137A is issued only once to a requesting school for admission. Transfer Credentials are issued to students wishing to transfer, also only once, and require a clearance. If unused, the credential must be surrendered if the student returns to EARIST. Diplomas are issued once during Commencement Exercises. In cases of loss, a second copy is not issued; instead, a certification of graduation is provided. A machine copy of a diploma may be certified if an affidavit of loss is presented.\n\nThe manual acknowledges the Rights of Stakeholders based on the Education Act of 1982. Parents have the right to access official records relating to their children (Sec. 8). Students have the right to access their own school records, expect confidentiality, and receive official certificates, diplomas, and transcripts within thirty days of request (Sec. 9).",
    "keywords": [
      "Release of Records",
      "Proxy Authorization",
      "Form 137A",
      "Transfer Credential",
      "Diploma Replacement",
      "Student Rights",
      "Education Act of 1982",
      "Clearance"
    ]
  }
]