[
  {
    "id": "sarms_overview_mission_vision_objectives",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS Introduction & Philosophy",
    "topic": "Overview, Mission, Vision, and Objectives",
    "content": "Under the Proposed Office of the Registrar Manual, the Student Admission, Promotions, & Records Management Services (SARMS), also known as the Office of the Registrar, serves as the repository of all student records and the main frontline service for curricular and academic matters. The SARMS mission is to provide academic and administrative support to instruction to enable the attainment of its educational mandate. The vision is for SARMS to be completely automated and capable of providing online services to clientele. The stated dictum commits the office to be service-oriented, effective, efficient, clientele-friendly, honest, trustworthy, and acting with integrity. The core objectives of the office include Selective Admission, Selective Retention of Students, Efficient and Effective Management of Student Records, and Total Quality Service. General functions encompass Student Admission, Registration, Promotions/Evaluation of Student Records, Records Management, Curricular Information Dissemination, and Graduation.",
    "keywords": [
      "SARMS",
      "Office of the Registrar",
      "mission",
      "vision",
      "objectives",
      "frontline service",
      "student records repository"
    ]
  },
  {
    "id": "sarms_governance_structure",
    "source": "Proposed Office of the Registrar Manual",
    "category": "SARMS Governance",
    "topic": "Organizational Structure and Hierarchy",
    "content": "According to the Governance section of the Proposed Office of the Registrar Manual, the Office of the Registrar operates under the direct supervision of the Institute President, in coordination with the Vice-President for Academic Affairs and the Vice-President for Administration & Finance. The office is headed by the College Registrar (Registrar IV), who is designated as the Director of Admissions, Registrations, Promotions & Records Management Service. The College Registrar is a member of both the Academic Council and the Administrative Council and may be appointed by the President as Secretary of the Academic Council. Personnel under the Registrar's supervision include the Registrar III, Registrar I, Instructors (I, II, III), Clerks (I, II, III), and Service contractual Utility Workers. The Director is responsible for furnishing the President with the SARMS Annual Accomplishment Report.",
    "keywords": [
      "governance",
      "hierarchy",
      "College Registrar",
      "Registrar IV",
      "Academic Council",
      "President",
      "organizational chart"
    ]
  },
  {
    "id": "college_registrar_duties_policy_supervision",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Functions and Responsibilities",
    "topic": "College Registrar Duties - Policy and Supervision",
    "content": "Under the Functions and Responsibilities of SARMS Personnel, the College Registrar assists the top administration in formulating and enforcing policies regarding admissions, enrollment, accreditation, and graduation. The Registrar plans and supervises the admission and selective retention of students, ensuring compliance with academic requirements. Responsibilities include the enforcement of government regulations concerning academic scholarships, scholarship delinquency, transferees, accreditation, student loading, subject-sequence, cross-enrollment, and graduation with honors. The Registrar evaluates scholastic records to determine curricular levels and promotions, manages the selection of honor students for both collegiate and secondary levels, and ensures the security, integrity, and confidentiality of student records. Additionally, the Registrar oversees the management, accounting, control, maintenance, and release of student academic records.",
    "keywords": [
      "College Registrar",
      "policy formulation",
      "selective retention",
      "accreditation",
      "scholarship enforcement",
      "record security",
      "honor students"
    ]
  },
  {
    "id": "college_registrar_duties_operations_admin",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Functions and Responsibilities",
    "topic": "College Registrar Duties - Operations and Administration",
    "content": "The Proposed Office of the Registrar Manual outlines the operational duties of the College Registrar. These duties include disseminating information on curricular offerings, admission requirements, and CHED issuances, as well as orienting students on academic policies. The Registrar prepares memoranda on enrollment, publishes the Academic Calendar and Bulletin of Information, and signs Transcripts of Records. The role involves resolving questions on academic regulations, performing curricular consultations, and assisting in the revision of the EARIST Code and Faculty Manual. Administratively, the Registrar designs process flow charts, reviews office systems, evaluates SARMS personnel performance, designs necessary forms, maintains records of production income, and creates the SARMS development plan. The Registrar also serves as the Institute's contact person for the Commission on Higher Education (CHED) and the Bureau of Immigration.",
    "keywords": [
      "College Registrar",
      "CHED liaison",
      "Bureau of Immigration",
      "transcript signing",
      "academic calendar",
      "personnel evaluation",
      "administrative duties"
    ]
  },
  {
    "id": "in_charge_admissions_college_records",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Functions and Responsibilities",
    "topic": "Admissions and College Records Personnel",
    "content": "Under the Proposed Office of the Registrar Manual, the In-charge of Admissions coordinates the admission and enrollment of new students. Specific tasks include preparing enrollment paraphernalia, verifying the authenticity of submitted credentials, requesting Form 137A and OTRs for new students, preparing freshmen and transferee lists, and serving as the liaison for foreign students. The In-charge of Records/Evaluation (College) prepares individual student records such as worksheets of consolidated grades and permanent records. This role involves posting grades, reconstructing lost files, advising students on subject loads and sequences, and evaluating earned credits from other schools. Furthermore, the In-charge of Records informs students of course deficiencies, assists in graduation activities, prepares lists of candidates for graduation and academic scholars, and verifies prepared Transcripts of Records.",
    "keywords": [
      "In-charge of Admissions",
      "In-charge of Records",
      "enrollment",
      "foreign students",
      "grade consolidation",
      "subject loading",
      "graduation candidates"
    ]
  },
  {
    "id": "support_staff_secondary_requests_data",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Functions and Responsibilities",
    "topic": "Secondary Records, Request Processing, and Data Processing",
    "content": "The Proposed Office of the Registrar Manual defines specific support roles within SARMS. The In-charge of Records (Secondary & Post-Secondary) issues F-137A and certifications, checks F-138 entries, assists in Laboratory School graduation, and maintains all secondary records. The In-charge of Request, Receiving, and Releasing processes requests for transcripts and transfer credentials, maintains daily logs of incoming/outgoing records, and manages the filing of active and inactive records. The In-charge of Data Processing is responsible for encoding course codes, new student data, and student grades. This data role involves generating worksheets of consolidated grades and enrollment statistics, securing record integrity, and assisting in the accomplishment of survey forms.",
    "keywords": [
      "secondary records",
      "F-137A",
      "transcript requests",
      "data processing",
      "grade encoding",
      "record release",
      "filing system"
    ]
  },
  {
    "id": "sarms_location_layout_office_management",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Management",
    "topic": "Location and Office Layout",
    "content": "Under the Office Management section of the Proposed Office of the Registrar Manual, the Student Admission, Promotions, & Records Management Services (SARMS) is located at the Student Center, in the left-wing of Apilado Hall, fronting Nagtahan St. The office occupies both the ground floor and the mezzanine. The ground floor houses the Request/Receiving/Releasing Section, the Evaluation Section for all Colleges, the ID Section, and the Records room for both graduated and active/inactive files. The mezzanine houses the SARMS Director's office, the Mini-SARMS Library/Reference Corner, the Data Processing Section, and the stockroom. Regarding office layout, the manual mandates that the working area must be spacious with enough service counters to accommodate students. It requires specific rooms for inactive files, graduated files, and computers. Active files must be located in the immediate vicinity of the Evaluators. Furthermore, the layout requires one computer per personnel, separate from server units, with Local Area Networking capabilities.",
    "keywords": [
      "Apilado Hall",
      "office location",
      "mezzanine",
      "service counters",
      "file storage",
      "computer requirements"
    ]
  },
  {
    "id": "sarms_file_arrangement_system",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Management",
    "topic": "File Arrangement and Classification",
    "content": "The Proposed Office of the Registrar Manual establishes a specific system for File Arrangements to ensure organization and accessibility. Active Files and Records are classified by College and alphabetized, located in the immediate vicinity of the concerned College In-charge. Inactive Files and Records are alphabetized and stored on the Ground Floor. Graduated Files and Records are classified alphabetically by College and by Year, and are also stored on the Ground Floor. This system ensures that evaluators have immediate access to current records while historical data is archived centrally.",
    "keywords": [
      "active files",
      "inactive files",
      "graduated records",
      "file classification",
      "record storage"
    ]
  },
  {
    "id": "sarms_personnel_assignments_colleges_a",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Personnel Assignments",
    "topic": "Staff Roles and College Assignments (Engineering, CIT, CAS, Graduate School)",
    "content": "The Proposed Office of the Registrar Manual outlines specific personnel assignments to manage student records and evaluations. The policy dictates a staff-to-student ratio of at most 1:500. Leadership roles include the Registrar IV (Director) and Registrar III (Assistant Registrar). Specific operational assignments include the Chief of the Evaluations & Promotions Section, who also oversees the Graduate School. The Chief of the Records Section handles the College of Engineering (BSCE, ECE, BSME, BSEE). Another Chief of Records oversees the College of Industrial Technology (BSIT). The Chief of the Documentation & Authentication Section manages the ID Section and the College of Arts & Sciences. These personnel are responsible for the specific duties and volume of work associated with these colleges.",
    "keywords": [
      "College of Engineering",
      "College of Industrial Technology",
      "Graduate School",
      "College of Arts & Sciences",
      "Registrar IV",
      "evaluations"
    ]
  },
  {
    "id": "sarms_personnel_assignments_colleges_b",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Personnel Assignments",
    "topic": "Staff Roles and College Assignments (Business, Education, Architecture, Secondary)",
    "content": "The Proposed Office of the Registrar Manual details further personnel assignments for specific academic units. The Chief of the Diploma & Certificate Section is in charge of the College of Business & Public Administration and the College of Industrial Technology (BSHRM). Dedicated Clerks serve as Data Encoders for the College of Office & Business Education and the Graduate Program Transcript Production. The Chief of the Data Processing Section manages the College of Education and Secondary Records (LHS). The Chief of the Admission & Registration Section oversees the College of Architecture and the College of Engineering (BSCOE). Additionally, specific staff members are assigned to the College of Fine Arts, the Special Evening Program (TSAT, TCMS, EARIST-Cavite), and general transcript production. Utility workers are assigned to maintenance and the Request, Releasing & Receiving Section.",
    "keywords": [
      "College of Business",
      "College of Education",
      "College of Architecture",
      "LHS",
      "Special Evening Program",
      "transcript production"
    ]
  },
  {
    "id": "sarms_operating_procedures_staffing_needs",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Operating Procedures",
    "topic": "Proposed Staffing and Office Operations",
    "content": "The Proposed Office of the Registrar Manual identifies manpower needs and standard operating procedures. Proposed additional positions include a University Registrar (Registrar V), a Registrar II (Admission/Recruitment Officer, preferably with a Psychology background), a Credit Evaluator, a Computer Programmer, Data Encoders, and Computer Literate Records Clerks. Regarding operations, SARMS personnel are encouraged to be punctual, and office hours must be posted for public guidance. A key policy requires personnel to render honorarium services after regular hours to accommodate evening and working students when needed. The manual also specifies communication protocols: the In-charge of Admission receives and distributes all incoming credentials. Outgoing communications must be recorded with the date and recipient's signature, and specific personnel are designated to reply to correspondence regarding curricular offerings and statistical data.",
    "keywords": [
      "staffing requirements",
      "honorarium services",
      "office hours",
      "communication protocol",
      "manpower needs"
    ]
  },
  {
    "id": "sarms_safety_security_records",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Safety and Security",
    "topic": "Security of Files, Records, and Equipment",
    "content": "Under the Safety and Security of Files and Records section, the Manual mandates that every employee is personally accountable for records in their possession. Classified or strictly confidential records, such as student academic records, must not be accessed by unauthorized persons, taken out of the office, or borrowed. Unclassified files (e.g., statistical records) may be borrowed only with the permission of the SARMS Director, and must be logged in a record book. The storeroom is a restricted area. Only authorized personnel may access student records in the computer system. To ensure maximum security, the manual recommends microfilming records. Furthermore, the working area must be free from fire hazards, and records rooms must be treated against pests and maintained at proper temperatures. Equipment must be kept in good condition, with malfunctions reported immediately.",
    "keywords": [
      "confidentiality",
      "record security",
      "restricted area",
      "microfilm",
      "pest control",
      "equipment maintenance"
    ]
  },
  {
    "id": "records_management_classification_confidentiality",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Files and Records Management",
    "topic": "Classification of Files: Confidential vs. Non-Confidential",
    "content": "Under the Files and Records Management section of the Proposed Office of the Registrar Manual, records are classified into two distinct categories based on confidentiality. \"Strictly Confidential\" records are those submitted in pursuance of the special relationship between the student and the school, intended solely for admission or promotion purposes. These include Academic reports, Adoption papers, Alien Certificate of Registration, Baptismal or Birth Certificates, Disciplinary Records, Medical and Guidance Reports, and Personal/Academic Records. Conversely, \"Unclassified or Non-confidential\" records are public documents required by the State or parents to assess the school's legal existence and performance. Examples of unclassified records include Approval of Courses, Catalogues, Class/Faculty/Room Programs, Directory of Graduates, Enrolment Lists, Permits and Recognition, Prospectuses, School Annuals, Statistical records, and Teaching Contracts.",
    "keywords": [
      "confidential records",
      "public records",
      "student privacy",
      "academic reports",
      "disciplinary records",
      "school prospectus"
    ]
  },
  {
    "id": "student_jacket_credentials_content",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Files and Records Management",
    "topic": "Credentials Filed in Student Jackets",
    "content": "The Proposed Office of the Registrar Manual specifies the required credentials to be filed in a student's individual jacket. Mandatory forms include Accreditation/validation Forms, Adding/changing/Dropping Forms, Admission Slips, and Affidavits for name corrections. The jacket must store applications for admission, graduation, shifting, or transferring, as well as approved permits for cross-enrollment, OJT, overload, subject substitution, or prerequisite waivers. Essential academic records maintained in the jacket include Clearance/completion forms, Evaluation/Registration Forms, Form 138, Form 137-A, Transcripts of Records, Notices of Deficiency, and Permanent Records. Additionally, the file must contain machine copies of the ACR, Birth Certificate, and Marriage Contract, alongside photographs and study permits for working or foreign students.",
    "keywords": [
      "student jacket",
      "Form 137-A",
      "Form 138",
      "Transcript of Records",
      "admission slip",
      "clearance forms",
      "study permits"
    ]
  },
  {
    "id": "sundry_matters_reference_files",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Files and Records Management",
    "topic": "Sundry Matters and Reference Documents",
    "content": "The Office of the Registrar maintains \"Sundry Matters\" for operational and regulatory reference. According to the Manual, these files include administrative documents such as Annual, Monthly, or Weekly Accomplishment Reports, the Annual Procurement Program, and Minutes/Resolutions of Academic Council Meetings. External regulatory references include CHED Basic Higher Education Data, CHED Memos/Orders, Civil Service Circulars, CSC PD 907, and DBM Memo No. 71 regarding Head Count. Internal EARIST references include the EARIST Code, Faculty Manual, Student Handbook, and various Circulars/Orders. The office also keeps operational data such as Enrolment lists, Worksheets for Consolidated Grades, Grades Sheets, lists of Academic Scholars, and lists of Candidates for Graduation with honors.",
    "keywords": [
      "sundry matters",
      "CHED Memos",
      "EARIST Code",
      "accomplishment reports",
      "academic council minutes",
      "grade sheets"
    ]
  },
  {
    "id": "filing_system_location_control",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Files and Records Management",
    "topic": "File Location, System, and Control",
    "content": "The Proposed Office of the Registrar Manual dictates the operating procedures for the location and control of records. Active or current files are stored in a separate cabinet in the immediate vicinity of the concerned College Evaluators. In-active (dropped) files and Graduated Files are located in the SARMS Ground Floor records room. Regarding the filing system, students' permanent records use an alphabetic arrangement to prevent misplacement. These records are kept in individual jackets, and personnel must file documents immediately upon receipt. For digital data processing and control, the Student Number is used as the primary access key in the computer system. Sundry matters are organized using subject filing, further classified by year or school year.",
    "keywords": [
      "active files",
      "inactive files",
      "graduated files",
      "alphabetic filing",
      "student number",
      "subject filing"
    ]
  },
  {
    "id": "workflow_pre_registration_admission",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Pre-Registration, Admission, and Registration",
    "content": "Under the General Workflow of the Office of the Registrar, the Pre-Registration phase involves the preparation, issuance, and control of pre-enrollment forms and paraphernalia. For old students, the office prepares Admission Slips indicating deficiencies and scholastic standing. For new applicants, the office issues the Application for College Admission Test, interviews applicants, and administers the test in coordination with the SSC. This phase includes correcting the ECAT, analyzing items, and disseminating results to individual students in coordination with College Deans. The office also coordinates with Deans regarding school programs, prepares the school calendar, and disseminates enrollment procedures. This workflow phase concludes with the actual Admission and Registration of both old and new students.",
    "keywords": [
      "ECAT",
      "pre-registration",
      "admission slip",
      "school calendar",
      "enrollment procedure",
      "College Admission Test"
    ]
  },
  {
    "id": "workflow_post_registration_filing",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Post-Registration and Records Filing",
    "content": "According to the General Workflow procedures, the Post-Registration phase focuses on the organization of student data. This involves sorting Registration forms by College, Course, Major, Curricular Level, and Sex. The office prepares Enrolment Lists and Enrolment Statistics categorized by the same variables. Personnel prepare jackets for new students' records. Regarding Filing, Sorting, and Arrangement, the office checks and files entrance credentials, registration forms, and other pertinent records into the student jackets. This process includes sorting the jackets of dropped-out and transferred students and arranging individual student jackets for archival or active use.",
    "keywords": [
      "post-registration",
      "student jacket",
      "enrollment statistics",
      "filing system",
      "dropped students",
      "registration forms"
    ]
  },
  {
    "id": "workflow_records_encoding_grades",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Student Records Preparation and Grade Encoding",
    "content": "The General Workflow for Student Records Preparation involves requesting Form 137-A for new freshmen and Transcripts of Records for transferees. Personnel encode students' personal data and currently enrolled subjects into the computer system and permanent records. This phase includes preparing consolidated worksheets of enrolled subjects by College and Major, and coordinating with the SSC to prepare the list of Academic Scholars. For Grading, the workflow requires posting student grades from grade sheets to permanent records and encoding/updating these grades in the computer system from consolidated worksheets.",
    "keywords": [
      "Form 137-A",
      "grade encoding",
      "permanent record",
      "academic scholars",
      "transferees",
      "consolidated worksheets"
    ]
  },
  {
    "id": "workflow_evaluation_graduation",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Student Evaluation and Graduation Process",
    "content": "Under the General Workflow, the Evaluation process involves assessing student records for promotion to the next curriculum year and identifying deficiencies or earned credits. The office advises students on prerequisites, co-requisites, and mandated subjects. The Graduation workflow follows evaluation, involving the processing of graduation applications and the preparation of the List of Candidates for Graduation. This includes selecting honor students and processing PD 907 awardees. Candidates are presented first to the Local College Academic Council, then to the Institute Academic Council. Finally, the list is submitted for the approval of the President and confirmation by the EARIST Board of Trustees prior to the holding of graduation rites.",
    "keywords": [
      "graduation evaluation",
      "prerequisites",
      "honor students",
      "Academic Council",
      "Board of Trustees",
      "PD 907",
      "graduation rites"
    ]
  },
  {
    "id": "workflow_issuance_academic_records",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Preparation and Issuance of Academic Records",
    "content": "The General Workflow for the Office of the Registrar includes the Preparation and Issuance of Requested Academic Records. This function serves to accommodate specific student requests for documentation. The office prepares and generates Transcripts of Records for graduated students. Additionally, it handles requests for certifications, certificates of good moral character, and other related documents as required by students.",
    "keywords": [
      "transcript of records",
      "certification",
      "good moral character",
      "document issuance",
      "student requests"
    ]
  },
  {
    "id": "workflow_pre_registration_admission",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Pre-Registration, Admission, and Registration",
    "content": "Under the General Workflow of the Office of the Registrar, the Pre-Registration phase involves the preparation, issuance, and control of pre-enrollment forms and paraphernalia. For old students, the office prepares Admission Slips indicating deficiencies and scholastic standing. For new applicants, the office issues the Application for College Admission Test, interviews applicants, and administers the test in coordination with the SSC. This phase includes correcting the ECAT, analyzing items, and disseminating results to individual students in coordination with College Deans. The office also coordinates with Deans regarding school programs, prepares the school calendar, and disseminates enrollment procedures. This workflow phase concludes with the actual Admission and Registration of both old and new students.",
    "keywords": [
      "ECAT",
      "pre-registration",
      "admission slip",
      "school calendar",
      "enrollment procedure",
      "College Admission Test"
    ]
  },
  {
    "id": "workflow_post_registration_filing",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Post-Registration and Records Filing",
    "content": "According to the General Workflow procedures, the Post-Registration phase focuses on the organization of student data. This involves sorting Registration forms by College, Course, Major, Curricular Level, and Sex. The office prepares Enrolment Lists and Enrolment Statistics categorized by the same variables. Personnel prepare jackets for new students' records. Regarding Filing, Sorting, and Arrangement, the office checks and files entrance credentials, registration forms, and other pertinent records into the student jackets. This process includes sorting the jackets of dropped-out and transferred students and arranging individual student jackets for archival or active use.",
    "keywords": [
      "post-registration",
      "student jacket",
      "enrollment statistics",
      "filing system",
      "dropped students",
      "registration forms"
    ]
  },
  {
    "id": "workflow_records_encoding_grades",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Student Records Preparation and Grade Encoding",
    "content": "The General Workflow for Student Records Preparation involves requesting Form 137-A for new freshmen and Transcripts of Records for transferees. Personnel encode students' personal data and currently enrolled subjects into the computer system and permanent records. This phase includes preparing consolidated worksheets of enrolled subjects by College and Major, and coordinating with the SSC to prepare the list of Academic Scholars. For Grading, the workflow requires posting student grades from grade sheets to permanent records and encoding/updating these grades in the computer system from consolidated worksheets.",
    "keywords": [
      "Form 137-A",
      "grade encoding",
      "permanent record",
      "academic scholars",
      "transferees",
      "consolidated worksheets"
    ]
  },
  {
    "id": "workflow_evaluation_graduation",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Student Evaluation and Graduation Process",
    "content": "Under the General Workflow, the Evaluation process involves assessing student records for promotion to the next curriculum year and identifying deficiencies or earned credits. The office advises students on prerequisites, co-requisites, and mandated subjects. The Graduation workflow follows evaluation, involving the processing of graduation applications and the preparation of the List of Candidates for Graduation. This includes selecting honor students and processing PD 907 awardees. Candidates are presented first to the Local College Academic Council, then to the Institute Academic Council. Finally, the list is submitted for the approval of the President and confirmation by the EARIST Board of Trustees prior to the holding of graduation rites.",
    "keywords": [
      "graduation evaluation",
      "prerequisites",
      "honor students",
      "Academic Council",
      "Board of Trustees",
      "PD 907",
      "graduation rites"
    ]
  },
  {
    "id": "workflow_issuance_academic_records",
    "source": "Proposed Office of the Registrar Manual",
    "category": "General Workflow",
    "topic": "Preparation and Issuance of Academic Records",
    "content": "The General Workflow for the Office of the Registrar includes the Preparation and Issuance of Requested Academic Records. This function serves to accommodate specific student requests for documentation. The office prepares and generates Transcripts of Records for graduated students. Additionally, it handles requests for certifications, certificates of good moral character, and other related documents as required by students.",
    "keywords": [
      "transcript of records",
      "certification",
      "good moral character",
      "document issuance",
      "student requests"
    ]
  },
  {
    "id": "sarms_admissions_procedures_roles",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Admissions Procedures and Responsibilities",
    "content": "Under the Office Procedures and Operations of the Proposed Office of the Registrar Manual, the SARMS Admissions Unit is responsible for admitting new freshmen, transferees, and foreign students in coordination with the Institute's Colleges. The In-charge of Admissions must coordinate with Colleges regarding student quotas and section openings. This role requires the processing, examination, and careful evaluation of entrance credentials. Specific duties include informing students of incomplete requirements, requesting Form 137-A for freshmen, and requesting official Transcripts of Records for transferees. For foreign students, the In-charge processes admission requirements and manages reports submitted to the Bureau of Immigration. The policy mandates that the list of new and transferee students be provided to the concerned Evaluators.",
    "keywords": [
      "Admissions Unit",
      "freshmen admission",
      "foreign students",
      "Bureau of Immigration",
      "Form 137-A",
      "credential evaluation"
    ]
  },
  {
    "id": "sarms_credential_evaluation_verification",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Evaluation and Verification of Credentials",
    "content": "The Proposed Office of the Registrar Manual defines strict criteria for the Evaluation of Credentials. Invalid records for registration include: Transfer cards (F-138) with erasures, missing signatures, or remarks like \"For employment purposes only\"; diplomas used as substitutes for transcripts; and records from private schools without government recognition. The SARMS must make official requests for copies of records. To verify authenticity, the In-charge of Records may send a liaison officer to the originating school or use physical inspection methods (magnifying glass/light) to detect erasures. Transcripts for students entering Graduate School or taking second degrees must contain the Special Order Number (for private schools) or Registry Order. All hand-carried transcripts from newly admitted students must be verified by the In-charge of Records before being accepted as valid entrance credentials.",
    "keywords": [
      "invalid credentials",
      "transcript verification",
      "F-138",
      "Special Order Number",
      "liaison officer",
      "document authenticity"
    ]
  },
  {
    "id": "sarms_registration_enrollment_policies",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Registration and Enrollment Policies",
    "content": "The Registration and Enrollment section of the Proposed Office of the Registrar Manual outlines the coordination between SARMS and Colleges based on the Academic Calendar. The Colleges manage the enrollment of their students and submit reports to SARMS. Old students must present class cards, previous registration forms, and clearances. Scholastic delinquent students and academic scholars are enrolled according to their specific rules or contracts. The policy strictly prohibits Practice Teaching students from taking other subjects to ensure total immersion (citing CMO No. 11, s. 1999). Transferees cannot enroll in advanced subjects until prerequisites are validated. Students who fail to submit Registration Forms to SARMS are not considered officially enrolled. Late submission is only accepted with permission from the Dean of Student Affairs.",
    "keywords": [
      "enrollment procedure",
      "CMO No. 11",
      "practice teaching",
      "class cards",
      "scholastic delinquency",
      "late enrollment"
    ]
  },
  {
    "id": "sarms_special_academic_requests_cross_overload",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Cross-Enrollment, Overloading, and Tutorial Requests",
    "content": "The Manual details protocols for special academic requests. Cross-enrollment is permitted only if the student is graduating, the subject is not offered at the University, or the subject belongs to an old curriculum. The maximum allowance for cross-enrollment is six (6) units, unless the units are the final requirement for graduation. Overloading is restricted to graduating students with a maximum limit of twenty-eight (28) units. Education students in Practice Teaching are allowed 12 units of overloading, but delinquent students are strictly prohibited from overloading. Sit-in and tutorial classes are not allowed by the University. All requests for cross-enrollment or overloading must be recommended by the Dean, noted by the University Registrar, and approved by the VP for Academic Affairs.",
    "keywords": [
      "cross-enrollment",
      "overloading",
      "tutorial classes",
      "maximum units",
      "graduating students",
      "practice teaching"
    ]
  },
  {
    "id": "sarms_waivers_substitutions_prerequisites",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Waiver of Prerequisites and Subject Substitution",
    "content": "Under the Office Procedures, a student may request to take a prerequisite and an advanced subject simultaneously (Waiver of Prerequisite) only if they are graduating and the prerequisite is a \"repeated subject.\" If the student fails the prerequisite, the advanced subject is automatically invalidated. Subject Substitution is permitted if the substitute has the same number of units and is allied to the required subject, typically when the original subject belongs to an old curriculum no longer offered. Both waivers and substitutions require the recommendation of the Dean, notation by the Registrar, and approval by the VP of Academic Affairs. The In-charge of Records must receive copies of all approved requests.",
    "keywords": [
      "waiver of prerequisite",
      "subject substitution",
      "simultaneous enrollment",
      "repeated subject",
      "curriculum deviation"
    ]
  },
  {
    "id": "sarms_student_records_evaluation_standards",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Standards for Evaluation of Student Records",
    "content": "The Evaluation of Students Records section mandates that records be evaluated at the end of each period to determine scholastic standing and curricular level. Evaluators prepare Worksheets for Consolidated Grades and permanent records. A critical rule states that no student may take an advanced subject without passing the prerequisite; subjects taken without passing prerequisites are invalidated regardless of the grade earned. For transferees, credits from other schools are not recognized until validated and accredited by EARIST to ensure matching descriptions and units. If a transferred subject has fewer units than required, the student must retake the subject. When computing scholastic delinquency, a grade of \"Incomplete\" is excluded until it is replaced by a final grade. Evaluators must remain updated on CHED Memoranda regarding course standards.",
    "keywords": [
      "prerequisite validation",
      "transferee accreditation",
      "scholastic delinquency",
      "incomplete grade",
      "permanent record",
      "grade validation"
    ]
  },
  {
    "id": "sarms_records_integrity_grading_system",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Office Procedures and Operation",
    "topic": "Record Integrity, Reconstruction, and Grading System",
    "content": "The Manual establishes protocols for record integrity and grading. Student names in school records must match their Birth Certificate or Alien Certificate of Registration. Name changes require an Amended Birth Certificate or Court Order. Lost records from SARMS are reconstructed using enrollment lists or faculty grading sheets, while lost external records require a duplicate request from the former school. Regarding grading, faculty members must submit grade sheets within the Academic Calendar deadline; failure to do so results in sanctions. Grade sheets must list students alphabetically and group them by college. Changes or corrections to ratings are only permitted within one month of submission and require authorization from the College Dean.",
    "keywords": [
      "record reconstruction",
      "name correction",
      "grade submission",
      "grade correction",
      "faculty sanctions",
      "grading deadline"
    ]
  },
  {
    "id": "records_management_authentication_falsification",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Authentication of Documents and Falsification Policy",
    "content": "Under the Records Management section of the Proposed Office of the Registrar Manual, students may request the authentication of their records. The In-charge of requests counterchecks the authenticity of the document. Validated copies bear the remark \"CERTIFIED TRUE COPY OF THE ORIGINAL,\" initialed by the In-charge and signed by the Registrar, upon payment of corresponding fees. Alternatively, a Certificate of Authentication may be issued with the university seal. Regarding falsification, the manual defines it as the alteration, erasure, or forgery of signatures on credentials or records. Falsification is considered a criminal act punishable under the Revised Penal Code. Any EARIST student found to have falsified academic records is reported to the Office of Student Affairs for disciplinary sanctions. Additionally, the office must immediately attend to verification requests from the Civil Service Commission and other agencies regarding documents submitted by EARIST students.",
    "keywords": [
      "certified true copy",
      "authentication fees",
      "falsification of records",
      "Revised Penal Code",
      "disciplinary sanctions",
      "document verification"
    ]
  },
  {
    "id": "records_management_certification_production",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Production of Certifications",
    "content": "The Proposed Office of the Registrar Manual outlines the standards for producing Certifications. The In-charge of Request prepares certifications using standard forms with a uniform heading, format, and paper size. Every certification must include a \"verified correct\" feature signed by the concerned Evaluator or Records In-charge. The Registrar only signs certifications that are strictly in order. Crucially, the office does not entertain, sign, or seal certifications that were not produced internally by the Office of the Registrar.",
    "keywords": [
      "certification format",
      "verified correct",
      "Registrar signature",
      "official seal",
      "document production"
    ]
  },
  {
    "id": "records_management_otr_formatting_entry",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Transcript of Records (OTR) - Formatting and Data Entry",
    "content": "According to the Proposed Office of the Registrar Manual, the Transcript of Records (OTR) must be prepared on official paper with a uniform format, control number, and release date. The student's name on the OTR must exactly match their birth certificate, including specific spacing, hyphenation, and symbols, and must appear consistently across all pages. The OTR must detail the course, degree, admission date, birth date, and previous schools attended. For transfer students, the entrance data must indicate the former school's name. For Graduate Program students, the entrance data must include the degree obtained, the school name, and the Special Order (SO) Number or Registry Number. All subjects, descriptive titles, units, and grades must be clearly printed. The manual mandates that failure and incomplete grades be indicated, even if the subject was later passed. Dropped subjects must also be listed.",
    "keywords": [
      "Transcript of Records",
      "OTR formatting",
      "Special Order Number",
      "grade entry",
      "incomplete grades",
      "transfer students"
    ]
  },
  {
    "id": "records_management_otr_validation_issuance",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Transcript of Records (OTR) - Validation and Issuance",
    "content": "The Proposed Office of the Registrar Manual specifies validation and issuance rules for Transcripts of Records (OTR). The OTR must be free of alterations, erasures, or typographical errors; if an erasure is unavoidable, the Registrar must sign it. For graduated students, remarks must include the degree obtained, graduation date, and honors received. The document requires signatures from the preparer, the verifier, and the Registrar. It must bear the School Seal and a cancelled documentary stamp. OTRs not produced by the office will not be signed. Regarding release, OTRs are sent directly to the requesting school in a sealed envelope with the Registrar's signature on the flap. If a student hand-carries the record, they must be authorized. The manual explicitly prohibits issuing student-held records for purposes such as \"Enrollment,\" \"Transfer,\" or \"General Purposes.\" Allowable purposes include \"Employment\" or \"Records Purposes.\"",
    "keywords": [
      "OTR validation",
      "documentary stamp",
      "sealed envelope",
      "school seal",
      "prohibited purposes",
      "record release"
    ]
  },
  {
    "id": "records_management_requests_timelines",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Request Procedures and Release Timelines",
    "content": "Under the Request for Academic Records section of the Proposed Manual, requests from other schools for Form 137-A or transcripts are treated with courtesy and promptness. Students must request records personally or authorize a proxy with written authority. The Registrar honors requests for replacement of lost or damaged copies, but will not issue a duplicate if the original was already sent to another school in the Philippines. The standard release timeline upon fee payment is three (3) days for certifications and two (2) weeks for transcripts. A \"fast lane\" option is available for a higher fee. All released records are logged in the University Registrar's Record Book with a control number and the preparer's name. Corrections to released records regarding omitted subjects or typographical errors are handled via a supplemental certification sent to the concerned school.",
    "keywords": [
      "request processing",
      "fast lane",
      "release timeline",
      "record book",
      "proxy authorization",
      "correction certification"
    ]
  },
  {
    "id": "records_management_f137a_transfer_credentials",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Issuance of Form 137-A and Transfer Credentials",
    "content": "The Proposed Office of the Registrar Manual governs the issuance of specific transfer documents. Form 137-A is issued only once to a requesting school for admission purposes and is never given directly to students or parents without written permission from the school concerned. Transfer Credentials are issued to students wishing to transfer schools; this document is issued only once and must include a copy of grades. If a student returns to EARIST without using the credential, they must surrender it. Both documents require the student to submit a clearance form and pay the required fees. For graduates applying for their first Transcript of Record, a clearance of all accountabilities is a mandatory prerequisite.",
    "keywords": [
      "Form 137-A",
      "Transfer Credential",
      "clearance",
      "admission requirements",
      "student transfer"
    ]
  },
  {
    "id": "records_management_diploma_rights",
    "source": "Proposed Office of the Registrar Manual",
    "category": "Records Management",
    "topic": "Issuance of Diploma and Stakeholder Rights",
    "content": "The Manual states that the Diploma is issued only once during Commencement Exercises and must be signed by the President, College Dean, and Registrar. Issuance requires a completed clearance form. The university does not issue second copies of lost diplomas; instead, it issues a certification of graduation. A machine copy may be certified if the student executes an affidavit of loss, but it will be marked \"machine copy.\" Regarding rights, the manual cites the Education Act of 1982. Parents have the right to access official records of their children. Students enjoy the right to access their own records, the right to confidentiality, and the right to the issuance of official certificates, diplomas, and transcripts within thirty days from the request.",
    "keywords": [
      "diploma issuance",
      "affidavit of loss",
      "Education Act of 1982",
      "student rights",
      "parental rights",
      "confidentiality"
    ]
  }
]