[

  {
    "id": "vpaa_colleges_program_curriculum",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Accessing Program Curriculum (Course Syllabus, Outline, and Description)",
    "content": "At the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), the process for accessing a Program Curriculum—which includes the Course Syllabus, Course Outline, Course Description, and/or Course Crediting—is managed by the respective Colleges. This service is available to current students, former students, graduates, and academic personnel as a Government-to-Citizen (G2C) or Government-to-Government (G2G) transaction. To initiate the request, the client must submit a formal Letter of Request for the program curriculum to the EARIST College Dean’s Office. The client may also need to provide the specific Course Description relevant to their concern. Upon submission, the Area Chairperson and the College Dean will evaluate the submitted documents, a process that takes approximately 1 day. Following evaluation, the College Dean will endorse the documents for approval and submit them to the Student Registration and Records Management Services (SRRMS). This final stage of endorsement takes an additional 1 day. There are no fees associated with this request, and the total processing time is estimated at 2 days.",
    "metadata": {
      "keywords": [
        "Program Curriculum",
        "Course Syllabus",
        "Course Description",
        "VPAA",
        "College Dean"
      ]
    }
  },
  {
    "id": "vpaa_colleges_completion_of_grade",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Validation and Processing of Completion of Grade",
    "content": "Under the Office of the Vice President for Academic Affairs at EARIST, the 'Completion of Grade' process involves the validation of completion forms by the faculty and their endorsement to the Registrar's Office. This service is available to students and faculty personnel. The primary requirement is a 'Completion Form' which must include an Official Receipt (OR) Number and the signature of the concerned faculty member. This form is secured through coordination with SRRMS, the Cashier, and the respective College. The process consists of several steps: First, the client must submit the Completion Form and sign the Client Log-in request at the Dean's Office, where staff will assist in the initial approval (5 minutes). Second, for the faculty copy, the College Dean evaluates the approval within 15 minutes. Finally, for the student’s copy, the client signs the log-in receipt and presents their ID, with the College Dean completing the final validation in another 15 minutes. No fees are charged by the College for this validation. The total processing time at the College level is 35 minutes.",
    "metadata": {
      "keywords": [
        "Completion of Grade",
        "Completion Form",
        "Grade Validation",
        "College Dean"
      ]
    }
  },
  {
    "id": "vpaa_colleges_admission_enrollment_interview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Admission and Enrollment: College Interview and Aptitude Testing",
    "content": "The EARIST Colleges facilitate student admission and enrollment by evaluating knowledge and aptitude through a Program Preparedness Test (PPT) and a formal interview. This procedure is applicable to new students, shifters, and transferees. To begin, the student must present several documents: a Notice of Admission or ECAT Result (secured from SRRMS), an Accomplished Application Form, and a Letter of Request recommending approval signed by the concerned program chairperson. The first phase involves the College Interview and Assessment, where the Program Chairperson and Enrolling Officer at the Dean's Office assist the student; this evaluation takes 1 day. Following the interview, the student must submit the Chairperson's Evaluation for final review. Once evaluated, the Program Chairperson will issue an 'Advisement Slip' to the student, which takes another 1 day. There are no fees for this interview and assessment phase. The total processing time for this specific segment of enrollment is 2 days.",
    "metadata": {
      "keywords": [
        "College Interview",
        "Admission",
        "Program Preparedness Test",
        "Advisement Slip",
        "Program Chairperson"
      ]
    }
  },
  {
    "id": "vpaa_colleges_cross_registration",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Cross-Registration Procedure (Taking Subjects in Other Colleges/Schools)",
    "content": "At EARIST, cross-registration allows students to take specific subjects in other colleges or schools. This G2C/G2G transaction is available to both old and new students, as well as transferees and shifters. The student must prepare an Accomplished Application Form (from SRRMS), a Chairperson’s Evaluation (from the Area Chairperson), and a Letter of Request recommending approval. The process requires the student to obtain recommending approval from their concerned College Dean and Program Chairperson at the Dean’s Office. The staff at the Dean’s Office assists the student in processing these concerns. This procedure is streamlined to be completed within 1 day. No fees are required for this college-level recommendation.",
    "metadata": {
      "keywords": [
        "Cross-registration",
        "External Enrollment",
        "Application Form",
        "College Dean"
      ]
    }
  },
  {
    "id": "vpaa_colleges_course_adjustments",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Course Adjustments: Withdrawal, Dropping, Changing, and Adding Courses",
    "content": "The EARIST Colleges manage the approval process for students who need to modify their enrollment through withdrawal, dropping, changing, or adding courses. This service is open to all student types, including shifters and qualified applicants. To proceed, the student must secure and submit a 'Withdrawal/Changing/Adding Form' from SRRMS, along with an Accomplished Application Form and the Chairperson’s Evaluation. Additionally, a Letter of Request recommending approval from the program chairperson must be presented. The student submits these forms to the Dean’s Office, where the College Dean and the Program Chairperson assist in reviewing the request. This approval process at the college level takes 1 day. There are no processing fees for these adjustments at the College Dean’s Office.",
    "metadata": {
      "keywords": [
        "Dropping",
        "Withdrawal",
        "Adding Courses",
        "Changing Courses",
        "Course Adjustment"
      ]
    }
  },
  {
    "id": "vpaa_colleges_excess_overload_units",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Approval of Excess/Overload Units for Graduating Students",
    "content": "Graduating students at EARIST may request to take an excess or overload of subjects, up to a maximum of 12 units. To apply, the student must obtain an Accomplished Application Form and a Withdrawal/Changing/Adding Form from SRRMS, as well as an evaluation from their Area Chairperson. The student must then submit a Letter of Request recommending approval by the concerned program chairperson to the College Dean’s Office. The Program Chairperson and College Dean will review the student's concern and academic standing to provide the necessary recommendation. This entire college-level approval process is completed within 1 day. No fees are charged for this specific evaluation and approval.",
    "metadata": {
      "keywords": [
        "Overload",
        "Excess Units",
        "Graduating Students",
        "12 Units",
        "Program Chairperson"
      ]
    }
  },
  {
    "id": "vpaa_colleges_student_activities",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Approval of Student Organization Activities and Facility Use",
    "content": "The EARIST Colleges and the Office of the Vice President for Academic Affairs (VPAA) are responsible for validating and approving student activities, including the use of school facilities and equipment. This process applies to regular and irregular students from first to fifth year. Requirements include a Letter of Request recommending approval by the program chairperson and all pertinent documents as mandated by CHED Memorandum Order No. 63, s. 2017 (secured from CHED or the College). The process involves two main phases: First, the College Dean reviews the request and pertinent documents, taking 1 day. Second, the request is forwarded to the VPAA, who reviews and endorses the documents to the Institute President for final approval. This second phase takes an additional 1 day. No fees are required for the validation of these activities. The total processing time for approval is 2 days.",
    "metadata": {
      "keywords": [
        "Student Activities",
        "School Facilities",
        "CHED CMO 63",
        "VPAA",
        "Off-campus Activities"
      ]
    }
  },
  {
    "id": "vpaa_colleges_student_complaints",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the Vice President for Academic Affairs / Colleges",
    "topic": "Filing and Investigation of Student Complaints",
    "content": "At EARIST, students from any year level (regular or irregular) may file academic or personnel-related complaints. The process involves the verification and investigation of the complaint by the relevant college office before it is endorsed to the Grievance and Legal Counsel Office for further proceedings. The student must submit a 'Written Complaint,' which is secured and prepared by the client themselves. Once the written complaint is submitted to the EARIST College Dean’s Office, the Dean and office staff will assist the student and conduct the necessary investigation. This verification and initial handling of the complaint take 3 days. There are no fees associated with filing a complaint. The total processing time at the College level is 3 days.",
    "metadata": {
      "keywords": [
        "Student Complaint",
        "Grievance",
        "Investigation",
        "Written Complaint",
        "College Dean"
      ]
    }
  },
  {
    "id": "office_president_refund_tuition_fees",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President",
    "topic": "Approval for Refund of Tuition Fees",
    "content": "At the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), the process for the refund of tuition fees is a Government-to-Citizen (G2C) transaction managed by the Office of the President. This service is specifically designed for students (External Clients) seeking to retrieve paid fees. To initiate this process, the student must provide a basic request letter that has been officially endorsed by their respective College Dean and further recommended by the Vice President concern. Additionally, a photocopy of the Certificate of Registration (COR) must be obtained from the Student Registration and Records Management Services (SRRMS) Office and attached to the request. The student then submits these required documents to the Office of the EARIST President. The staff at the Office of the President will verify the propriety of the request and ensure it bears the necessary endorsements from the Dean or Director and the Vice President. This verification process involves coordination with staff from the Financial Management Services (FMS) Office and the Student Affairs and Services (SAS) Office. There are no fees to be paid for this administrative approval, and the total processing time is approximately 30 minutes.",
    "metadata": {
      "keywords": ["Tuition Refund", "COR", "Office of the President", "FMS", "SAS", "G2C"]
    }
  },
  {
    "id": "office_president_clearances_diplomas_certificates",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President",
    "topic": "Approval and Signature for Clearances, Leave Forms, Class Programs, Diplomas, and Certificates",
    "content": "Under the Office of the EARIST President, administrative approval and official signatures are provided for critical student and personnel documents, including clearances, leave forms, class programs, diplomas, and certificates. This service serves as a high-level validation for both internal clients (Executive Officials, Faculty, and Employees) and external clients (Students). To secure the President's signature, the client must first obtain several prerequisite signatures and endorsements depending on the document type: for diplomas and certificates, the signatures of the concerned Dean, Director, and the Registrar are required ; for clearances and leave forms, the signatures of the Supervisor, Administrative Services (AS) Director, and Human Resource Management Services (HRMS) are necessary. Furthermore, documents related to academic affairs must bear the endorsement of the Office of the Vice President for Academic Affairs (VPAA). Once these preliminary requirements are met, the client submits the documents to the Office of the President. The staff then performs a final check for the completeness of all prerequisite signatories before the President affixes the final signature. This process involves the participation of the SRRMS Office, SAS Office, HRMS Office, and various College Services. No fees are charged for this service, and the total processing time for the President's signature is 30 minutes.",
    "metadata": {
      "keywords": ["Diplomas", "Clearances", "Certificates", "Presidential Signature", "VPAA", "Registrar"]
    }
  },
  {
    "id": "sas_scholarship_validation_processing",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of Student Affairs and Services",
    "topic": "Scholarship Services: Validation and Processing",
    "content": "Under the Office of Student Affairs and Services (SAS) at EARIST, specifically within the Scholarship, Admission, Registration, and Records Management Services (SARRMS), student applicants can avail of scholarship validation and processing. This Government-to-Citizen (G2C) service is designed to support the academic journey of officially enrolled students by managing both internal and external scholarship requirements. To initiate this process, the student must prepare two primary documents: a Certificate of Recognition (COR), which must be secured from the EARIST Registrar's Office, and a Report of Grades (ROG), obtainable from either the EARIST College Dean's Office or the Registrar's Office. The student is required to submit PDF copies of these documents to the SARRMS Office staff. At EARIST, the SAS SARRMS staff is responsible for requesting and processing these documents from the student applicant to ensure eligibility for scholarship benefits. While the standard processing of these documents is free of charge, a fee of P20.00 is strictly enforced if the student requires a replacement for lost documents. The total processing time for this scholarship validation is one (1) day. The SARRMS office serves as a critical bridge between the student and financial assistance programs, ensuring that academic records are accurately reflected in scholarship applications. This simple transaction ensures that deserving EARISTians maintain their financial support through meticulous record verification and institutional endorsement.",
    "metadata": {
      "keywords": ["SARRMS", "Scholarship", "Certificate_of_Recognition", "Report_of_Grades", "Registrar", "Financial_Assistance"]
    }
  },
  {
    "id": "sas_leadership_on_campus_activity_request",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of Student Affairs and Services / Leadership Division",
    "topic": "Processing of Requests for On-Campus Student Activities",
    "content": "At EARIST, the Leadership Division under the Office of Student Affairs and Services facilitates the approval for academic and non-academic activities conducted within the campus premises. This service is available to officially enrolled students, registered student organizations (RSOs), and various EARIST Colleges. To start the process, students must secure a Student Activity Proposal Form from the SAS Staff or the Program Chair of the Leadership Division. The primary requirement is a comprehensive request letter for the activity, which must be addressed to the Institute Student Government (ISG) President, and then routed to the EARIST Institute President through the Vice President for Academic Affairs (VPAA), the SAS Director (Ms. Agnes F. Amorin), and the Program Head of the Leadership Division. Additionally, students must provide a Budget Proposal, a Student Activity Proposal Form, and other supporting documents. These documents are typically 'client-produced' by the student organizations, whether they are College-based (CBOs), Institutional, Religious, or Political organizations. The student first submits the endorsement of the proposal with all required documents to the ISG. The ISG President or Officer receives the letter and performs an initial assessment (5 minutes). Then, the Program Head of the Leadership Division reviews the request and assessment (5 minutes). The letter and proposal are then submitted to the SAS Director for signature, moving forward to the VPAA (Dr. Eric C. Mendoza) and finally to the Institute President (Dr. Rogelio T. Mararadlo) for final approval. This routing process takes approximately 2 days. Once approved, the SAS Staff transmits a copy of the Student Activity Proposal to the proponent, who must sign the office logbook. The total processing time is 2 days and 12 minutes with no fees involved.",
    "metadata": {
      "keywords": ["On-Campus_Activities", "Leadership_Division", "Student_Organizations", "ISG", "Activity_Proposal", "Agnes_Amorin", "Rogelio_Mararadlo"]
    }
  },
  {
    "id": "sas_off_campus_activity_approval_ched",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of Student Affairs and Services / Local Off-Campus Activities Committee",
    "topic": "Processing of Requests for Off-Campus Student Activities",
    "content": "The processing of Off-Campus Student Activities at EARIST is a complex transaction regulated under CHED CMO No. 63, Series of 2017. This service is essential for Officially Enrolled Students, Registered Student Organizations, and Colleges planning activities outside the Institute. The student must first obtain the Off-Campus Form and Checklist from the Office of Student Affairs and Services (SAS). Required documents include a Notarized Parent's Consent Form (client-produced), a Medical Clearance issued by the EARIST Medical and Dental Services, and a formal Resolution and Budget Proposal. The process begins with the student submitting the application and documents to the SAS Staff (2 minutes). The SAS Staff then performs an initial evaluation, ticking off the checklist items (30 minutes). Subsequently, the SAS Director and the Chairman of the Local Off-Campus Activities Committee conduct a thorough evaluation of individual requirements, including Insurance, Medical Clearance, and Parent's Consent. If the trip is CHED-funded, verification with the Accounting Department is required (2 days). Proponents then receive detailed evaluation results and must comply with any lacking requirements. Once all requirements are met, the SAS Director and Committee Chairman prepare and approve additional documents and the Certificate of Compliance (1 day). The SAS Staff then releases the documents for the proponent to route through signatories, including the College Dean, Director, Chief, VPAA, and the Office of the President (3 days). After the Institute President signs the endorsement letter to CHEDRO, the proponent submits the final package to the CHED Regional Office. The total institutional processing time is 6 days, 1 hour, and 52 minutes, with no fees involved.",
    "metadata": {
      "keywords": ["Off-Campus", "CHED_CMO_63", "Medical_Clearance", "Parental_Consent", "Local_Off-Campus_Activities_Committee", "CHEDRO"]
    }
  },
  {
    "id": "sas_leadership_org_accreditation_new",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of Student Affairs and Services / Leadership Division",
    "topic": "Application for Student Organization Accreditation (Newly-founded)",
    "content": "At EARIST, newly-founded student organizations must undergo a formal accreditation process as regulated by the EARIST Student Handbook 2019, Article X, Section 3. This complex transaction is managed by the Leadership Division of the Student Affairs and Services (SAS) office. To begin, student leaders must secure the Accreditation Checklist and forms from the Institute Student Government (ISG) (5 minutes). They must also obtain the SAS Accreditation Form from the SAS Office. The submission package must include a Letter of Application for Recognition, the Constitution and By-Laws of the Organization, an Organization Profile, and a List of Officers (including specimen signatures, student numbers, and 2x2 ID photos). Additional requirements include a Certification of Membership and a One-Year Master Plan and Financial Plan. The process starts with submitting the completed requirements to the ISG for initial evaluation (2 days). The ISG then logs and submits the evaluated documents to the SAS Staff (10 minutes). The Program Head of the Leadership Division evaluates the submission and issues findings for further compliance if necessary (2 days). After the proponent complies with any lacking requirements, the SAS Staff and Program Head perform a final evaluation and print the Certificate of Accreditation (1 day). The accreditation is then endorsed to the SAS Director and VPAA for the Institute President's approval (3 days). Finally, the SAS Director issues the signed Certificate of Accreditation, and the proponent signs the logbook to receive their copy (30 minutes). The total turnaround time is 7 days and 50 minutes.",
    "metadata": {
      "keywords": ["Accreditation", "Newly-founded_Organization", "Student_Handbook", "ISG", "Constitution_and_By-Laws", "Master_Plan"]
    }
  },
  {
    "id": "sas_leadership_org_accreditation_renewal",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of Student Affairs and Services / Leadership Division",
    "topic": "Renewal of Student Organization Accreditation",
    "content": "The Renewal of Student Organization Accreditation at EARIST is a vital annual process governed by Article X, Section 3 of the EARIST Student Handbook 2019. This service ensures that existing student organizations remain compliant with institutional standards. Proponents must secure the Accreditation Checklist and forms from the Institute Student Government (ISG). In addition to the standard requirements like the Constitution, By-Laws, and List of Officers, the renewal process specifically requires an Accomplishment Report with documentation and a detailed Financial Report for the previous year. To initiate the renewal, proponents submit their filled-up checklist and requirements to the ISG for initial evaluation, which takes 2 days. The ISG then forwards the documents to the SAS Staff, who logs them into the monitoring report (10 minutes). The Program Head of the Leadership Division evaluates the requirements and may issue findings for further compliance (2 days). Once the organization complies with any additional requirements, the SAS Staff and Program Head evaluate the compliance and print the Renewal Certificate of Compliance and Certificate of Accreditation (1 day). These documents are endorsed to the SAS Director and VPAA for the Institute President's signature (3 days). The final step involves the issuance of the Renewal Certificate by the SAS Director (30 minutes), where the student representative signs the logbook to receive the copy (5 minutes). The total time for renewal is 7 days and 50 minutes with no fees required.",
    "metadata": {
      "keywords": ["Accreditation_Renewal", "Accomplishment_Report", "Financial_Report", "Leadership_Division", "Student_Organizations"]
    }
  },
  {
    "id": "sas_complaints_and_investigation_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of Student Affairs and Services / Student Discipline Board",
    "topic": "Student Complaints and Investigation Procedures",
    "content": "Under the Office of Student Affairs and Services at EARIST, the Student Discipline Board (SDB) handles formal complaints and investigations involving students. This Government-to-Citizen (G2C) process is designed to ensure due process and maintain institutional discipline. To file a complaint, the student must produce and submit two (2) copies of a formal Complaint Letter and two (2) copies of Proof and Evidence, such as written testimonies of witnesses. The process begins when the student submits the Complaint Letter to a Member of the Student Discipline Board, who officially receives the document (10 minutes). Following the submission, the SDB Member notifies all concerned parties and schedules a hearing (10 minutes). During the scheduled hearing, the Chair of the Student Discipline Board conducts the proceedings to gather facts (1 day). After the hearing, the Chair prepares a resolution signed by the committee and submits it to the Office of the Vice President for Academic Affairs (VPAA) for the Institute President's final approval (20 minutes). Finally, the student may secure a copy of the Resolution of the case from an SDB Member (10 minutes), who ensures all concerned parties are provided with a copy. This simple transaction ensures that grievances are addressed professionally within a total processing time of 2 hours and 50 minutes. There are no fees associated with filing a complaint or participating in an investigation at EARIST.",
    "metadata": {
      "keywords": ["Complaints", "Investigation", "Student_Discipline_Board", "SDB", "Hearing", "Resolution", "Due_Process"]
    }
  },

  {
    "id": "sas_guidance_testing_ecat_administration",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "EARIST College Admission Test (ECAT) Administration",
    "content": "At EARIST, the Counseling and Testing Services office manages the administration of the EARIST College Admission Test (ECAT), which is a critical vehicle for assessing a student's aptitude and intelligence. This Government-to-Citizen (G2C) complex transaction is required for new student applicants (External Clients). To initiate the process, the applicant must present one original copy of their Examination Permit, which must be secured from the EARIST Admission Office. The process begins when the applicant presents this permit to the Guidance Office Staff, who will receive, check, and sign the document (15 minutes). Following this, the student proceeds to the ECAT administration proper, which lasts 1 hour and 30 minutes. Once the testing is complete, the Chief of the Guidance Office is responsible for scanning, summarizing, and forwarding the test results to the respective College Deans and posting them in the Pinnacle system, a phase that takes 5 days. There are no fees associated with this testing service. The total estimated processing time for the ECAT administration and result dissemination is 5 days, 1 hour, and 45 minutes.",
    "metadata": {
      "keywords": ["ECAT", "Admission_Test", "Guidance_Office", "Testing_Services", "Pinnacle", "Entrance_Exam"]
    }
  },
  {
    "id": "sas_guidance_counseling_walk_in",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Walk-in Counseling Services",
    "content": "Under the Guidance, Counseling, and Testing Services at EARIST, walk-in counseling is provided as the 'heart' of the guidance program to help students integrate information about themselves and their environment. This simple G2C transaction is available to any student who requires immediate assistance. To begin, the student must visit the EARIST Guidance Office to accomplish a Walk-in Slip and sign the Log Sheet, both of which are original copies provided by the office. The student is also required to fill out an ISO-registered Counseling Form secured at the same location. Once these documents are ready, the Guidance Office Staff conducts an interview and the counseling session proper. During this time, the staff ensures the counseling form is fully accomplished and signed. This interaction is designed to be a 'helping relationship' that can occur in either an individual or group setting. The entire process is completed within 1 hour, and there are no fees charged to the student for this service.",
    "metadata": {
      "keywords": ["Walk-in_Counseling", "Guidance_Office", "Counseling_Form", "Mental_Health", "Student_Support"]
    }
  },
  {
    "id": "sas_guidance_initiated_counseling",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Guidance-Initiated Counseling",
    "content": "At EARIST, the Counseling and Testing Services office proactively reaches out to students through Guidance-Initiated Counseling. This service is classified as a simple G2C transaction for officially enrolled students. The process is triggered when the Guidance Office Staff issues a Call Slip (ISO-registered) to a specific student. The student is then required to report to the Guidance Office, sign the original Log Sheet, and participate in the counseling session. The Guidance Office Staff maintains a Counseling Logbook and a Counseling Schedule (both original copies) to manage these appointments. During the session, the staff conducts the counseling and ensures that the necessary counseling forms are accomplished to document the interaction and any recommended courses of action. The total time for the student's involvement is 1 hour, with no fees paid for the session. This service ensures that students who may be facing academic or personal challenges receive institutional support even if they have not requested it themselves.",
    "metadata": {
      "keywords": ["Call_Slip", "Guidance-Initiated", "Counseling_Logbook", "Student_Intervention"]
    }
  },
  {
    "id": "sas_guidance_exit_interview_career",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Exit Interview and Career Counseling",
    "content": "The EARIST Counseling and Testing Services provides Exit Interview and Career Counseling for students, particularly those who are graduating or leaving the institution. This service aims to help students make appropriate decisions regarding their future and the world of work. For this simple G2C transaction, the student must go to the Guidance Office to secure and sign an original Log Sheet and an original Exit Interview Form. The process begins with the Guidance Office Staff distributing the Exit Interview Form and explaining its details (10 minutes). This is followed by a formal interview or career counseling session conducted by the Guidance Office Staff, which lasts approximately 1 hour. This session provides personal-social and vocational-occupational information to help the student transition to their next academic setting or professional program. The total processing time is 1 hour and 10 minutes, and no fees are associated with this service.",
    "metadata": {
      "keywords": ["Exit_Interview", "Career_Counseling", "Vocational_Information", "Graduating_Students"]
    }
  },
  {
    "id": "sas_guidance_good_moral_certificate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Issuance of Good Moral Certificate",
    "content": "At EARIST, students requiring a behavioral clearance for various purposes can apply for a Good Moral Certificate through the Counseling and Testing Services office. This simple G2C transaction is designed to verify the student's disciplinary standing within the institution. To initiate the request, the student must first obtain a Good Moral Form from the EARIST Registrar's Office. The student then presents this form to the Guidance Office Staff and signs the original office Logbook. The Guidance Office Staff is responsible for counseling the student (if necessary) and officially signing the Good Moral Certificate based on the student's record. This administrative process is highly efficient, with a total processing time of only 15 minutes. There are no fees required to be paid at the Guidance Office for the issuance of this behavioral clearance. This certificate serves as an official testament to the student's conduct during their tenure at EARIST.",
    "metadata": {
      "keywords": ["Good_Moral_Certificate", "Behavioral_Clearance", "Guidance_Office", "Registrar", "Student_Conduct"]
    }
  },
  {
    "id": "admission_services_screening_and_application",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Admission Services",
    "topic": "Admission Screening and Application Process",
    "content": "At EARIST, the process for Admission is designed for external student clients (G2C) and is managed by the Admission Services office to allow students to apply for their chosen academic programs. To initiate the admission process, a student must first undergo a preliminary assessment where screening officers determine available slots and verify mandatory requirements. This initial screening takes approximately 5 minutes and involves no fees. The student must prepare a comprehensive set of documents: 1 Copy of Original Form 138 (Senior High School Report Card) secured from their Previous Senior High School; 1 Copy of the Original Certificate of Good Moral Character from their Previous Senior High School or College; 1 Copy of the Original Certificate of Live Birth (Photocopy) from the PSA/NSO; 1 Copy of Original Transfer Credentials or Honorable Dismissal from their Previous College/University; 1 Copy of Original Copy of Grades from their Previous College/University; and a Personal Data Form which is secured directly from the EARIST Admission Services office. Under the supervision of the Chief of Admission Services, staff will then issue the ECAT Form, a process taking 15 minutes. Following this, the staff provides the student with their specific examination date, time, and permit within 5 minutes. On the designated Examination Day, the student must bring the ECAT Form, a Mongol 2 Pencil, and 2 pieces of scratch paper to the Guidance Office. The Staff of the Guidance Office facilitates the examination, which lasts 2 hours. Subsequently, the Staff and Chief of Admission Services handle the checking of examinations and the releasing of results over a period of 2 days. For those who pass, a 30-minute Personal Interview is conducted by the EARIST College Deans. Qualified students then proceed to a Physical Examination conducted by the Chief of Medical and Dental Services, lasting 1 hour. The final step involves the filling and processing of admission documents by the Chief of Admission Services, taking 5 minutes. The total estimated processing time for the entire admission cycle is 2 days and 4 hours, with no fees charged to the applicant.",
    "metadata": {
      "keywords": [
        "ECAT_Form",
        "Admission_Services",
        "Senior_High_School_Report_Card",
        "PSA_Birth_Certificate",
        "College_Deans",
        "Medical_and_Dental_Services",
        "Transfer_Credentials",
        "Personal_Data_Form"
      ]
    }
  },
  {
    "id": "medical_dental_services_regular_consultation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Regular Medical Consultation and Check-up (Emergency and Non-Emergency)",
    "content": "Under the Medical and Dental Services at EARIST, regular consultations and check-ups are provided to a wide range of clients, including Executive Officials, Students, Employees, Faculty, and Extension Services (Adopted Barangays and Employee's Immediate Families). This service ensures patients are assessed and declared physically fit and healthy. The process varies slightly based on the urgency of the case. For emergency cases (1.1), the student or client must visit the Medical Clinic where a Medical Officer or Nurse on duty will perform a 10-minute assessment. If it is a priority emergency, immediate first aid or a hospital referral is provided within 15-20 minutes. For non-emergency cases (1.2), the assessment takes 20 minutes, followed by a 30-minute consultation where the Medical Officer manages, treats, and provides prescriptions. Both processes conclude with the patient registering in the logbook during a check-out phase facilitated by the Medical Staff. There are no requirements to secure beforehand, and no fees are charged. The total time is approximately 35 minutes for emergency regular cases and 1 hour for non-emergency cases.",
    "metadata": {
      "keywords": [
        "Medical_Clinic",
        "Consultation",
        "Emergency",
        "Check-up",
        "G2C",
        "G2G"
      ]
    }
  },
  {
    "id": "medical_dental_services_ojt_medical_certificate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Medical Certificate to OJT Students",
    "content": "At EARIST, students preparing for their On-the-Job Training (OJT) must obtain a medical certificate to attest they are physically fit for deployment. To initiate this process, the student must first secure several laboratory results from a Medical Laboratory of their choice: a Chest X-ray, a Complete Blood Count (CBC) result, a Urinalysis result, and optionally, a Drug Test result. Once these are obtained, the student visits the EARIST Medical Clinic for a 20-minute assessment and a 30-minute consultation proper. During this time, the Medical Officer or Nurse on duty reviews the laboratory work-ups and performs a physical check-up. If cleared, the Medical Officer signs the Student Health Record or Medical Certificate (Fit for OJT). The final step is checking out and registering in the clinic logbook with the Medical Staff, which takes 10 minutes. This service is classified as a G2C transaction and involves no fees from the institute, with a total processing time of 1 hour.",
    "metadata": {
      "keywords": [
        "OJT_Medical_Certificate",
        "Chest_X-ray",
        "CBC",
        "Urinalysis",
        "Drug_Test",
        "Student_Health_Record"
      ]
    }
  },
  {
    "id": "medical_dental_services_fit_to_work_certificate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Return/Fit to Work Certificate",
    "content": "The EARIST Medical and Dental Services office facilitates the Return/Fit to Work process for internal clients, specifically employees and faculty. To avail of this G2G service, the client must present a Medical Certificate and Medical Abstract from their attending physician or specialist, as well as Laboratory Test Results from a laboratory of their choice. Upon visiting the Medical Clinic, the Medical Officer or Nurse conducts a 20-minute assessment and a 30-minute medical check-up to evaluate the submitted results. If the client is physically fit, the Physician signs the Return/Fit to Work form. If the client is not yet fit, they may be advised for follow-up treatment or referred to a specialist, adding 30-60 minutes to the assessment time. The process ends with a 10-minute registration in the logbook. The total time for a successful clearance is typically 2 hours, and no fees are required.",
    "metadata": {
      "keywords": [
        "Fit_to_Work",
        "Employee_Health",
        "Medical_Abstract",
        "Physician_Clearance",
        "G2G"
      ]
    }
  },
  {
    "id": "medical_dental_services_permit_to_teach",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Permit to Teach",
    "content": "For EARIST faculty and executive officials, obtaining a Permit to Teach is a mandatory medical clearance process. The client must first secure a Laboratory Test Result and a Medical Certificate from a medical laboratory of their choice. The client then visits the Medical Clinic, where a Nurse or Medical Officer performs an initial 20-minute assessment. This is followed by a 30-minute consultation where the Medical Officer reviews the submitted medical and laboratory work-ups and conducts a physical check-up. Upon a successful assessment, the Medical Staff issues and signs the Permit to Teach certificate. The process concludes with the client registering their exit in the logbook, taking 10 minutes. This G2G transaction is completed within 1 hour and is free of charge.",
    "metadata": {
      "keywords": [
        "Permit_to_Teach",
        "Faculty_Clearance",
        "Laboratory_Results",
        "Medical_Officer"
      ]
    }
  },
  {
    "id": "medical_dental_services_fit_to_play_athletes",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Fit to Play/Medical Certificate to Student-Athletes",
    "content": "Student and employee athletes at EARIST must secure a 'Fit to Play' medical certificate to participate in athletic activities. The athlete is required to bring three documents: a Medical History from a hospital or physician of choice, a Physical Education Form from the EARIST Physical Education Department, and a Chest X-ray result from a laboratory of choice. The athlete visits the Medical Clinic for a 20-minute assessment. The Medical Officer and Nurse then spend 30 minutes evaluating the work-up results and conducting a consultation to issue the Fit to Play Form. The process ends with a 10-minute logbook registration. This service ensures that institutional athletes meet health standards and is completed in 1 hour with no fees.",
    "metadata": {
      "keywords": [
        "Athlete_Health",
        "Fit_to_Play",
        "PE_Form",
        "Chest_X-ray",
        "Medical_History"
      ]
    }
  },
  {
    "id": "medical_dental_services_excuse_slip",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Excuse Slip",
    "content": "EARIST students who have missed classes due to medical reasons must follow a standardized procedure to obtain an excuse slip. If the student had a previous consultation at the clinic for the illness, they must visit the clinic for a 20-minute interview and assessment. The Medical Officer then verifies the student's name in the logbook and issues the excuse slip. If the student did not have a previous clinic visit for the illness, they must secure and present an Excuse Letter from their Parents or Guardians along with a Valid ID of the parent/guardian. The Medical Officer assesses the student (20 minutes) and acknowledges the letter. The total process, including a 10-minute check-out and logbook registration, takes approximately 1 hour and 10 minutes. No fees are charged for this G2C service.",
    "metadata": {
      "keywords": [
        "Excuse_Slip",
        "Parental_Excuse_Letter",
        "Logbook_Verification",
        "Student_Absence"
      ]
    }
  },
  {
    "id": "medical_dental_services_pre_enrollment_freshmen",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Pre-enrollment Health Assessment for First-Year Students",
    "content": "All incoming first-year students and transferees at EARIST must undergo a health assessment before enrollment. To begin, the student must obtain a Chest X-ray from a medical laboratory of their choice. Upon visiting the Medical Clinic, a Nurse or Medical Officer conducts a 20-minute interview and assessment. This is followed by a 30-minute consultation where the officer reviews the X-ray results. Students who are physically well are issued a 'Fit to Enroll' form. If there are medical findings, the student must provide an additional medical certificate from a specialist regarding the deficiency before the 'Fit to Enroll' form is signed. The final step is the 10-minute registration in the logbook. The entire process takes 1 hour and is free of charge.",
    "metadata": {
      "keywords": [
        "Pre-enrollment",
        "Freshmen_Medical",
        "Fit_to_Enroll",
        "Transferees",
        "Chest_X-ray"
      ]
    }
  },
  {
    "id": "medical_dental_services_annual_physical_exam",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Annual Physical Examination (APE) for Faculty and Employees",
    "content": "To promote overall health among staff, EARIST requires an Annual Physical Examination (APE) for all academic and non-academic employees. Employees must visit the Medical Clinic to fill out necessary forms, taking about 1 hour. They then undergo a comprehensive battery of tests including Chest X-ray, Blood Chemistry, Urinalysis, Fecalysis, FBS, ECG, and Dental/Eye examinations, which takes approximately 2 hours and is coordinated with an external service provider. Once results are released, the employee returns to the Medical and Dental Services (MDS) for a 30-minute review. If physically fit, the Medical Officer signs the clearance. If findings are present, the employee receives treatment or a 1-hour referral session with a specialist. The process concludes with a 10-minute logbook entry. The total estimated time is 4 hours and 40 minutes, with no fees charged to the employee.",
    "metadata": {
      "keywords": [
        "APE",
        "Annual_Physical_Examination",
        "Employee_Health",
        "Blood_Chemistry",
        "ECG",
        "Referral"
      ]
    }
  },
  {
    "id": "medical_dental_services_dental_checkup_extraction",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Dental Check-up and Tooth Extraction",
    "content": "Dental services at EARIST, including check-ups and tooth extractions, are available to students, faculty, employees, and executive officials. For students, the primary requirement is to present their Registration or Enrollment Form, which can be secured from the Office of the Registrar (SARRMS). The client starts by visiting the Dental Clinic and filling out forms for 30 minutes, after which they are referred to the School Dentist. The Dental Officer then performs the dental work-up, treatment, or extraction and provides prescribed medication as needed, a process taking 2 hours. Finally, the client checks out by registering in the logbook for 10 minutes. This service is classified as both G2C and G2G, involves no fees, and has a total processing time of 2 hours and 40 minutes.",
    "metadata": {
      "keywords": [
        "Dental_Clinic",
        "Tooth_Extraction",
        "School_Dentist",
        "SARRMS",
        "Dental_Work-up"
      ]
    }
  },
  {
    "id": "financial_management_services_tes_grantees",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Processing of Financial Assistance to TES Grantees",
    "content": "At EARIST, the Financial Management Services (FMS) manages the distribution of financial assistance to Tertiary Education Subsidy (TES) grantees. This G2C process is initiated by the Office of Student Affairs (OSA), which must submit several requirements: an Approved Letter Request from the client or Student Affairs Services (SAS), a Qualified list of grantees from CHED, transmittal letters and proof of remittances (LDDAP-ADA/Check) from CHED, and the Certificate of Registration (CORs) for all grantees. The FMS staff begins by logging the documents (1 day) and reviewing them for completeness. If in order, they print the Statement of Account for each student in the list and prepare the payroll. The FMS then obligates the funds and prepares the BURS, DV, and JEV, which the FMS Director finalizes. Once the SAS returns the signed payroll and BURS, the Budget and Accounting Services perform a further review (1 day) and sign the necessary boxes. The completed documents are then released to the Office of the President for the final signature on Box B of the DV. The total processing time is approximately 2 days, and no fees are required.",
    "metadata": {
      "keywords": ["TES_Grantees", "Financial_Assistance", "CHED", "SAS", "OSA", "BURS", "DV", "JEV"]
    }
  },
  {
    "id": "financial_management_services_tuition_refund",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Payment of Refund of Tuition",
    "content": "The process for the refund of tuition fees at EARIST is designed for students and scholarship providers, such as the Quezon City Government, following approval from the Head of the Agency. To avail of this G2C service, the student or scholar must provide several original or photocopied documents: a Request Letter for refund, a Certificate of Registration, and the Official Receipt of Tuition Fee. Additional requirements include a Certificate of Scholarship from the provider, the student's Statement of Account, and an endorsement letter from the Student Affairs Services (SAS). The FMS staff first validates the documents from various colleges or the OSA (4 hours). Accounting Services then evaluates the documents and prepares the payroll for grantees (1 hour). Subsequently, Budget Services prepares the Disbursement Voucher (DV), JEV, and Obligation/Budget Utilization Request (ObR or BUR), recording the payment in the RAO. Final signing involves the Director of OSA, Chief of Budget and Accounting, and the EARIST President (1 day). The final step is the preparation of the LDDAP, SLIIE, or Check by the Cashier. The total time for this refund process is 2 days, 6 hours, and 30 minutes, with no fees involved.",
    "metadata": {
      "keywords": ["Tuition_Refund", "Scholarship", "Official_Receipt", "COR", "SAS", "DV", "BUR", "LDDAP"]
    }
  },
  {
    "id": "financial_management_services_student_clearance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Application for Student Clearance (Accounting Portion)",
    "content": "For EARIST students applying for a Transcript of Records (TOR), a mandatory step is securing the accounting portion of the student clearance to ensure there are no outstanding financial obligations. This process is categorized as a G2C transaction available to students, parents, or guardians. The student must present an accomplished Students Clearance Form, which is secured from the Registrar's Office. If a parent or guardian is applying on the student's behalf, they must also present a Student's Authorization letter. Upon submission at the Financial Management Services office, the staff in charge of the student database checks the student's account in the system, downloads, prints, signs, and releases the clearance back to the requester. This entire procedure is designed for speed, taking only 2 minutes to complete, and is provided free of charge.",
    "metadata": {
      "keywords": ["Student_Clearance", "Accounting_Clearance", "TOR", "Registrar", "Student_Database"]
    }
  },
  {
    "id": "financial_management_services_statement_of_account",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Issuance of Statement of Account (SOA)",
    "content": "The Financial Management Services at EARIST provides a Statement of Account (SOA) to students who require it for scholarship applications or financial assistance. To request an SOA, a student, parent, or guardian must submit a request letter from the sponsoring agency or office. If the requester is a parent or guardian, they must also provide a signed authorization from the student. The process involves the staff in charge of the student database verifying the student's account in the institutional system. Once verified, the staff downloads, prints, and signs the SOA before releasing it to the client. This G2C transaction is completed within 2 minutes and does not require any payment of fees.",
    "metadata": {
      "keywords": ["Statement_of_Account", "SOA", "Scholarship_Application", "Financial_Assistance", "Student_Database"]
    }
  },
  {
    "id": "nstp_issuance_certification_completion_nstp1",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "National Service Training Program",
    "topic": "Issuance of Certification of Completion in NSTP 1",
    "content": "At EARIST, the National Service Training Program (NSTP) office issues a Certification of Completion to students to officially certify that they have finished the NSTP 1 course. This G2C service is available to NSTP students classified as external clients. To initiate the process, the student must have passed the NSTP 1 subject. The student's primary step is to present their Report of Grades (ROG) showing a passing mark for NSTP 1, which is secured from their respective NSTP Subject records. Upon presentation, the NSTP Director facilitates the issuance of the certificate. This procedure is free of charge and has a total processing time of 30 minutes.",
    "metadata": {
      "keywords": [
        "NSTP_1",
        "Certification_of_Completion",
        "ROG",
        "Report_of_Grades",
        "NSTP_Director"
      ]
    }
  },
  {
    "id": "nstp_issuance_certification_graduate_cwts_lts",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "National Service Training Program",
    "topic": "Issuance of Certification as Graduate of NSTP CWTS/LTS",
    "content": "The EARIST National Service Training Program office provides a Certification of Graduation to students who have successfully completed the full NSTP requirements. This service is intended for graduates of the NSTP (external clients). To qualify, a student must have passed both NSTP 1 and NSTP 2 subjects within the same component (either CWTS or LTS). The student must present their Report of Grades (ROG) for both subjects, which are secured from the NSTP Subject records. The Director of the NSTP office is responsible for the issuance of this certificate. The entire process takes 30 minutes to complete and involves no fees.",
    "metadata": {
      "keywords": [
        "NSTP_Graduate",
        "CWTS",
        "LTS",
        "NSTP_2",
        "Certification_of_Graduation",
        "ROG"
      ]
    }
  },
  {
    "id": "nstp_issuance_serial_number_cwts_lts",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "National Service Training Program",
    "topic": "Issuance of Serial Number (CWTS and LTS)",
    "content": "Under the National Service Training Program at EARIST, a unique Serial Number is issued to students who have fully completed the NSTP program. This G2C transaction is available to external clients who have passed both NSTP 1 and NSTP 2 within the same component. To obtain the Serial Number, the student must present their Report of Grades (ROG) showing passing marks for both levels, secured from the NSTP Subject records. The Agency Action involves the official issuance of the Serial Number by the NSTP Director. This process is completed within a 30-minute timeframe and is provided at no cost to the student.",
    "metadata": {
      "keywords": [
        "NSTP_Serial_Number",
        "CWTS",
        "LTS",
        "NSTP_Completion",
        "ROG",
        "NSTP_Director"
      ]
    }
  },
  {
    "id": "srrms_enrollment_undergraduate_new_transferee",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Enrollment Procedure for New Students and Transferees (Undergraduate)",
    "content": "At the Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), the enrollment procedure for New Students and Transferees in the Undergraduate Program is a multi-stage process involving the Student Registration and Records Management Services (SRRMS) and respective Colleges. Classified as a Government to Citizen (G2C) transaction, this service facilitates the entry of external clients into the academic system. To begin, students must secure several requirements: the 'Approved and accomplished applications for admission' from the College Dean; 'Form 138' or 'Transcript of Records/Certification of Grades' from their previous school; and a 'Certificate of Good Moral Character' with a school dry seal. Transferees must also provide 'Transfer Credentials or Honorable Dismissal'. Freshmen who graduated in a different year than their application may need a certification that their F-137 was not forwarded to other SUCs. Other vital documents include a PSA-authenticated Birth Certificate, a Marriage Certificate for married females (from the PSA), and a 'Voluntary Opt-Out Form' from SRRMS for those choosing to pay tuition. The process starts with a qualifying exam (1 hour 30 mins) and a college interview conducted by the College Dean or Enrollment Officer. Accepted students then undergo medical processing at the Medical and Dental Services (1 hour, fee of 550.00). Next, students submit original credentials to the SRRMS Frontliners for a 5-minute verification; if incomplete, a promissory note is signed. Students may purchase an enrollment envelope at the IGP (25.00). The College Enrollment Officers then assist in subject enlisting, student number assignment, and scholarship tagging (10 minutes). Finally, the enrollment is validated; those opting out pay at the Cashier, and the Certificate of Registration (COR) is reflected on the student portal. The total estimated time is 3 hours and 15 minutes, excluding external factors like queues or connectivity.",
    "metadata": {
      "keywords": [
        "enrollment",
        "freshmen",
        "transferee",
        "undergraduate",
        "SRRMS",
        "admission_requirements",
        "COR"
      ]
    }
  },
  {
    "id": "srrms_enrollment_tcp_graduate_school",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Enrollment Procedure for New Students (TCP and GS)",
    "content": "Under the Student Registration and Records Management Services (SRRMS) at EARIST, the enrollment for the Teacher Certificate Program (TCP) and Graduate School (GS) is designed for new students and transferees. This G2C transaction requires students to first pass the EARIST-GAT or TCP Admission Test. Essential documents include 'Approved and accomplished applications for admission' (from the GS Dean), 'Transcript of Records' and 'Transfer Credential/Honorable Dismissal' (from the last school attended), a 'Certificate of Employment' (from the employer), and a PSA Marriage Certificate for married females. The procedure begins with the student obtaining an advisement slip from the GS or CED office. The Enrollment Officer then registers the student's subjects based on this slip (15 minutes). Following registration, the student proceeds to the Cashier's Office to pay the tuition fee (5 minutes, fee varies by units). Afterward, the student must visit the IGP to purchase an enrollment envelope (25.00) and then submit the original admission credentials and approved admission form to the SRRMS Frontliners for verification (5 minutes). If requirements are incomplete, the student must sign a promissory note. Once verified, the SRRMS prints and provides the Certificate of Registration (COR). The total processing time is approximately 25 minutes, though this can be extended by system issues or high student volume.",
    "metadata": {
      "keywords": [
        "Graduate_School",
        "TCP",
        "enrollment",
        "SRRMS",
        "advisement_slip",
        "GAT",
        "COR"
      ]
    }
  },
  {
    "id": "srrms_enrollment_continuing_regular_online",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Enrollment Procedure for Continuing Regular Student (Online)",
    "content": "The EARIST Student Registration and Records Management Services (SRRMS) provides a streamlined, user-friendly online enrollment method for continuing regular students. This G2C process allows students to select and enroll in courses through the institute's online portal. To participate, students must use their student number and password to log in and navigate to the enrollment section to select their subjects. If a student chooses to pay their tuition and other fees despite the free tuition policy, they must secure a 'Voluntary Opt-Out Form' from SRRMS and inform the College Dean prior to validation. Once the student submits their selection online, the College Dean or College Enrollment Officers perform the Enrolment Validation (5 minutes). They review the student's choices and ensure all prerequisites for the selected subjects are met. If discrepancies are found, the officer may reach out to the student for adjustments. Following successful validation by the enrollment officer, the system automatically generates the Certificate of Registration (COR), which is then reflected in the student portal (0 minutes). The entire administrative side of this transaction takes approximately 5 minutes, providing a highly efficient service for the student body, provided there are no internet connectivity or system issues.",
    "metadata": {
      "keywords": [
        "online_enrollment",
        "continuing_student",
        "regular_student",
        "SRRMS",
        "portal",
        "COR",
        "validation"
      ]
    }
  },
  {
    "id": "srrms_enrollment_irregular_returnee_onsite",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Enrollment Process for Continuing Irregular Student / Returnee",
    "content": "At EARIST, the enrollment process for continuing irregular students and returnees is handled on-site (face-to-face) to ensure proper evaluation of academic standing and institutional retention policies. This is classified as a 'Complex' transaction. Students must gather several requirements: an 'Academic Program Evaluation (APE)' from the Registrar's Office, an 'Advisement Slip' from their College, and their School ID. Returnees specifically need a 'Leave of Absence (LOA) Form' (student's copy) and a 'Return from Leave of Absence (RFLOA) Form' (registrar's copy). Those choosing to pay fees must secure a 'Voluntary Opt-Out Form' from SRRMS. The steps are as follows: 1) Apply for APE at the Registrar’s Office (5 minutes). 2) Pay the 40.00 fee at the Cashier (5 minutes). 3) Submit the receipt to SRRMS to receive a claim stub (5 minutes). 4) Internal Evaluators perform a grade evaluation to determine needed subjects (5 working days). 5) Once results are released by SRRMS Frontliners (5 minutes), the student goes to their College for subject enlisting and potential opt-out discussion (5 minutes). 6) The College Enrollment Officer validates the enrollment, reflecting the COR on the portal. 7) For those paying or returnees with fees, a visit to the Cashier is required (5 minutes). 8) Finally, the student visits the Registrar for ID validation where a sticker is affixed (5 minutes). The total time is 5 working days and 35 minutes.",
    "metadata": {
      "keywords": [
        "irregular_student",
        "returnee",
        "RFLOA",
        "APE",
        "academic_evaluation",
        "SRRMS",
        "ID_validation"
      ]
    }
  },
  {
    "id": "srrms_enrollment_shifters_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Enrollment Process for Shifters",
    "content": "Under the SRRMS at EARIST, the procedure for shifters facilitates the transition of students transferring to a different program or college within the institution. This G2C transaction requires the student to obtain an 'Academic Program Evaluation' from the Registrar's Office, a 'Shifter's Form' also from the Registrar, and a 'Voluntary Opt-Out Form' from SRRMS if applicable. The student begins by visiting the College to obtain the Shifter's Form, where the College Dean provides guidance (5 minutes). The student must have the form signed by both the previous and accepting Deans. Next, the student submits the accomplished form to the Registrar’s Office, where Frontliners verify signatures and update the student's program curriculum (5 minutes). The student then proceeds to their new college, where the Enrollment Officer assists in subject selection based on the APE (2 hours). During this step, the officer discusses the opt-out option and provides the form if chosen. The enrollment is then validated, and the Certificate of Registration (COR) is generated on the student portal. If fees are applicable, 40.00 is paid at the Cashier (5 minutes). The final step is visiting the Registrar for ID validation, where a sticker is affixed to the student ID (5 minutes). The total turnaround time is approximately 2 hours and 20 minutes, subject to office volume and connectivity.",
    "metadata": {
      "keywords": [
        "shifters",
        "curriculum_change",
        "SRRMS",
        "shifter_form",
        "APE",
        "enrollment",
        "ID_validation"
      ]
    }
  },
  {
    "id": "srrms_cross_enrollment_procedure",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Cross-Enrollment Procedure",
    "content": "The EARIST SRRMS manages the application for cross-enrollment, which is permitted when a specific course is not offered at the Institute, with a maximum limit of six (6) units. Currently enrolled students must prepare a 'Letter of Intent' (secured from the College Dean), their 'Certificate of Registration (COR)', 'EARIST School ID', and an 'Official Receipt' from the Cashier's Office. To start, the student presents the Letter of Intent (detailing the host school, subject, and schedule), COR, and ID to the SRRMS Frontliners for grade evaluation and issuance of a payment slip (2 minutes). The student then pays 120.00 at the Cashier's Office (3 minutes). The student returns the official receipt to the Registrar's Office, where they receive a claim stub while the request is forwarded to internal evaluators (3 minutes). Evaluators conduct a grade evaluation and issue the 'Permit to Cross-Enroll' in triplicate, which the College Dean then signs (3 minutes). Finally, the student submits the approved permit to the Registrar's Office for the Registrar's signature; the Frontliners then release two copies of the cross-enrollment form to the student (3 minutes). The total process takes approximately 14 minutes, focused on ensuring the student meets academic criteria for external study.",
    "metadata": {
      "keywords": [
        "cross-enrollment",
        "external_school",
        "SRRMS",
        "permit_to_cross-enroll",
        "units_limit",
        "letter_of_intent"
      ]
    }
  },
  {
    "id": "srrms_withdrawal_dropping_undergraduate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Withdrawal of Registration / Dropping of Subjects (Undergraduate)",
    "content": "At EARIST, undergraduate students wishing to discontinue their enrollment or drop specific subjects must follow a set procedure through the SRRMS. It is critical to note that 'Withdrawal of Registration' must be completed within two (2) weeks from the first day of regular classes, while 'Dropping Forms' must be completed before the scheduled Midterm Examination. Requirements include a 'Withdrawal Form' or 'Dropping Form' (from the Registrar's Office), a 'Letter of Intent' with a Parent's or Guardian's signature, and an 'Official Receipt' (from the Cashier's Office). The student first presents the Letter of Intent (with parent signature and Dean's approval) to the SRRMS Frontliners, who issue a payment slip (2 minutes). The student then pays a fee of 80.00 at the Cashier's Office (3 minutes). Upon presenting the receipt back to the Registrar, the Frontliner issues the specific form (Withdrawal Form if within 2 weeks of classes, or Dropping Form if before midterms) (1 minute). Once the student submits the accomplished form, SRRMS Evaluators finalize the withdrawal or drop in the system (2 minutes). The total process time is 8 minutes. This administrative process ensures that student records accurately reflect their current enrollment status and academic load.",
    "metadata": {
      "keywords": [
        "withdrawal",
        "dropping_subjects",
        "undergraduate",
        "SRRMS",
        "midterms",
        "deadlines"
      ]
    }
  },
  {
    "id": "srrms_withdrawal_dropping_graduate_school",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Withdrawal/Dropping for Graduate Programs and Non-R.A. 10931 Students",
    "content": "Graduate students and those not covered by R.A. 10931 at EARIST follow a specific 'Complex' transaction for withdrawing registration or dropping subjects. Withdrawal must happen within the first two weeks of classes, and dropping must occur before midterms. Needed documents include the 'Withdrawal/Dropping Form' from the Registrar, a 'School ID', a 'Letter of Intent', and an 'Official Receipt'. The student presents the Letter of Intent to the SRRMS Frontliners for a payment slip (2 minutes). They pay 80.00 at the Cashier (3 minutes) and return to the Registrar's Office. The Frontliner then issues the appropriate form (1 minute). A critical unique step for this group is that the form must be signed by all concerned faculty and the College Dean (2 minutes). Once fully signed, the student submits the form back to the Registrar's Office. After SRRMS processes the request, the student must proceed to the Accounting/FMS Office to process the refund of fees, as per the 2021 Student Handbook (2 minutes). The total administrative processing time is 10 minutes. This ensures academic records and financial accounts are synchronized after a student decides to discontinue a course or their entire program.",
    "metadata": {
      "keywords": [
        "Graduate_School",
        "withdrawal",
        "dropping",
        "refund",
        "SRRMS",
        "faculty_signature",
        "non-RA10931"
      ]
    }
  },
  {
    "id": "srrms_application_leave_of_absence",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Application for Leave of Absence (LOA)",
    "content": "The process for an Application for Leave of Absence (LOA) at EARIST is designed for students who need to temporarily separate from the Institute for non-academic and non-disciplinary reasons. The duration of the LOA typically does not exceed one academic year. To initiate the process, the student must prepare a 'Letter of Intent' with a Parent's or Guardian's signature, an 'EARIST School ID', and obtain an 'LOA Form' and 'Official Receipt'. The student first presents the Letter of Intent to the SRRMS Frontliners at the Registrar's Office, who verify the documents and issue a payment slip (2 minutes). The student then proceeds to the Cashier's Office to pay the fee of 80.00 (5 minutes). Finally, the student returns to the Registrar's Office to submit the accomplished LOA form, the Official Receipt, and their ID. The Frontliners receive these documents to finalize the leave status (3 minutes). The total processing time for this G2C transaction is 7 minutes. This ensures the student's slot and academic standing are preserved during their temporary absence from the institution.",
    "metadata": {
      "keywords": [
        "LOA",
        "leave_of_absence",
        "SRRMS",
        "temporary_separation",
        "parent_signature"
      ]
    }
  },
  {
    "id": "srrms_issuance_school_id_first_copy",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Issuance of School ID - First Copy",
    "content": "Under the SRRMS at EARIST, the issuance of the first copy of the School ID is a primary service for freshmen, ensuring they can access school facilities and verify their student status. This G2C transaction is free of charge for first-time freshmen. The only requirement is the 'Certificate of Registration (COR)', which can be secured from the Student Portal or SRRMS. To apply, the student fills out a school ID request form (either physically or via Google form), ensuring all personal information is accurate (2 minutes). The 'ID making in-charge' at SRRMS then processes the request and creates the school ID based on the submitted data. The actual printing of the School ID takes approximately 1 hour. Once printed, the ID making in-charge officially issues the ID to the student (2 minutes). The total processing time is 1 hour and 4 minutes. This service is essential for establishing the student's official identity within the EARIST academic community and is managed strictly to ensure data accuracy and security.",
    "metadata": {
      "keywords": [
        "School_ID",
        "freshmen",
        "SRRMS",
        "ID_printing",
        "COR",
        "first_copy"
      ]
    }
  },
  {
    "id": "srrms_reissuance_school_id",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Re-issuance of School ID - Update, Replacement, and Loss",
    "content": "For EARIST students requiring a new school ID due to damage, loss, or personal data updates (like a name change), the SRRMS provides a re-issuance service. Requirements include the 'Certificate of Registration', an 'Official Receipt' (from the Cashier), and depending on the reason, an 'Affidavit of Loss' (from a Notary Public), an 'ID Clearance', or a 'Personal Data Update Form' (both from SRRMS). The student first goes to the Registrar's Office to report the status and receives a payment slip and necessary forms (2 minutes). If the ID was lost, the Affidavit of Loss must be submitted. The student then pays a 200.00 fee at the Cashier's Office (5 minutes). After payment, the student submits the Update Form, Receipt, and other requirements back to the SRRMS 'ID making in-charge'. The printing of the new ID takes 1 hour. Finally, the ID is issued to the student (2 minutes). The total processing time is 1 hour and 9 minutes. This systematic process ensures that all identification cards in circulation are current and that lost cards are properly accounted for through official legal documentation.",
    "metadata": {
      "keywords": [
        "School_ID",
        "lost_ID",
        "replacement_ID",
        "affidavit_of_loss",
        "SRRMS",
        "ID_update"
      ]
    }
  },
  {
    "id": "srrms_final_evaluation_graduating_online",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Application for Final Evaluation of Graduating Students (Online)",
    "content": "The SRRMS at EARIST offers an online application process for the final evaluation of graduating students to determine their eligibility for the list of candidates for graduation. This G2C transaction is designed for convenience and focuses on verifying that a student has met all academic requirements. To start, the student fills out the Google link provided on the official Registrar's Page. No physical requirements are listed for the online submission phase. Once submitted, SRRMS Evaluators access the data and evaluate the grades of the applicants (5 minutes). Qualified students are then included in the official Graduating List. It is important to note that while the application is online, the results of the evaluation are released to the students on-site. This process ensures a thorough review of the student's academic standing before they are cleared for graduation. The total administrative time for the evaluation itself is 5 minutes, though the overall turnaround depends on the volume of applicants and the verification of academic records.",
    "metadata": {
      "keywords": [
        "graduating_students",
        "final_evaluation",
        "SRRMS",
        "online_application",
        "graduation_list",
        "academic_requirements"
      ]
    }
  },
  {
    "id": "srrms_final_evaluation_graduating_onsite",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Application for Final Evaluation of Graduating Students (Face-to-Face/Onsite)",
    "content": "For students who prefer or require an on-site process, the EARIST SRRMS provides a face-to-face application for the final evaluation of graduating students. The primary goal is to determine if the student has fulfilled all academic requirements to be included in the list of candidates for graduation. The student must bring their 'School ID' and secure an 'Application for Evaluation' form from the Registrar's Office. First, the student presents their ID to the SRRMS Frontliner, who then issues the application form (1 minute). The student accomplishes and submits the form back to the Frontliner. SRRMS Evaluators then review the student's records to confirm they are qualified (4 minutes). Upon successful evaluation, the student is included in the Graduating List. The final step involves the issuance of the 'Academic Program Evaluation' and the 'Application for Final Evaluation' results, which are released directly to the student (5 minutes). This G2C transaction takes a total of 10 minutes. This onsite method allows for immediate clarification regarding any missing requirements or academic discrepancies found during the evaluation process.",
    "metadata": {
      "keywords": [
        "graduating_students",
        "final_evaluation",
        "SRRMS",
        "onsite_evaluation",
        "academic_program_evaluation",
        "graduation_list"
      ]
    }
  },
  {
    "id": "srrms_application_for_graduation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Application for Graduation",
    "content": "The Application for Graduation at EARIST is the formal process for students who have met their academic requirements to officially apply for their degree. This G2C service requires an 'EARIST School ID' and a 'Graduation Fee Official Receipt' from the Cashier's Office. To begin, the student obtains the 'Application for Graduation' form from the Registrar’s Office (2 minutes). The student then proceeds to pay the graduation fees at the Cashier’s Office (5 minutes); the fee amount depends on the current approved rates. After payment, the student must have the application form duly signed by their subject Professor and the College Dean. The student then submits the fully accomplished application form and the official receipt back to the SRRMS. Evaluators check the completeness of the form and its attachments (5 minutes). Once verified, one copy is released back to the student as proof of application. The total estimated processing time is 12 minutes, excluding the time taken to secure faculty and dean signatures. This process is crucial for the timely and accurate inclusion of students in commencement exercises.",
    "metadata": {
      "keywords": [
        "graduation",
        "application_for_graduation",
        "SRRMS",
        "graduation_fee",
        "dean_signature",
        "commencement"
      ]
    }
  },
  {
    "id": "srrms_tor_automated_2011_present",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Processing of Transcript of Records (First Request, Automated Module - 2011 to Present)",
    "content": "Under the EARIST SRRMS, students with a student number from 2011 to the present can request their Transcript of Records (TOR) via the automated module. This 'Complex' G2C transaction is for employment, evaluation, or promotion purposes. Requirements include a 'Duly accomplished application form with Clearance' (from Registrar), 'School ID', and 'Official Receipt'. Representative requests need an 'Authorization Letter' and ID photocopies. Transferees must ensure their 'Transcript of Records (Copy for EARIST)' and 'F137' from their previous school are on file. The student first presents their ID to the SRRMS Frontliner, who issues a request slip and assesses fees (5 minutes). Fees are 100.00 per page, plus 25.00 for a security envelope; however, first-time job seekers among new graduates get the first copy for free. Payment is made at the Cashier (3 minutes). The student then submits the form and receipt to SRRMS, where Frontliners schedule the release and Evaluators process the TOR (5 working days). Finally, the student or representative claims the TOR (30 minutes). Total time: 5 working days and 38 minutes.",
    "metadata": {
      "keywords": [
        "TOR",
        "transcript_of_records",
        "SRRMS",
        "automated_module",
        "clearance",
        "first-time_job_seeker"
      ]
    }
  },
  {
    "id": "srrms_tor_manual_2010_below",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Processing of Transcript of Records (First Request, Manual Module - 2010 and Below)",
    "content": "For EARIST alumni with student numbers from 2010 and below, the SRRMS processes TOR requests using the manual module. This G2C transaction is 'Complex' due to the archival nature of the records. Requirements include the 'SARRMS Form-004 with Clearance', 'School ID', and an 'Official Receipt' from the Cashier. A 'Documentary Stamp' from the BIR is also required. Students must also ensure their previous school's TOR and F137 (Copy for EARIST) are submitted. The process starts with the student presenting their ID to the Frontliner for a request slip (5 minutes). Fees are assessed at 100.00 per page plus 25.00 for the security envelope. After paying at the Cashier (3 minutes), the student submits all documents to the Registrar's Office. Frontliners schedule the release and issue a claim stub, then forward files to Evaluators for manual processing (6 working days). The TOR is finalized by the Registrar and released to the student or authorized representative upon claiming (30 minutes). The total turnaround time is 6 working days and 38 minutes, reflecting the additional time needed for manual record retrieval.",
    "metadata": {
      "keywords": [
        "TOR",
        "manual_module",
        "alumni",
        "SRRMS",
        "transcript_of_records",
        "historical_records"
      ]
    }
  },
  {
    "id": "srrms_honorable_dismissal_transfer_credentials",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Issuance of Honorable Dismissal (HD) or Transfer Credentials",
    "content": "The SRRMS at EARIST handles the issuance of Honorable Dismissal (HD) and Transfer Credentials for students leaving the institution. This 'Complex' G2C process requires a 'Duly accomplished application form with Clearance', 'School ID', and an 'Official Receipt'. Students must also ensure their TOR and F137 from their previous school are in their EARIST file. A 'Documentary Stamp' from the BIR is required. The student starts by presenting their ID to the Frontliner, who issues a request slip and clearance (5 minutes). Fees are assessed as 100.00 per page for the TOR, and 80.00 for the Honorable Dismissal and Good Moral certification, plus 25.00 for the security envelope. After paying at the Cashier (3 minutes), the student submits the receipt and form to the Registrar. Frontliners schedule the release and issue a claim stub. Evaluators and the Registrar then process the documents via automated or manual modules (5 working days). Finally, the student or representative claims the documents (30 minutes). The total time is 5 working days and 38 minutes. This process ensures all academic and financial obligations are settled before the student is officially released from the Institute.",
    "metadata": {
      "keywords": [
        "honorable_dismissal",
        "transfer_credentials",
        "SRRMS",
        "clearance",
        "good_moral",
        "student_transfer"
      ]
    }
  },
  {
    "id": "srrms_certification_authentication_verification",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Request for Certification, Authentication, and Verification (CAV)",
    "content": "For students needing to certify or authenticate their academic records for local or overseas employment, the EARIST SRRMS provides Certification, Authentication, and Verification (CAV) services. This 'Complex' transaction requires the 'Original Document' to be certified, a 'School ID', and an 'Official Receipt'. To begin, the student presents their ID and original documents to the SRRMS Frontliner for verification and issuance of a payment slip (5 minutes). The student then proceeds to the Cashier's Office to pay the fee of 40.00 per copy (3 minutes). After payment, the student submits the original document, a photocopy, and the official receipt back to the Registrar's Office. The Frontliner then schedules the date of release and issues a claim stub (4 working days). During this period, the records are verified against institutional files for authenticity. Finally, the student or their authorized representative returns to claim the authenticated documents (30 minutes). The total processing time is 4 working days and 38 minutes. This service is essential for legal and professional purposes, ensuring that EARIST-issued documents are recognized by other agencies and employers.",
    "metadata": {
      "keywords": [
        "CAV",
        "authentication",
        "certification",
        "verification",
        "SRRMS",
        "employment_requirements",
        "legal_documents"
      ]
    }
  },
  {
    "id": "srrms_subject_crediting_equivalency",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services (SRRMS)",
    "topic": "Crediting of Subjects / Subject Equivalency",
    "content": "At EARIST, the SRRMS facilitates the crediting of subjects for transferees and subject equivalency for shifters to ensure prior learning is recognized. Requirements include the 'School ID', 'Official Receipt', and either a 'Crediting Form' (for transferees) or 'Subject Equivalency Form' (for shifters), plus an 'Original and Photocopy of TOR (Copy for EARIST)' and a 'Course Description' from the previous school. The student first submits the TOR in a sealed envelope and the Course Description to the Registrar's Office; the Frontliner opens the envelope and issues a payment slip (5 minutes). The student pays 40.00 per copy at the Cashier (3 minutes). The Frontliner then issues the Crediting or Equivalency form with the TOR attached. The student must then take this form to the College Chairperson and College Dean for signatures and subject matching (1 hour). Once signed, the student returns the form to the Registrar’s Office, where Evaluators check the form and the Registrar approves it for system entry. Finally, one copy is released to the student (10 minutes). Total processing time is 1 hour and 18 minutes. This ensures the student's academic progress is correctly mapped to their current EARIST curriculum.",
    "metadata": {
      "keywords": [
        "subject_crediting",
        "subject_equivalency",
        "transferees",
        "shifters",
        "SRRMS",
        "TOR",
        "curriculum_mapping"
      ]
    }
  },
  {
    "id": "earist_main_campus_office_directory_2025",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "List of Offices",
    "topic": "Comprehensive EARIST Main Campus Office Directory and Contact Information",
    "content": "Under the EARIST Citizen's Charter 2025 (1st Edition), the university maintains a comprehensive directory of offices located at the EARIST Main Campus in Nagtahan, Sampaloc, Manila. The Office of the President is located on the 2nd floor of the Administrative Building and can be contacted at 8-234-94-60 Local 101. The Office of Internal Audit Services is situated on the 2nd floor of the Old Science Building, reachable via 8-234-94-60 Local 121. The Office of the Planning Services is also located on the 2nd floor of the Old Science Building with contact number 8-234-94-60 Local 102. Administrative and academic support services located in various buildings include the Office of the Project Management Unit on the 2nd floor of the Apilado Building (Local 148), the Office of the Management Information Services on the 4th floor of the MIS Building (Local 136), and the Office of the Information and Public Affairs on the 2nd floor of the Administrative Building (Local 134). Intellectual property and digital services are managed through the Services and Intellectual Property office on the ground floor of the CIT Building (Local 144) and the Office of the Institute Web Services on the ground floor of the Nudas Building (Local 121). The Nudas Building also houses the Office of the International Affairs and Linkages Management Services on the ground floor (Local 130). The Office of the Business Development Center (Local 131) and the Office of the Vice President of Academic Affairs are positioned on the 2nd floor of the Old Science Building. The Office of the Library Services is found on the 2nd floor of the Library Building with contact number 8-234-94-60 Local 122. Research and administrative functions are also based in the MIS Building, with the Office of the Research Development (Local 117), the Office of the Administrative Services (Local 103), and the Office of the Records Management Services (Local 132) all located on the 3rd floor. The Apilado Building serves as a central hub for student and administrative services: the ground floor houses the Office of the Extension and Community Services (Local 115), the Office of the Quality Assurance Services (Local 105), the Office of the Student Registration and Records Management Services (Local 133), the Office of the Admission Services, and the Office of the Guidance, Counselling, and Testing Services (Local 145). Furthermore, the ground floor of the Apilado Building includes the Office of the Human Resource Management Services (Local 120), the Office of the Property Management Services (Local 130), the Office of the Procurement Services (Local 129), the Office of the Physical Plant and General Services, the Office of the Transportation and Motorpool Services (Local 137), the Office of the Cash and Disbursement Services (Local 106), the Office of the Medical and Dental Services (Local 124), and the Office of the Financial Management Services (Local 118). Additional key offices on the 2nd floor of the Library Building include the Office of the National Service Training Program (Local 146), the Office of the Vice President for Administrative and Finance (Local 104), and the Office of the Security Services (Local 150).",
    "keywords": [
      "EARIST",
      "Office Directory",
      "Contact Information",
      "Telephone Numbers",
      "Main Campus",
      "Administrative Building",
      "Apilado Building",
      "MIS Building",
      "Old Science Building",
      "Local Extensions"
    ]
  }
]