[
  {
    "id": "earist_charter_2025_pres_purchase_materials",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Purchase of Materials and Equipment",
    "content": "According to the EARIST Citizen's Charter 2025, the Office of the President manages the approval process for the purchase of items, materials, and equipment for use by the Office or College. This service is classified as a Simple transaction and is a Government to Government (G2G) type, available to Executive Officials, Faculty, and Employees (Internal Clients). \n\nThe required documents for this transaction include: an Endorsement Letter from the Dean or Director concerned, a Recommendation Letter from the Vice President concerned, and a photocopy of the Annual Procurement Plan (APP) reflecting the requested items for the Office or College. \n\nThe procedure involves two main steps: First, the client submits the required documents, which the Staff of the Office of the President checks for propriety and proper endorsements (15 minutes). Second, the Procurement Services Staff verifies if the requested item is included in the approved APP (15 minutes). The total processing time is 30 minutes, and there are no fees required.",
    "keywords": [
      "purchase",
      "equipment",
      "materials",
      "APP",
      "Annual Procurement Plan",
      "procurement",
      "G2G",
      "Office of the President"
    ]
  },
  {
    "id": "earist_charter_2025_pres_seminar_attendance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Attendance to Seminars and Conferences",
    "content": "The Office of the President provides approval for Executive Officials, Faculty, Employees, and Students to attend seminars and conferences. This service encompasses both Government to Government (G2G) and Government to Citizen (G2C) transaction types and is classified as Simple. \n\nApplicants must secure the following requirements: an Endorsement Letter from the Dean or Director, a Recommendation Letter from the Vice President, an Invitation with the attached Initial Request from the Organizer/Event Facilitator, a Certificate of Availability of Fund from the FMS Office, and a Recommendation for a Substitute (if applicable). \n\nThe process requires the client to submit these documents. The Staff of the Office of the President, FMS Office, and Staff of OVPAA check the endorsements (15 minutes). Subsequently, the Staff prepares the Office Order for Staff Development (15 minutes). The total processing time is 30 minutes with no fees to be paid.",
    "keywords": [
      "seminar",
      "conference",
      "travel order",
      "office order",
      "staff development",
      "substitute",
      "G2C",
      "G2G"
    ]
  },
  {
    "id": "earist_charter_2025_pres_budget_activities",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Budget for Activities (Seminars, Extension Activities)",
    "content": "The EARIST Office of the President oversees the approval for conducting seminars, extension activities, and similar events. This service is available to all internal clients and falls under G2G and G2C transaction types. \n\nTo avail of this service, the following documents are required: an Endorsement Letter from the Dean or Director, a Recommendation Letter from the Vice President, a Program of Activities from the Organizer, and both a Certificate of Availability of Funds and Eligibility/Classification of Expenditure from the FMS Office. \n\nThe workflow involves submitting the documents for endorsement checking by the Staff of the Office of the President and FMS Office (15 minutes), followed by the preparation of a Special Order (15 minutes). The total processing time is 30 minutes.",
    "keywords": [
      "budget",
      "extension activity",
      "seminar conduct",
      "special order",
      "funding",
      "FMS Office"
    ]
  },
  {
    "id": "earist_charter_2025_pres_financial_reimbursement",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Replenishment, Liquidation, and Reimbursement",
    "content": "The Office of the President handles approvals for the replenishment of petty cash, liquidation of seminars attended, and reimbursement of cash advances. This G2G service is available to Executive Officials, Faculty, and Employees. \n\nRequired documentation includes: a Letter Request with Recommendation endorsed by the Dean/Director and Vice President, Official Receipts, the Approved Initial Request, a Photocopy of the Special Order from the Office of the President, and a Photocopy of the conduct activity (e.g., Attendance Sheet) from the Organizer. \n\nThe client steps involve submitting the documents, which are first checked for proper endorsements (15 minutes) and then verified for supporting documents (15 minutes) by the Staff of the Office of the President. The total processing time is 30 minutes.",
    "keywords": [
      "petty cash",
      "liquidation",
      "reimbursement",
      "cash advance",
      "receipts",
      "financial"
    ]
  },
  {
    "id": "earist_charter_2025_pres_reinstatement",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Reinstatement of Faculty and Employees",
    "content": "The Office of the President processes approvals for the reinstatement of faculty and employees. This is a G2G transaction available to internal clients. \n\nThe checklist of requirements listed for this service includes: an Endorsement Letter, a Recommendation Letter, an Invitation with attached Initial Request, and a Certificate of Availability of Fund or Recommendation for Substitute (Note: The source text reflects requirements similar to seminar attendance, but these are legally listed under Reinstatement in the Charter). \n\nThe process involves submitting the required documents. The Executive Vice President and Staff of the HRMS Office are the persons responsible for checking endorsements and processing the request. The total processing time is indicated as 30 minutes.",
    "keywords": [
      "reinstatement",
      "HRMS",
      "faculty return",
      "employment status",
      "G2G"
    ]
  },
  {
    "id": "earist_charter_2025_pres_vehicle_facilities",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Use of Institute Vehicle and Facilities",
    "content": "The Office of the President grants approval for the use of EARIST vehicles and facilities. This service is a G2G transaction available to Executive Officials, Faculty, and Employees. \n\nApplicants must secure a Letter Request that is duly endorsed by the appropriate Official and a duly accomplished form from the Person Concern/College. Additionally, an accomplished or approved Trip Ticket must be secured from the Office of Administrative Services. \n\nThe procedure requires submitting the documents for endorsement checking by the Staff of the Office of the President. The Staff of Administrative Services is also responsible for this transaction. The total processing time is 30 minutes.",
    "keywords": [
      "vehicle",
      "facilities",
      "trip ticket",
      "transportation",
      "venue",
      "administrative services"
    ]
  },
  {
    "id": "earist_charter_2025_pres_retirement",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the President - Services",
    "topic": "Retirement of Faculty and Employees",
    "content": "The Office of the President approves the retirement of faculty and employees. This is a G2G transaction. \n\nThe requirements for retirement include a Letter Request duly endorsed by the appropriate Official and a duly accomplished form. Additionally, an accomplished General Clearance must be secured from the HRMS Office. \n\nThe client must submit the required documents for checking of endorsements. The persons responsible for this transaction are the Executive Vice President and the Staff of the HRMS Office. The total processing time is 30 minutes.",
    "keywords": [
      "retirement",
      "clearance",
      "HRMS",
      "resignation",
      "separation",
      "general clearance"
    ]
  },
  {
    "id": "president_office_change_official_time",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Change of Official Time (Service 8)",
    "content": "Under the Office of the EARIST President, the request for Change of Official Time is a simple Government to Government (G2G) transaction available to Executive Officials, Faculty, and Employees (Internal Clients). The primary service involves obtaining the approval of the President for the change of official time. The checklist of requirements includes a Letter Request duly endorsed by the appropriate Official and a duly accomplished form, which must be secured by the person concerned. To process this, the client must submit the required documents to the Staff at the Office of the President. The agency action involves checking for endorsement by the Dean or Director, and duly endorsed by the Vice President. The total processing time is 30 minutes, and there are no fees to be paid.",
    "keywords": [
      "Change of Official Time",
      "Office of the President",
      "Faculty schedule",
      "Employee schedule",
      "endorsement",
      "internal clients"
    ]
  },
  {
    "id": "president_office_refund_tuition",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Refund of Tuition Fees (Service 9)",
    "content": "The Refund of Tuition Fees is a simple Government to Citizen (G2C) transaction facilitated by the Office of the EARIST President for Students (External Clients). The service entails obtaining the approval of the President for the refund. Requirements include a Basic Request endorsed by the Dean and recommended by the Vice President (secured from Student and SAS Office) and a photocopy of the Certificate of Registration (COR) (secured from the SRRMS Office). The process requires the student to submit the required documents. The Staff at the Office of the President checks for endorsement by the Dean or Director and the recommendation of the Vice President. The total processing time is 30 minutes with no fees required.",
    "keywords": [
      "Refund of Tuition Fees",
      "tuition refund",
      "Office of the President",
      "student services",
      "COR",
      "financial refund"
    ]
  },
  {
    "id": "president_office_vouchers_processing",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Vouchers Processing (Service 10)",
    "content": "The processing of Vouchers is a Government to Government (G2G) transaction managed by the Office of the EARIST President for Executive Officials, Faculty, and Employees. This service provides the President's approval or signature on vouchers. The checklist of requirements includes: an Approved Request Resolution (from Client Concern), a Certificate of Availability of Funds (from FMS Office), a copy of the Special Order or Board Resolution (from Office of the President), and other supporting documents depending on the specific nature of the voucher. The documents must be initialed by the Director of the Internal Audit Service (IAS). The processing time is 30 minutes, involving a check for endorsements by the Dean or Director and the Vice President by the President's staff.",
    "keywords": [
      "Vouchers",
      "financial processing",
      "Office of the President",
      "Certificate of Availability of Funds",
      "IAS",
      "special order"
    ]
  },
  {
    "id": "president_office_payment_obligation_utilities",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Payment of Obligation - Gasoline and Utilities (Service 11)",
    "content": "Service 11 covers the Payment of Obligations, specifically for gasoline, electricity, and water consumption. This is a Government to Government (G2G) transaction for Faculty and Employees. It requires the President's approval for payment. The necessary documents are a Letter Request duly endorsed by the Dean or Director and recommended by the Vice President, and a Statement of Account duly checked by the Financial Management Services (FMS) and Internal Audit Service (IAS) Office. The client steps involve submitting the required documents to the Staff at the Office of the President, who checks for the endorsements by the Director of Administrative Services and the Vice President. The total processing time is 30 minutes.",
    "keywords": [
      "Payment of Obligation",
      "gasoline",
      "electricity bill",
      "water bill",
      "utilities payment",
      "Office of the President"
    ]
  },
  {
    "id": "president_office_lddap_checks_acic",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "LDDAP, Checks, and ACIC (Service 12)",
    "content": "The processing of LDDAP, Checks, and ACIC is a service available to all External and Internal Clients (G2G). It involves obtaining the approval or signature of the President. Required documents include the Approved Request Resolution, Certificate of Availability of Funds (from FMS Office), a copy of the Special Order or Board Resolution, and other supporting documents as needed. Before submission to the President's office, the documents must be initialed by the Director of the IAS Office. The Staff at the Office of the President checks for the completeness of signatories. The processing time is 30 minutes with no fees.",
    "keywords": [
      "LDDAP",
      "Checks",
      "ACIC",
      "financial instruments",
      "Office of the President",
      "signatories"
    ]
  },
  {
    "id": "president_office_clearances_documents",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Clearances, Leave Forms, and Academic Documents (Service 13)",
    "content": "Service 13 covers the approval and signature of the President for Clearances, Leave Forms, Class Programs, Diplomas, and Certificates. This service is available to Executive Officials, Faculty, Employees, and Students (G2G and G2C). The requirements involve securing signatures from various officials prior to the President, including: the concerned Dean or Director, the Supervisor, the Director of Administrative Services, Human Resources, the Office of the Vice President for Academic Affairs (VPAA), and the Registrar. The specific combination of signatures depends on the document type. The Staff at the Office of the President checks for the completeness of signatories. The total processing time is 30 minutes.",
    "keywords": [
      "Clearances",
      "Leave Forms",
      "Diplomas",
      "Class Programs",
      "Certificates",
      "Office of the President",
      "academic documents"
    ]
  },
  {
    "id": "president_office_purchase_order",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Purchase Order Processing (Service 14)",
    "content": "The Purchase Order service is a Government to Government (G2G) transaction for Executive Officials, Faculty, and Employees, involving the approval or signature of the President. The checklist of requirements includes: an Approved Request (from Client), Certificate of Availability of Funds (from FMS), Special Order (from President's Office), Abstract of Canvas (from BAC Office), BAC Resolution or Board Resolution (from BAC Office), and the signature of the end-user and the FMS Director. The process involves submitting documents for signature, checking for completeness of signatories by the President's Staff, and potentially the preparation of a Board Resolution by the College and Board Secretary. The total processing time is 30 minutes.",
    "keywords": [
      "Purchase Order",
      "procurement",
      "BAC Resolution",
      "Abstract of Canvas",
      "Office of the President",
      "Board Resolution"
    ]
  },
  {
    "id": "president_office_abstract_bids_award",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Abstract of Bids and Award of Contract (Services 15 & 16)",
    "content": "The Office of the President handles the Abstract of Bids (Service 15) and Award of Contract/Notice to Proceed (Service 16). These are G2G transactions for Executive Officials, Faculty, Employees, and Students. \n\nFor the **Abstract of Bids**, requirements include an initial request funded by FMS, BAC Resolution with supporting documents, and Board approval of the project. \n\nFor the **Award of Contract**, requirements are the BAC Resolution with supporting documents and Board approval. \n\nBoth services follow a similar workflow: submission of documents, checking for completeness of signatories by the Executive Vice President and Procurement Staff (15 minutes), and the preparation of a Board Resolution by the College and Board Secretary (15 minutes). The total processing time for each is 30 minutes.",
    "keywords": [
      "Abstract of Bids",
      "Award of Contract",
      "Notice to Proceed",
      "bidding",
      "procurement",
      "BAC",
      "Office of the President"
    ]
  },
  {
    "id": "president_office_moa",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Office of the EARIST President Services",
    "topic": "Memorandum of Agreement (MOA) (Service 17)",
    "content": "The processing of a Memorandum of Agreement (MOA) is a transaction available to both Government (G2G) and Citizens (G2C), including Executive Officials, Faculty, Employees, and Students. The service involves the President's approval and signature. Requirements include an initial request duly funded by the FMS, a BAC Resolution with supporting documents, and Board approval of the project or procurement. The workflow requires submitting documents for signature. The Executive Vice President and Staff check for completeness of signatories and proper endorsement (15 minutes). The College and Board Secretary then prepares the Board Resolution (15 minutes). The total processing time is 30 minutes.",
    "keywords": [
      "Memorandum of Agreement",
      "MOA",
      "partnerships",
      "legal agreement",
      "Office of the President",
      "Board Resolution"
    ]
  },
  {
    "id": "internal_audit_services_special_audit_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Internal Audit Services",
    "topic": "Special Audit (Assurance and Advisory)",
    "content": "Under Internal Audit Services, the Special Audit (Assurance and Advisory) is a Highly Technical Government to Government (G2G) transaction available exclusively to the President (Internal Client). This service is requested by the President whenever necessary and is intended to address current issues on governance, risk assessment, and control processes of the Institute. To avail of this service, a request letter from the President to conduct a special audit is required, which is secured from the Office of the President.",
    "keywords": [
      "Special Audit",
      "Internal Audit Services",
      "governance",
      "risk assessment",
      "control processes",
      "Presidential request"
    ]
  },
  {
    "id": "internal_audit_services_special_audit_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Internal Audit Services",
    "topic": "Special Audit Process and Timeline",
    "content": "The workflow for a Special Audit under Internal Audit Services spans a total processing time of 30 days, 9 hours, and 18 minutes. The process begins when the Internal Auditing Assistant receives and records the President's request letter (15 minutes). The IAS Director then evaluates the request and assigns the audit (2 hours). An Internal Auditing Assistant prepares the Audit Program for the Director's approval (4 hours). The IAS Director subsequently prepares and sends a Notice of Audit (2 hours). The appropriate auditing fieldwork is performed over 29 Working Days. Following fieldwork, the Audit Report is prepared and submitted to the Office of the President (1 Working Day and 3 minutes). Finally, the findings are discussed during an Exit Conference with the President, Auditee, IAS Director, and Internal Auditors (1 Hour).",
    "keywords": [
      "Special Audit workflow",
      "audit fieldwork",
      "audit report",
      "Exit Conference",
      "IAS Director",
      "Internal Auditing Assistant"
    ]
  },
  {
    "id": "internal_audit_services_request_records",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Internal Audit Services",
    "topic": "Request for Audit Records",
    "content": "The Request for Audit Records is a Simple Government to Government (G2G) transaction intended to address the specific needs of the Commission on Audit and heads of Offices, Units, or Colleges of the Institute (Internal and External Clients). The primary requirement is an approved request to obtain a copy of the audit report, secured from the Office of the President. The total processing time is 2 hours and 12 minutes. The process involves receiving and recording the approved request (3 minutes), forwarding it to the IAS Director (3 minutes), locating and reproducing the needed report (2 hours), recording the distribution (3 minutes), and sending the report to the recipient (3 minutes).",
    "keywords": [
      "Audit Records",
      "Commission on Audit",
      "audit report copy",
      "Internal Audit Services",
      "document request"
    ]
  },
  {
    "id": "planning_services_infrastructure_proposals",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Planning Services",
    "topic": "Infrastructure Project Proposals (Service 1)",
    "content": "Under Planning Services, the Planning Office provides assistance in the production of conceptual plans, designs, budgetary estimates, and other initial documents for infrastructure project proposals. This is a Complex Government to Government (G2G) transaction available to Internal Clients. The requirements include an approved request letter from the President, a sketch of ideas by the requesting party, a list of spatial requirements, and other reference documents. The workflow involves the President assigning the project to the Planning Director, who then directs the Project Management Unit (PMU). The PMU conducts ocular visits, interviews, and measurements (2 days) and prepares the plans and estimates (7 days). The total processing time is 15 Days and 15 Minutes.",
    "keywords": [
      "infrastructure proposals",
      "conceptual plans",
      "budgetary estimates",
      "Project Management Unit",
      "PMU",
      "Planning Director",
      "blueprints"
    ]
  },
  {
    "id": "planning_services_project_inspection",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Planning Services",
    "topic": "Project Inspection (Service 2)",
    "content": "The Planning Office conducts Project Inspection and Similar Activities to monitor ongoing projects of the Institute. This is a Complex Government to Government (G2G) transaction available to all units of the Institute. Requirements include an approved request letter from the President, reference documents for inspection, and an accepted schedule if coordinating with an outside agency (e.g., DPWH). The process entails the Planning Director assigning the task to the Project Management Unit (PMU), which performs the inspection or coordination. If external coordination is required, the PMU is allotted 3 days for that specific task. The total processing time is 5 Days and 15 Minutes.",
    "keywords": [
      "Project Inspection",
      "site visit",
      "construction monitoring",
      "DPWH coordination",
      "PMU",
      "ongoing projects"
    ]
  },
  {
    "id": "planning_services_dissemination_coa_reporting",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Planning Services",
    "topic": "Information Dissemination and COA Reporting (Services 3 & 4)",
    "content": "The Planning Office handles two specific reporting and dissemination services. First, the Dissemination of Information (Service 3) involves sharing status updates, requirements, and deadlines regarding physical accomplishments and government programs to respective offices via email. This takes 1 Day. Second, the Submission of Quarterly Report of the Status of Government Projects to COA (Service 4) informs the Commission on Audit about the Institute's projects. This G2G transaction requires the status of government programs from the PMU. The Director of Planning Services prepares and signs the communication, which is then submitted to COA. The processing time for the COA report is 35 minutes.",
    "keywords": [
      "Information Dissemination",
      "COA Report",
      "Commission on Audit",
      "government projects status",
      "physical accomplishment"
    ]
  },
  {
    "id": "planning_services_dbm_physical_accomplishments",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Planning Services",
    "topic": "DBM Physical Accomplishment Reports (Service 5)",
    "content": "The Planning Office coordinates the Submission of Quarterly, Semi-Annual, and Annual Reports of the Status of the Institute's Physical Accomplishments to the Department of Budget and Management (DBM). This Simple G2G transaction uses the Unified Report System (URS). The process requires gathering specific data signatures: Licensure Examination Reports (Planning Services), Enrolment Data (SRRMS), Accreditation Status (Quality Assurance), Research Programs (Research & Development), Extension Projects (Extension Services), and Graduate Performance in Research (Graduate School). The Planning Director consolidates this data, encodes it into the system (1 Day), and submits it. The total processing time is 2 Days and 35 Minutes.",
    "keywords": [
      "DBM Report",
      "Physical Accomplishment",
      "Unified Report System",
      "URS",
      "enrolment data",
      "accreditation status",
      "research status"
    ]
  },
  {
    "id": "planning_services_pbb_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Planning Services",
    "topic": "Annual PBB Requirements Submission (Service 6)",
    "content": "The Planning Office facilitates the Submission of the Annual Performance-Based Bonus (PBB) Requirements to the AO25 Secretariat. This Complex G2G transaction ensures compliance for PBB incentives. The requirements span multiple areas: Physical Accomplishment and Client Satisfaction (Planning Services), Transparency Seal and PhilGeps (InfoPAS/Procurement), QMS Certification (Quality Assurance), Financial Reports and Budget Utilization (FMS/IAS/Procurement), and Agency SALN Review (HRMS). The process involves receiving signed forms, reviewing documents, reproducing copies (5 Days), preparing the communication, and submitting it to the AO25 Secretariat. The total processing time is 9 Days and 20 Minutes.",
    "keywords": [
      "PBB",
      "Performance-Based Bonus",
      "AO25 Secretariat",
      "Transparency Seal",
      "QMS Certification",
      "SALN Review",
      "Physical Accomplishment"
    ]
  },
  {
    "id": "legal_unit_student_moa_review",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Review of Memorandum of Agreement (Students)",
    "content": "Under the Institute Legal Unit, the Review of Memorandum of Agreement (MOA) for students is a Highly-Technical Government to Citizen (G2C) transaction. The Legal Unit ensures that all MOAs entered into by students with other entities comply with the law and Institute Policies. The process involves one round of review; if the external entity requires revisions, the processing time resets. Requirements include the draft MOA, supporting documents, an endorsement letter from the Dean, and a soft copy sent to the Legal Office email. The total processing time is approximately 19 Working Days, 1 Hour, and 54 Minutes, which includes review by Legal Counsel, revision, and final approval by the Office of the President.",
    "keywords": [
      "Memorandum of Agreement",
      "MOA review",
      "student agreement",
      "Legal Unit",
      "contract review",
      "endorsement"
    ]
  },
  {
    "id": "legal_unit_student_legal_opinion",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Legal Opinion for Students",
    "content": "The Institute Legal Unit provides Legal Opinions to students as a Highly-Technical Government to Citizen (G2C) transaction. A legal opinion is a formal analysis of a legal situation, applicable laws, and suggested solutions regarding matters concerning the Institute. Students must submit a request letter containing the query and pertinent documents. The workflow involves the Legal Counsel assigning the request, drafting by a Legal Assistant, review, and final approval by the Office of the President. The total processing time is approximately 17 Working Days, 1 Hour, and 25 Minutes.",
    "keywords": [
      "Legal Opinion",
      "student legal query",
      "legal analysis",
      "Legal Counsel",
      "Office of the President"
    ]
  },
  {
    "id": "legal_unit_employee_legal_opinion",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Legal Opinion for Employees and Faculty",
    "content": "The Institute Legal Unit offers Legal Opinions to Administrative Employees, Faculty Members, Colleges, and Offices (G2G). This Highly-Technical service addresses legal matters concerning the Institute. The requirements include a request letter and pertinent documents. The process follows a strict timeline: drafting by a Legal Assistant, review by Legal Counsel (including potential revisions), and transmission to the Office of the President for approval. The total processing time is 19 Working Days and 39 Minutes.",
    "keywords": [
      "Legal Opinion",
      "Faculty legal advice",
      "Administrative Employees",
      "legal query",
      "internal legal counsel"
    ]
  },
  {
    "id": "legal_unit_moa_contracts_internal",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Review of MOA and Contracts (Colleges and Offices)",
    "content": "The Legal Unit reviews Memorandum of Agreements (MOA) and Contracts for Colleges and Offices as a Government to Government (G2G) transaction. A Contract is defined under Article 1405 of the Civil Code as a meeting of minds where one binds himself to give something or render service. The Legal Unit ensures these documents comply with Institute Policies. Requirements include the draft, supporting documents, and an endorsement from the Dean or Head of Office. The process involves evaluation, registration, assignment to Legal Counsel, drafting/reviewing, and final approval by the President. The total processing time is 19 Working Days, 1 Hour, and 54 Minutes.",
    "keywords": [
      "MOA review",
      "Contract review",
      "Civil Code Article 1405",
      "internal agreement",
      "College contracts",
      "Legal Unit"
    ]
  },
  {
    "id": "legal_unit_drafting_letter_response",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Drafting of Letter Response",
    "content": "The Drafting of Letter Response is a service where the Legal Unit handles outgoing correspondences requiring legal input to ensure consistency with legal standards. This Highly-Technical G2G service is available to Administrative Employees and Faculty Members. The client must submit a request letter and pertinent supporting documents. The Legal Counsel may draft the response personally or assign it to a Legal Assistant. The process includes drafting, review, revision, and final approval by the Office of the President. The total processing time is 17 Working Days and 39 Minutes.",
    "keywords": [
      "Letter Response",
      "legal correspondence",
      "drafting",
      "legal input",
      "outgoing mail",
      "due diligence"
    ]
  },
  {
    "id": "legal_unit_procurement_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Legal Services on Procurement",
    "content": "The Legal Unit provides specialized legal services to Chairpersons and Members of the Bids and Awards Committee (BAC), Special Committees, and Technical Working Groups (TWG). This G2G transaction supports procurement processes and committee functions. Upon submission of a request letter and supporting documents, the Legal Counsel or Legal Assistant drafts a legal opinion or clarification. The process includes multiple levels of review and final approval by the Office of the President. The total processing time is 19 Working Days and 39 Minutes.",
    "keywords": [
      "Procurement Law",
      "BAC",
      "Bids and Awards Committee",
      "Technical Working Group",
      "TWG",
      "legal clarification"
    ]
  },
  {
    "id": "legal_unit_admin_cases_disposition",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Disposition of Ordinary Administrative Cases",
    "content": "The Disposition of Ordinary Administrative Cases involves the adjudication of cases against Administrative Employees and Faculty Members. This service is governed by the 2017 Rules on Administrative Cases in the Civil Service (RACCS) and is explicitly exempted from the standard processing times of R.A. 11032 (Ease of Doing Business Act). The Legal Unit reviews the Resolution of the case drafted by Human Resources and sends it back. The processing time is 30 Working Days from the date the case is submitted for resolution.",
    "keywords": [
      "Administrative Cases",
      "RACCS 2017",
      "disciplinary action",
      "faculty discipline",
      "employee discipline",
      "legal resolution"
    ]
  },
  {
    "id": "legal_unit_sexual_harassment_codi",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Institute Legal Unit",
    "topic": "Disposition of Sexual Harassment Cases (CODI)",
    "content": "The Disposition of Sexual Harassment Cases is handled by the Committee on Decorum and Investigation (CODI), chaired by the Chief Legal Counsel. This service covers Administrative Employees, Faculty Members, and Students. It is governed by the CODI Manual, 2017 RACCS, and CSC Resolution No. 01-0940. Like ordinary administrative cases, this process is exempted from R.A. 11032. The Legal Office receives complaints, transmits them to CODI, and writes the Resolution once the case is submitted. The standard processing time for the resolution phase is 30 Working Days.",
    "keywords": [
      "Sexual Harassment",
      "CODI",
      "Committee on Decorum and Investigation",
      "CSC Resolution 01-0940",
      "disciplinary rules",
      "Chief Legal Counsel"
    ]
  },
  {
    "id": "pmu_institute_initiated_projects",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Project Management Unit",
    "topic": "Institute Initiated Project Proposals (Service 1)",
    "content": "Under the Project Management Unit (PMU), the Institute Initiated Project Proposals service provides technical drawings aligned with the Architectural and Engineering (A&E) Master Development Plan. This Highly Technical Government to Government (G2G) service is available to the EARIST Administration. The process begins with a direct instruction from the President. The PMU Technical Staff receives the instruction and conducts an interview with the end-user (1 day each). An ocular inspection of the site follows (1 day). The PMU then collaborates to create a Conceptual Plan (21 days), which the requesting party reviews (7 days). Upon approval, the PMU formulates the final design, Scope of Work (SOW), and Budgetary Estimate (21 days). After a final review by the PMU Director (3 days) and submission (1 day), the Institute President gives final approval (3 days). The total processing time is 60 working days.",
    "keywords": [
      "Institute Initiated Project",
      "Architectural and Engineering Master Plan",
      "Conceptual Plan",
      "Scope of Work",
      "Budgetary Estimate",
      "PMU"
    ]
  },
  {
    "id": "pmu_end_user_initiated_projects",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Project Management Unit",
    "topic": "End-Users Initiated Project Proposals (Service 2)",
    "content": "The Project Management Unit (PMU) offers the End-Users Initiated Project Proposals service to various EARIST offices and colleges. This Highly Technical G2G service generates technical drawings, Scopes of Work, and Bills of Quantities initiated by departments. A key requirement is an Approved Letter by the President addressed to the PMU. The workflow involves receiving the endorsed request and interviewing the end-user (1 day each). The PMU conducts an ocular inspection (1 day) and creates a Conceptual Plan (21 days). The requesting party reviews the initial design (7 days). Once the concept is returned and approved, the PMU prepares the final Scope of Work, Budget Costing, and Final Plans (21 days). Following a final review by the PMU Director (3 days) and submission (1 day), the Institute President grants final approval (3 days). The total processing time is 60 working days.",
    "keywords": [
      "End-User Projects",
      "College Projects",
      "Bill of Quantities",
      "Technical Drawings",
      "PMU",
      "Ocular Inspection"
    ]
  },
  {
    "id": "pmu_assistance_bac",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Project Management Unit",
    "topic": "Assistance to the Bids and Awards Committee (Service 3)",
    "content": "As a Technical Working Group (TWG), the Project Management Unit (PMU) provides Assistance to the Bids and Awards Committee (BAC) for infrastructure projects. This Highly Technical G2G service involves preparing technical drawings, Scopes of Work, and Bills of Quantities for bidding. The service requires an Approved Letter by the President. The process begins with the PMU receiving instructions to submit technical documents (1 day). The staff prepares and checks all required technical documents (21 days), followed by a review by the PMU Director (3 days). The documents are submitted to the end-user (1 day) for their final review (3 days). Finally, the documents are submitted to the President (1 day). The total processing time is 30 working days.",
    "keywords": [
      "Bids and Awards Committee",
      "BAC Assistance",
      "Technical Working Group",
      "TWG",
      "Infrastructure Bidding",
      "PMU"
    ]
  },
  {
    "id": "pmu_assistance_monitoring_officer",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Project Management Unit",
    "topic": "Assistance to Project Monitoring Officer (Service 4)",
    "content": "The Project Management Unit (PMU) provides Assistance to the Project Monitoring Officer as part of the Project Monitoring Team. This Highly Technical G2G service assists Administrative Services in monitoring, inspecting, and preparing reports for ongoing infrastructure projects. The requirement is an Approved Letter by the President. The process starts with receiving the request for assistance (1 day). The PMU Technical Staff provides the necessary assistance, such as project inspections and report preparation (21 days). The PMU Director conducts a final review of the documents (3 days), followed by submission to the President (1 day). The total processing time is 26 working days.",
    "keywords": [
      "Project Monitoring",
      "Infrastructure Inspection",
      "Project Monitoring Team",
      "Site Inspection",
      "PMU Reports"
    ]
  },
  {
    "id": "mis_institute_email_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Management Information Services",
    "topic": "Institute Email (Service 1)",
    "content": "Under Management Information Services (MIS), the Institute Email service is provided to staff to assist them in carrying out duties efficiently and to prevent illegal or inappropriate use of email. This service enables effective communication with staff, students, and external partners. It is classified as a Simple transaction available to all Internal and External Clients (G2C and G2G). The requirements include filling up an Access/Request Form and submitting it to the MIS Office. The process involves the Head Unit receiving the form (5 minutes), the Director of MIS evaluating and approving the form (15 minutes), and the Head Unit for User, System Support, and Security adding the requesting party to the institute's email system (15 minutes). The total processing time is 35 minutes.",
    "keywords": [
      "Institute Email",
      "MIS",
      "email account creation",
      "official email",
      "communication policy"
    ]
  },
  {
    "id": "mis_internet_network_connection",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Management Information Services",
    "topic": "Request for Internet/Network Connection (Service 2)",
    "content": "Under Management Information Services (MIS), the Request for Internet/Network Connection is a Simple Government to Government (G2G) transaction available to Executive Officials, Faculty, and Employees. This service facilitates access to the World Wide Web and external communication. To avail of this service, the requesting party must submit a letter request from the requesting Office Head, duly approved by the Director of MIS, and fill up an Access/Request Form. The workflow begins with the Head Unit receiving the submitted form (15 minutes). Subsequently, the Director of MIS evaluates the location and approves the type of connection to be installed upon identification of available service (5 Days). The document lists the total processing time as 35 minutes.",
    "keywords": [
      "Internet Connection",
      "Network Access",
      "MIS",
      "connectivity request",
      "web access"
    ]
  },
  {
    "id": "mis_campus_information_system_access",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Management Information Services",
    "topic": "Request for Access to Campus Information System (Service 3)",
    "content": "Under Management Information Services (MIS), the Request for Access to Campus Information System grants users sufficient rights to perform their job functions while keeping user rights to a minimum. This Simple Government to Citizen (G2C) transaction is available to Executive Officials, Faculty, and Employees. The process requires a letter request to the Head of Office for recommendation to the MIS Director, along with a completed Access/Request Form. The Head Unit receives the form (5 minutes), and the Director of MIS processes and approves the request based on needs (10 minutes). Once approved, the Head Unit for User, System Support, and Security adds the account as requested (10 minutes). The total processing time is 25 minutes.",
    "keywords": [
      "Campus Information System",
      "system access",
      "user rights",
      "account creation",
      "MIS security"
    ]
  },
  {
    "id": "mis_it_resources_request",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Management Information Services",
    "topic": "Request for IT Resources (Service 4)",
    "content": "Under Management Information Services (MIS), the Request for IT Resources ensures the quality, prompt, and efficient delivery of IT equipment (such as desktops, laptops, and printers) to be purchased. This Simple Government to Citizen (G2C) transaction is available to Executive Officials, Faculty, and Employees. The requesting party must identify the IT equipment for Quality Assurance (QA) and submit the request to the Head of IT equipment for recommendation to the MIS Director. The process involves the Head Unit receiving the submitted form (5 minutes). The Director of MIS then evaluates the request and determines the IT equipment to be purchased depending on the Office's need (3 Days). The total processing time is 3 Days and 5 Minutes.",
    "keywords": [
      "IT Resources",
      "IT equipment purchase",
      "desktop request",
      "laptop request",
      "printer request",
      "MIS evaluation"
    ]
  },
  {
    "id": "web_dev_services_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Web Development Services",
    "topic": "EARIST Official Website Service",
    "content": "Under Web Development Services, the management of the EARIST Official Website involves posting events, news, updates, and important announcements. This service is classified as Simple and encompasses both Government to Citizen (G2C) and Government to Government (G2G) transactions. It is available to the public, including internal and external clients. The Chief and Staff of Web Development Services are responsible for executing these updates. The total processing time is calculated at 60 minutes, which represents the aggregate time for processing multiple types of updates.",
    "keywords": [
      "EARIST Website",
      "Web Development Services",
      "news updates",
      "transparency seal",
      "public announcements"
    ]
  },
  {
    "id": "web_dev_posting_requirements_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Web Development Services",
    "topic": "Website Posting Requirements and Process",
    "content": "To post content on the EARIST Official Website, specific internal units must submit the required documents to Web Development Services. \n1. **News and Announcements:** Secured from Human Resource Management Services.\n2. **Financial Documents (Transparency Seal):** Secured from Financial Management Services.\n3. **BAC Documents (Transparency Seal):** Secured from Procurement Services.\n4. **Other Information:** Secured from Information Property and Public Affairs Services or Intellectual Property Management.\n\nThe workflow for each category involves the respective client unit submitting the documents, followed by the Web Development Services staff posting the content. Each specific posting activity is allotted a processing time of 15 minutes.",
    "keywords": [
      "Website Posting",
      "Transparency Seal",
      "BAC Documents",
      "Financial Documents",
      "HR Announcements",
      "Web Development Workflow"
    ]
  },
  {
    "id": "infopas_foi_overview_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Information and Public Affairs Services",
    "topic": "Freedom of Information (FOI) Request Overview",
    "content": "Under Information and Public Affairs Services, the Freedom of Information (FOI) Request for Information is a Highly Technical Government to Citizen (G2C) transaction available to the general public (Internal and External). This service functions under Executive Order No. 2, Series of 2016, ensuring every client has access to information, official records, public records, and documents pertaining to official acts, transactions, or decisions. To avail of this service, clients must present a Government Issued Identification Card. Acceptable forms of ID include those issued by the DFA, LTO, SSS, PhilHealth, BIR, Postal Office, NBI, PRC, OWWA, Municipal Office, PSA, PDAO, City Municipal Health Office, or the Office of the Mayor. Additionally, the client must complete the FOI Request Form, which is secured directly from the Information and Public Affairs Services office.",
    "keywords": [
      "Freedom of Information",
      "FOI Request",
      "Executive Order No. 2",
      "public records access",
      "InfoPAS",
      "valid ID requirements"
    ]
  },
  {
    "id": "infopas_foi_process_timeline",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Information and Public Affairs Services",
    "topic": "FOI Request Process and Timeline",
    "content": "The processing workflow for an FOI Request under Information and Public Affairs Services has a total duration of 14 Days and 25 Minutes. The process starts with the client signing the logbook and filling out the FOI Request Form (5 minutes each). The FOI Receiving Officer then screens and clarifies the request (10 minutes) and forwards it to the FOI Decision Maker (FDM) (1 Day). The FDM assesses the request for approval or denial within 3 Days. Following approval, the preparation of requested documents takes 5 Days for simple requests or up to 10 Days for complex requests. The final step involves the issuance of the requested documents to the client (5 minutes).",
    "keywords": [
      "FOI workflow",
      "FOI Decision Maker",
      "FDM",
      "FOI Receiving Officer",
      "document preparation time",
      "complex request"
    ]
  },
  {
    "id": "ipmo_itso_registration_assistance_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Intellectual Property Management Office",
    "topic": "Request for Assistance on IP Registration (Overview)",
    "content": "Under the Intellectual Property Management Office - Innovation Technology Support Office (IPMO-ITSO), the Request for Assistance on Intellectual Property Registration is a Highly Technical Government to Citizen (G2C) transaction. This service assists with registering research or creative outputs of Faculty, Staff, and Students to the Intellectual Property Office of the Philippines (IPOPHL). The checklist of requirements includes: an Electronic and one Printed Copy of the IPMO-ITSO Invention Disclosure Form (for Patent/Utility Model/Industrial Design), a Notarized Deed of Assignment, a Notarized Student-Faculty Research Agreement (if applicable), and Screenshots or Pictures of the creation or artwork for copyright application. Draft forms are available at the IPMO.",
    "keywords": [
      "Intellectual Property Registration",
      "IPMO",
      "ITSO",
      "Patent Application",
      "Copyright Application",
      "Invention Disclosure Form",
      "IPOPHL"
    ]
  },
  {
    "id": "ipmo_itso_registration_process_timeline",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Intellectual Property Management Office",
    "topic": "IP Registration Process and Timeline",
    "content": "The workflow for Intellectual Property Registration assistance involves multiple technical steps managed by the IPMO Staff and Director. The process begins with the client submitting documents for screening and evaluation (10 Minutes). The Staff then prepares a Prior Art Search Report (7 Days per application), which is checked by the Director (3 Days). The Director facilitates the application fee payment and drafts documents for IP Specification submission to IPOPHL (10 Days). If revisions are needed based on a formality report, the Director evaluates the revision (5 Days) and resubmits the IP Specification (5 Days). Finally, the Certificate of IP Registration is released to the client (10 Minutes). The total processing time listed for this service is 24 Days and 25 Minutes.",
    "keywords": [
      "Prior Art Search",
      "IP Specification",
      "IPMO workflow",
      "Patent filing timeline",
      "Formality report",
      "Certificate of IP Registration"
    ]
  },
  {
    "id": "ialms_international_internship_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "International Affairs and Linkages",
    "topic": "International Internship (Requirements)",
    "content": "Under International Affairs and Linkages Management Services (IALMS), the International Internship is a Highly Technical Government to Citizen (G2C) transaction available to Students. To apply, students must provide a College Grade Evaluation Form and an Endorsement Letter from College Services. Additional requirements include a Parents Waiver, an Invitation Letter from the Host Country (provided by the Organizer), a College Endorsement signed by the Program Chair, Practicum Coordinator, and Dean, a Curriculum Vitae, and a valid Passport.",
    "keywords": [
      "International Internship",
      "IALMS",
      "student exchange",
      "OJT abroad",
      "host country invitation",
      "parents waiver"
    ]
  },
  {
    "id": "ialms_international_internship_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "International Affairs and Linkages",
    "topic": "International Internship (Process & Timeline)",
    "content": "The processing workflow for the International Internship is extensive, totaling approximately 5 Months and 23 Days. The process begins with the College Grade Evaluation (7 Days) and document checking by the IALMS Director. Once the student secures the College Endorsement (1 Day) and informs their parents, the IALMS informs the college of open programs (7 Days). The student undergoes screening (7 Days) and a Final Interview via Skype or face-to-face with the Foreign Host (7 Days). Successful candidates attend a Pre-Departure Orientation Seminar (PDOS) (7 Days). The application then requires Board of Trustee (BOT) approval (3 Days) and subsequent approval from the CHED Office of Student Development Services (3 Months). Finally, the student secures clearance (1 Month).",
    "keywords": [
      "Internship Timeline",
      "CHED approval",
      "PDOS",
      "Board of Trustees",
      "internship interview",
      "screening process"
    ]
  },
  {
    "id": "ialms_student_mobility_outbound",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "International Affairs and Linkages",
    "topic": "Student Mobility (Outbound & Exchange)",
    "content": "IALMS facilitates Student Mobility (Temporary Mobility), specifically Outbound Cross International Study and Outbound Exchange. This is a Highly Technical G2C transaction. For Cross International Study, students must apply with relevant documents and obtain approval from the Program Chair, Dean, and Registrar. Approval is granted only for specific subjects and institutions; substitution is not allowed without permission. Special circumstances for approval include relocation, compassionate reasons, or if a subject is unavailable at the Institute. The processing time for assisting and processing eligibility is 3 Days, while the application approval takes 1 Day. For Outbound Exchange eligibility and participation approval, the processing time is 10 Days. The total processing time for student mobility is 20 Days.",
    "keywords": [
      "Student Mobility",
      "Outbound Exchange",
      "Cross International Study",
      "study abroad",
      "subject substitution"
    ]
  },
  {
    "id": "ialms_faculty_mobility_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "International Affairs and Linkages",
    "topic": "Faculty Mobility (Scholarship, Research, Teaching)",
    "content": "IALMS manages Faculty Mobility for Scholarships, Research Presentations, and Invitations to Teach. These are Highly Technical G2C transactions available to Faculty. \n\n1. **Scholarship to Study:** Requires an Invitation to Study, Endorsements from the College and Human Resource Services, and approval from the President/BOT.\n2. **Research Presentation:** Requires an Invitation, Endorsement from the Director of Research, and final approval.\n3. **Invitation to Teach:** Requires an Invitation to Teach, Endorsement from the College, and final approval.\n\nFor all three categories, the agency action involves assisting and processing documents through the IALMS Staff, HRMS Chief, FMS Director, and VPAA. The standard processing time for each category is 3 Months.",
    "keywords": [
      "Faculty Mobility",
      "Faculty Scholarship",
      "Research Presentation abroad",
      "Visiting Professor",
      "Invitation to Teach"
    ]
  },
  {
    "id": "bdc_canteen_clearance_service",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Request for Issuance of Canteen Clearance",
    "content": "Under the Business Development Center (BDC) services described in the EARIST Citizen's Charter 2025, the Request for Issuance of Canteen Clearance is a service designed for various canteen concessionaires. The purpose of this clearance is to fulfill a requirement for the renewal of the contract of lease, certifying that the tenant has no outstanding balance. This is classified as a Simple G2C (Government to Citizen) transaction. The required documents include the original copy of the latest Billing or Statement of Accounts and original or photocopy of official receipts. The interested party must secure these documents personally. The process involves submitting documents for verification by BDC staff, preparation of the certificate, and approval by the BDC Director. There are no fees associated with this specific clearance. The total processing time is approximately 25 minutes.",
    "keywords": [
      "Canteen Clearance",
      "Lease Renewal",
      "No Outstanding Balance",
      "Concessionaires",
      "BDC",
      "Billing Statement"
    ]
  },
  {
    "id": "bdc_facility_rental_requirements_and_fees",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Rental of Institute Facilities - Requirements and Fees",
    "content": "The EARIST Citizen's Charter 2025 outlines the procedures for the Rental of the Institute's Facilities under the Business Development Center. This service allows student organizations, faculty, employees, and private companies or individuals (both internal and external) to conduct activities or events within school premises. The transaction is classified as Simple and covers both G2C and G2G types. Requirements include a Letter of Intent stating the schedule of the activity. The rental fee is set at 1,000 PHP per day, though the final amount depends on the number of days requested. Payments are processed through the Cash and Disbursement Services after securing an Order of Payment from the BDC. The venues managed include the Amphitheater (managed by Ferdinand Alvaro), the CEAFA Quad (managed by Engr. Jorge Bautista), and the Main Quad (managed by Pedro Rommel Kirong).",
    "keywords": [
      "Facility Rental",
      "Venue Booking",
      "Amphitheater",
      "CEAFA Quad",
      "Main Quad",
      "Rental Fees",
      "Letter of Intent"
    ]
  },
  {
    "id": "bdc_facility_rental_process_flow",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Rental of Institute Facilities - Process Flow",
    "content": "The process for renting EARIST facilities involves several steps managed by the Business Development Center (BDC) and related offices. First, the client submits a letter of intent, which the BDC receives and evaluates based on venue availability. If available, the client accomplishes an Application Form. This form requires signatures from the specific In-Charge of the Venue (Alvaro, Bautista, or Kirong) and the BDC Director. Subsequently, the client secures an Order of Payment, pays the rental fee at the Cashier, and the BDC Director endorses the request to the Administrative Services Office and the Institute President. The final step is the confirmation of the schedule and the release of the approved application form to the venue in-charge. The total processing time for this transaction is estimated at 1 hour and 30 minutes.",
    "keywords": [
      "Rental Process",
      "Venue Approval",
      "Order of Payment",
      "Administrative Services",
      "Institute President",
      "Application Form"
    ]
  },
  {
    "id": "bdc_concessionaire_lease_renewal_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Renewal of Contract of Lease to Concessionaire - Requirements",
    "content": "The Renewal of Contract of Lease to Concessionaire is a service provided by the Business Development Center for canteen concessionaires wishing to continue business operations at EARIST. As detailed in the Citizen's Charter 2025, this is a Simple G2C transaction. Applicants must submit an original Letter of Intent and an original Clearance or Certificate of No Outstanding Balance. Additionally, they must provide original or photocopies of legal documents, including business permits, Barangay Clearances, NBI or Police Clearances, BIR Registration, DTI Registration, and Sanitary Permits. The process verifies that the concessionaire remains compliant with legal and institutional standards before extending their tenancy.",
    "keywords": [
      "Lease Renewal",
      "Canteen Contract",
      "Business Permits",
      "Sanitary Permit",
      "BIR Registration",
      "DTI Registration",
      "Clearance"
    ]
  },
  {
    "id": "bdc_concessionaire_lease_renewal_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Renewal of Contract of Lease to Concessionaire - Process",
    "content": "The procedural workflow for renewing a canteen lease at EARIST involves multiple approvals. BDC staff first verify the submitted legal documents and clear an endorsement letter for the Office of the President. An Occupancy Permit is prepared for approval by the Institute President. Once the contract is drafted, the concessionaire signs it with a witness, followed by the signing of authorized Institute signatories (witnessed by Pedro Rommel Kirong). The contract is then notarized. Finally, the notarized contract is filed in the concessionaire's folder, and a copy is released to the tenant. The total processing time for the renewal is estimated at 2 hours and 40 minutes, provided all signatories are available.",
    "keywords": [
      "Lease Signing",
      "Occupancy Permit",
      "Contract Notarization",
      "Endorsement Letter",
      "Institute President",
      "BDC Director"
    ]
  },
  {
    "id": "bdc_new_canteen_application_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Application of New Canteen Concessionaire - Overview",
    "content": "The Application of New Canteen Concessionaire is classified as a Complex G2C transaction under the Business Development Center in the EARIST Citizen's Charter 2025. This service targets external canteen concessionaires aiming to establish business operations within the Institute. The requirements mirror those of renewal, demanding a Letter of Intent and a suite of legal documents: business permits, Barangay Clearances, NBI/Police Clearances, BIR Registrations, DTI Registrations, and Sanitary Permits. Due to the need for screening, food tasting, and interviews, the total processing time extends significantly longer than renewal procedures.",
    "keywords": [
      "New Canteen Application",
      "Complex Transaction",
      "External Client",
      "Business Permits",
      "Sanitary Compliance"
    ]
  },
  {
    "id": "bdc_new_canteen_selection_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Application of New Canteen Concessionaire - Selection Process",
    "content": "The selection process for new canteen concessionaires at EARIST involves rigorous screening steps. BDC staff first validate submitted documents and prepare a shortlist of applicants (5 minutes). The process then moves to a 7-day period for posting the shortlist and contacting applicants for a Food Tasting Activity. Applicants undergo screening based on the meals to be served and their pricing. Following this, a 3-day window is allocated for interviews and the actual Food Tasting Activity, where executives and staff check the applicant's knowledge, food preparation hygiene, and affordability. A list of applicants who pass the food tasting is then prepared (1 day).",
    "keywords": [
      "Food Tasting",
      "Applicant Screening",
      "Canteen Interview",
      "Hygiene Check",
      "Meal Pricing",
      "Shortlist"
    ]
  },
  {
    "id": "bdc_new_canteen_contract_finalization",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Business Development Center",
    "topic": "Application of New Canteen Concessionaire - Contract Finalization",
    "content": "Once a new canteen applicant passes the screening and food tasting, the Business Development Center proceeds with the formalization of the tenancy. This involves preparing an endorsement letter to the Office of the President and an Occupancy Permit. A Contract of Lease is drafted between the concessionaire and EARIST (1 hour). The concessionaire signs the contract, followed by the Institute's authorized signatories, including the Institute President and witness Pedro Rommel Kirong. The contract is then notarized and recorded in the outgoing logbook. The entire process, from document validation to the final filing of the notarized contract, takes approximately 11 days, 2 hours, and 45 minutes.",
    "keywords": [
      "Contract Finalization",
      "Occupancy Permit",
      "Lease Agreement",
      "Notarization",
      "Processing Time"
    ]
  },
  {
    "id": "colleges_program_curriculum_request",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Academic Services",
    "topic": "Request for Program Curriculum",
    "content": "Under the services provided by the Colleges, the Request for Program Curriculum allows students (current, former, and graduates), faculty, and academic personnel to obtain copies of the Course Syllabus, Course Outline, Course Description, or Course Crediting documents. These documents must be approved by the Chairperson, Dean, and Vice President for Academic Affairs (VPAA). The requirements include a Log-in request, a Letter of Request, and the specific Course Description details. The process involves submitting the request to the Area Chairperson or Dean's Office, where the College Dean evaluates the document and endorses it to the SRRMS (Student Records and Registration Management System). There are no fees for this service, and the total processing time is 2 days.",
    "keywords": [
      "Program Curriculum",
      "Course Syllabus",
      "Course Outline",
      "Course Crediting",
      "VPAA",
      "College Dean",
      "SRRMS"
    ]
  },
  {
    "id": "colleges_completion_of_grade",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Academic Services",
    "topic": "Completion of Grade Procedure",
    "content": "The Completion of Grade service involves the validation of the Completion Form submitted by the concerned faculty and its endorsement to the Registrar's Office for processing. This service is available to students and faculty personnel. The primary requirement is the Completion Form containing the Official Receipt (OR) Number and the Faculty Signature. Applicants must also provide a Log-in receipt and present their ID. The process requires the College Dean to approve the form and assist the client. The transaction is classified as Simple with no associated fees. The total processing time for the approval and release of the form is approximately 35 minutes.",
    "keywords": [
      "Completion of Grade",
      "Completion Form",
      "Grade Validation",
      "Registrar Endorsement",
      "OR Number",
      "College Dean"
    ]
  },
  {
    "id": "colleges_faculty_teaching_load",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Faculty Services",
    "topic": "Preparation of Faculty Teaching Load",
    "content": "The Preparation and Assignment of Faculty Teaching Load service provides faculty personnel with a Computer System Generated Faculty Load Sheet Copy. This service is available to students and faculty personnel. The requirements include a Log-in receipt and ID presentation. The staff at the Dean's Office assists the faculty in logging the request and generating the load sheet. The transaction is classified as Simple and involves no fees. The total processing time to generate and provide the Faculty Load Sheet is 30 minutes.",
    "keywords": [
      "Faculty Teaching Load",
      "Load Sheet",
      "Computer System Generated",
      "Dean's Office",
      "Faculty Schedule"
    ]
  },
  {
    "id": "colleges_admission_interview_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Admission Services",
    "topic": "College Interview and Assessment",
    "content": "The College Interview service evaluates a student's knowledge and aptitude through a Program Preparedness Test (PPT) and an interview during the admission process. This service is available to old students, new students, qualified applicants, transferees, and shifters. Requirements include the Notice of Admission or ECAT Result, an Accomplished Application Form, and the Chairperson's Evaluation. The Program Chairperson conducts the assessment, while the Dean's Office issues the Advisement Slip to the student. The process takes approximately 2 days to complete and involves no fees.",
    "keywords": [
      "College Interview",
      "Program Preparedness Test",
      "PPT",
      "Admission",
      "ECAT Result",
      "Advisement Slip"
    ]
  },
  {
    "id": "colleges_cross_registration",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Enrollment Services",
    "topic": "Cross-Registration Procedure",
    "content": "Cross-Registration applies to subjects to be taken by students at other colleges or schools. The process requires an Accomplished Application Form, the Chairperson's Evaluation, and a Letter of Request recommending approval by the concerned program chairperson. Final recommending approval must be secured from the concerned College Dean. This transaction is available to various student types including transferees and shifters. The College Dean or Dean's Office staff assists with the student's concern. The total processing time is 1 day, and there are no fees to be paid for the college-level approval steps.",
    "keywords": [
      "Cross-Registration",
      "External Subjects",
      "Chairperson Evaluation",
      "College Dean",
      "Enrollment"
    ]
  },
  {
    "id": "colleges_withdrawal_dropping_adding",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Enrollment Services",
    "topic": "Approval of Withdrawal, Dropping, Changing, and Adding Courses",
    "content": "The Colleges handle the approval process for Withdrawal from Enrollment, Dropping, Changing, and Adding Courses. This service is available to all student types (Old, New, Transferees, Shifters). Essential requirements include the SRRMS Accomplished Application Form, Chairperson's Evaluation, the specific Withdrawal/Changing/Adding Form, and a Letter of Request recommending approval from the program chairperson. The College Dean evaluates and processes the request. The service is fee-free and has a processing time of 1 day.",
    "keywords": [
      "Withdrawal of Enrollment",
      "Dropping Subjects",
      "Adding Subjects",
      "Changing Subjects",
      "SRRMS Forms",
      "College Dean"
    ]
  },
  {
    "id": "colleges_excess_overload_approval",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Enrollment Services",
    "topic": "Approval of Excess or Overload Units",
    "content": "The Approval of Excess/Overload service is specifically for graduating students requesting to take excess units, with a maximum limit of 12 units. The process requires an Accomplished Application Form, Chairperson's Evaluation, and a Letter of Request recommending approval by the concerned program chairperson. The College Dean reviews the recommendation and grants approval. This transaction is classified as Simple, requires no fees, and is completed within 1 day.",
    "keywords": [
      "Overload Subjects",
      "Excess Units",
      "Graduating Students",
      "12 Units Limit",
      "Academic Overload",
      "College Dean"
    ]
  },
  {
    "id": "colleges_student_activities_approval",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Student Affairs",
    "topic": "Approval of Student Activities",
    "content": "The Student Activities service involves validating requests to conduct school activities and use school facilities or equipment. This process adheres to CHED Memorandum Order No. 63, s. 2017. Requirements include a Letter of Request with recommending approval by the program chairperson and attachment of all pertinent documents as stated in the CHED order. The workflow involves review by the College Dean (1 Day) and subsequent endorsement to the Vice President for Academic Affairs (VPAA) and the President for final approval (1 Day). The total processing time is 2 days.",
    "keywords": [
      "Student Activities",
      "Event Approval",
      "Facility Use",
      "CHED Memo 63",
      "VPAA",
      "Off-Campus Activities"
    ]
  },
  {
    "id": "colleges_student_complaints_investigation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Colleges - Student Affairs",
    "topic": "Student Complaints and Grievances",
    "content": "The Student's Complaints service covers the verification and investigation of complaints filed by students (Regular or Irregular, First to Fifth Year). The College Dean or Dean's Office receives the Written Complaint from the concerned client. The office verifies the complaint and endorses it to the Grievance and Legal Counsel Office for immediate legal proceedings. This service is classified as Simple, involves no fees, and has a processing time of 3 days.",
    "keywords": [
      "Student Complaints",
      "Grievance",
      "Legal Counsel",
      "Investigation",
      "Written Complaint",
      "College Dean"
    ]
  },
  {
    "id": "library_circulation_students",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Circulation of Books - Students",
    "content": "Under Library Services, the Circulation of Books and Other Library Materials for students allows for the borrowing, lending, and returning of materials depending on availability. This service is classified as a Simple Government to Citizen (G2C) transaction with a total processing time of 9 minutes. To avail of this service, students must provide a Borrower's Slip, a copy of the Book Card, and their Student ID or a copy of their Certificate of Registration (COR). The process begins with the student searching for the topic in the Online Public Access Catalog (OPAC) and filling out a borrower's slip (3 minutes). If the material is found, the student proceeds to the charging desk to fill out the book card and submit their ID or COR (3 minutes). For returns, the student hands the material to the staff at the charging desk to retrieve their ID or COR (3 minutes).",
    "keywords": [
      "Circulation",
      "Borrowing Books",
      "OPAC",
      "Student ID",
      "Library Return Policy"
    ]
  },
  {
    "id": "library_circulation_faculty_admin",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Circulation of Books - Administrators and Faculty",
    "content": "The Library Services department provides a specific circulation process for Administrators and Faculty Members (Full-time and Part-time). This is a Government to Government (G2G) transaction requiring an Employee ID, Borrower's Slip, and Book Card copy. The process mirrors the student procedure but typically takes 8 minutes to complete. The faculty member searches the OPAC, fills out a borrower's slip, and submits their Employee ID to the staff on duty at the charging desk. When returning materials, the faculty member hands over the book in exchange for their Employee ID, and the staff issues a return slip.",
    "keywords": [
      "Faculty Borrowing",
      "Administrator Access",
      "Library Circulation",
      "Employee ID",
      "Book Return"
    ]
  },
  {
    "id": "library_new_normal_inquiries",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Online Transactions (New Normal) - Inquiries",
    "content": "Library Services in the New Normal facilitates online transactions for students and faculty for reference and research needs. Clients may send queries via Facebook Messenger (fb.com/earistmanilalibrary), email (library@earist.edu.ph), phone (824309466 to 68 loc. 122), or the official website. For Facebook transactions, the librarian verifies the user by requesting a scanned or electronic copy of the student's registration or the faculty's employee ID. Once verified, the College Librarian I assists and guides the user with their research needs. This verification and assistance process is estimated to take 5 minutes.",
    "keywords": [
      "Online Library Services",
      "Remote Access",
      "Research Assistance",
      "Library Email",
      "Facebook Messenger"
    ]
  },
  {
    "id": "library_new_normal_document_delivery",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Online Transactions (New Normal) - Document Delivery and Returns",
    "content": "For document or book requests under the New Normal protocols, students and faculty must fill out a Google Form. The library notifies the client when the requested material is ready for pick-up. Clients may choose to pick up documents personally, send a representative with an authorization letter, or use a courier service. For returns, clients must fill out a Google Form for book returns on or before the due date and place the material in the drop box located at the school entrance. The library sends an email notification regarding the due date and an acknowledgment email once the returned item is received. The processing time for returns via drop box is approximately 3 minutes.",
    "keywords": [
      "Document Delivery",
      "Book Pick-up",
      "Drop Box Return",
      "Courier Service",
      "Authorization Letter"
    ]
  },
  {
    "id": "library_photocopying_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Photocopying of Library Materials",
    "content": "The Library Services department permits Administrators, Faculty, Students, Visitors, and Alumni to reproduce library materials subject to copyright laws. This service allows users to temporarily take books out for photocopying. The requirements include a Borrower's Slip, Book Card Copy, and a valid ID (Student ID, COR, Employee ID, or Alumni ID). The user presents their ID, fills up the book card, and leaves their ID with the staff while photocopying (3 minutes). Upon completion, the user returns the material to the staff to retrieve their ID (3 minutes). The total processing time is 6 minutes.",
    "keywords": [
      "Photocopying",
      "Copyright Compliance",
      "Book Reproduction",
      "Temporary Borrowing"
    ]
  },
  {
    "id": "library_borrowing_limits_policies",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Overnight and Weekend Borrowing Policies",
    "content": "The Library Services department enforces specific limits for overnight or weekend use of books. Students are permitted to borrow a maximum of two (2) books for overnight use only. Full-time faculty and staff may borrow a maximum of five (5) books every semester, while part-time faculty are allowed a maximum of three (3) books every semester, provided they present valid identification. All borrowed books must be returned on or before 10:00 a.m. on the following service day. If a book is lost, it must be reported immediately to avoid sanctions. Lost books must be replaced with the latest edition of the same title; if the specific title is unavailable, a related title copyrighted within the last 5 years is acceptable.",
    "keywords": [
      "Borrowing Limits",
      "Overnight Use",
      "Lost Book Policy",
      "Book Replacement",
      "Faculty Privileges"
    ]
  },
  {
    "id": "library_referral_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Issuance of Referrals",
    "content": "The Issuance of Referrals service assists enrolled students, faculty, and staff who wish to use other libraries or institutions. This service is available to internal and external clients including Alumni and Visitors. Requirements include a Google Form submission and a valid ID. The process involves checking the availability of referral schedules for the selected institution, filling up a referral slip, and issuing a referral letter. The staff also advises the client on the specific guidelines of the target library. The total processing time for issuing a referral is 6 minutes.",
    "keywords": [
      "Library Referrals",
      "Inter-library Loan",
      "Referral Letter",
      "External Research"
    ]
  },
  {
    "id": "library_facility_reservation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Library Services",
    "topic": "Reservation of Equipment and Facilities",
    "content": "Administrators, Faculty, and Students may request the reservation of library facilities or research equipment. Requests must be made at least three (3) days in advance to avoid conflicts with other classes or borrowers. For class use, the faculty in charge must inform the librarian and provide a letter of request. The process includes checking the availability of the facility, submitting a Request Letter and ID, and filling out a log sheet. The College Librarian reminds the client to follow guidelines regarding equipment use. The total processing time to secure a reservation is 7 minutes.",
    "keywords": [
      "Facility Reservation",
      "Equipment Rental",
      "Advance Booking",
      "Library Venue"
    ]
  },
  {
    "id": "rds_overview_and_mandate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Office Mandate and Functions",
    "content": "The Research and Development Services (RDS) office is responsible for searching, discovering, providing, and conducting quality research and development studies. The office focuses on three primary areas: science and technology education, institute policy research, and current technologies in the educational and industrial sectors regarding products, processes, and services. Additionally, the RDS is charged with developing, maintaining, enriching, and providing a general databank. This databank is designed to be readily available to the various colleges, sectors, and units of the institute, as well as to outside clientele.",
    "keywords": [
      "Research Mandate",
      "Science and Technology",
      "Policy Research",
      "Databank",
      "RDS Functions"
    ]
  },
  {
    "id": "rds_annual_outstanding_research_award",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Annual Outstanding Research Award (AORA)",
    "content": "The Annual Outstanding Research Award (AORA) is a Highly Technical Government-to-Government (G2G) transaction available to all regular faculty members, administrative staff, and officials with academic or non-academic rank. To apply, proponents must submit an Abstract and Full Paper to the Office of the Research and Development Services (ORDS). The process involves verification by RDS staff, screening by internal reviewers, and final judging by external judges. Following the short-listing and endorsement to the President, the award includes a Plaque of Recognition and Cash Incentives. The total processing time for the AORA is approximately 10 days.",
    "keywords": [
      "AORA",
      "Research Award",
      "External Judges",
      "Cash Incentives",
      "Research Paper"
    ]
  },
  {
    "id": "rds_outstanding_researcher_awards_ora",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Outstanding Researcher Awards (ORA)",
    "content": "The Outstanding Researcher Awards (ORA) is a Highly Technical service for regular faculty, administrative staff, and officials. Applicants must submit a Letter of Nomination and documents related to their achievements, such as certificates of presentation, published research papers, and research-related awards. The RDS staff verifies documents and lists nominees for endorsement to the Institute Committee on Research Awards (ICRA). The ICRA evaluates the nominees and recommends an awardee to the President. The award consists of a Plaque of Recognition and Cash Incentives. The entire process, from submission to the awarding ceremony, takes approximately 12 days.",
    "keywords": [
      "ORA",
      "Researcher Award",
      "ICRA",
      "Institute Committee on Research Awards",
      "Nomination"
    ]
  },
  {
    "id": "rds_research_citation_award",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Research Citation Award",
    "content": "The Research Citation Award is a Complex G2G transaction available to full-time faculty members or administration officials who hold permanent status and have a length of service of at least three years. The primary requirement is proof of at least ten (10) cited or utilized research findings, models, or theories. Applicants must submit a Letter of Application and the necessary proof to the ORDS. The process includes initial screening by the RDS Director, endorsement to the Institute Committee on Research Awards (ICRA), and evaluation by the ICRA Chair. Successful candidates receive Cash Incentives during an awarding ceremony. The total processing time is 10 days.",
    "keywords": [
      "Research Citation",
      "Citation Award",
      "Ten Citations",
      "Research Utilization",
      "Permanent Faculty"
    ]
  },
  {
    "id": "rds_research_presentation_support",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Research Presentation Support",
    "content": "The Research Presentation service supports proponents presenting research at conferences. This Highly Technical service is available to all administrative officials, regular faculty, and staff. Requirements include a Letter of Invitation, Research Abstract, Notice of Acceptance, and a Recommendation Letter from the Dean or Immediate Supervisor. Post-presentation evidence, such as a Certificate of Participation, is also required. The workflow involves verification by RDS, recommendation by the Vice President for Academic Affairs (VPAA), and final approval by the Institute President. The Financial Management Services (FMS) verifies fund availability before the President issues a Staff Development Order (S.O.). The total processing time is 10 days.",
    "keywords": [
      "Conference Presentation",
      "Staff Development Order",
      "Research Funding",
      "Abstract Acceptance",
      "Liquidation Report"
    ]
  },
  {
    "id": "rds_research_proposal_undertaking",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Research Proposal and Undertaking",
    "content": "The Research Proposal and Undertaking service facilitates new research projects. It is available to all regular faculty members and non-teaching personnel, provided the latter collaborate with a faculty member. Applicants must submit a Capsule Research Proposal and an Endorsement Letter from the College Research Evaluation Committee (CREC). The RDS staff verifies the proposal, which is then assessed by the EARIST Research Evaluation Committee (EREC) and the VPAA. Upon approval by the President and confirmation of funds by FMS, the proponent is notified. The process concludes with the signing of a Memorandum of Research Undertaking. The total timeline is 11 days.",
    "keywords": [
      "Research Proposal",
      "Research Undertaking",
      "CREC",
      "EREC",
      "Memorandum of Agreement",
      "Research Funding"
    ]
  },
  {
    "id": "rds_research_publication_incentives",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Research Publication Incentives",
    "content": "The Research Publication Incentives program is a Complex transaction for all permanent personnel researchers (faculty, administrative, or non-teaching). Applicants must secure and fill out the Research Publication Incentive Form (Form no. 10) and attach supporting documents of the publication. The process involves verification by RDS staff, recommendation to the VPAA, and evaluation by the VPAA. Successful applications are recommended to the Office of the President for the awarding of Cash Incentives. The total processing time is approximately 5 days and 5 minutes.",
    "keywords": [
      "Publication Incentives",
      "Form 10",
      "Research Publication",
      "Cash Incentives",
      "Faculty Publishing"
    ]
  },
  {
    "id": "rds_special_research_award",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Research and Development Services",
    "topic": "Special Research Award",
    "content": "The Special Research Award is designed for winners or awardees of Regional, National, or International Research Competitions. This Complex G2G transaction requires a Letter of Application and supporting documents proving the award. The ORDS verifies and evaluates the submission before endorsing the qualified applicant to the Office of the President. The award includes a Plaque and Cash Incentives. The processing time for this award is 4 days.",
    "keywords": [
      "Special Research Award",
      "Research Competition",
      "Regional Winner",
      "National Winner",
      "International Winner"
    ]
  },
  {
    "id": "nstp_certification_completion_nstp1",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "National Service Training Program",
    "topic": "Issuance of Certification of Completion in NSTP 1",
    "content": "Under the National Service Training Program (NSTP) outlined in the EARIST Citizen's Charter 2025, the Issuance of Certification of Completion in NSTP 1 is a service available to NSTP students. This certification officially verifies that a student has finished NSTP 1. The service is classified as a Simple Government to Citizen (G2C) transaction. To request this certification, students must have passed the NSTP 1 subject. The procedure requires the student to present the Report of Grades (ROG) indicating they passed NSTP 1 to the NSTP Director. The Director then issues the certificate. There are no fees associated with this service, and the total processing time is 30 minutes.",
    "keywords": [
      "NSTP 1",
      "Completion Certificate",
      "Report of Grades",
      "ROG",
      "NSTP Director"
    ]
  },
  {
    "id": "nstp_certification_graduate_cwts_lts",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "National Service Training Program",
    "topic": "Issuance of Certification as Graduate of NSTP CWTS/LTS",
    "content": "The Issuance of Certification as Graduate of NSTP CWTS/LTS is provided by the National Service Training Program office. As described in the EARIST Citizen's Charter 2025, this service certifies that a student has finished the full NSTP program (CWTS or LTS components). It is a Simple G2C transaction for graduates of NSTP. The prerequisite is that students must have passed both NSTP 1 and NSTP 2 with the same component. To avail of the certificate, the client presents the Report of Grades (ROG) showing passing marks for both subjects. The NSTP Director processes the request and issues the certificate within 30 minutes. No fees are required.",
    "keywords": [
      "NSTP Graduate",
      "CWTS",
      "LTS",
      "Certificate of Graduation",
      "NSTP 2"
    ]
  },
  {
    "id": "nstp_issuance_serial_number",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "National Service Training Program",
    "topic": "Issuance of Serial Number (CWTS and LTS)",
    "content": "The Issuance of Serial Number (CWTS and LTS) is a service for students who have completed the National Service Training Program. According to the EARIST Citizen's Charter 2025, this is a Simple Government to Citizen (G2C) transaction. Eligibility requires students to have passed both NSTP 1 and NSTP 2 with the same component. The process involves the student presenting the Report of Grades (ROG) that proves they passed the subjects. The NSTP Director is responsible for issuing the serial number. The service is free of charge, and the processing time is estimated at 30 minutes.",
    "keywords": [
      "NSTP Serial Number",
      "CWTS",
      "LTS",
      "NSTP Completion",
      "Serial Number Issuance"
    ]
  },
  {
    "id": "ecs_mandate_and_function",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Extension and Community Services",
    "topic": "Mandate and Functions",
    "content": "The EARIST Extension and Community Services (ECS) office provides a platform to validate the relevance and responsiveness of curricular programs. This is achieved through the execution of activities, programs, projects, and training designed to improve the capabilities of Local Government Units (LGUs), Government Organizations (GOs), Non-Government Organizations (NGOs), and industries. Various training programs and expertise-based services are provided to communities and stakeholders upon request to the Institute. These services aim to benefit adopted Barangays, schools, and other partner entities.",
    "keywords": [
      "Extension Services",
      "Community Outreach",
      "LGU Partnership",
      "Curricular Relevance",
      "Training Programs"
    ]
  },
  {
    "id": "ecs_requirements_and_classification",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Extension and Community Services",
    "topic": "Service Requirements and Classification",
    "content": "The Extension and Community Services transaction is classified as Highly Technical and operates as a Government-to-Client/Stakeholders (G2C) service. It is available to adopted Barangays, Schools, LGUs, NGOs, and industries (both internal and external). The checklist of requirements includes: a Community Needs Assessment or Survey, a Letter of Request addressed to the ECS Director (signed by the Extension Project Chair and Dean), and an Extension Project Proposal. Additional requirements include Budgetary Requirements (if applicable), an Endorsement from the ECS Director to the President recommending VPAA approval, a Memorandum of Agreement/Understanding (MOA/MOU), an Extension Evaluation Form, an Extension Project Terminal Report, and an Extension Project Progress Report.",
    "keywords": [
      "Extension Requirements",
      "Project Proposal",
      "MOA",
      "MOU",
      "Needs Assessment",
      "Terminal Report"
    ]
  },
  {
    "id": "ecs_process_flow_planning_approval",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Extension and Community Services",
    "topic": "Project Planning and Approval Process",
    "content": "The process for initiating an Extension and Community Service project begins with the submission of the Community Need Assessment Survey and a request letter (30 minutes). This is followed by coordination meetings (2 hours) and consultative meetings with the ECS Director to discuss project details or review terms if a MOA/MOU is required (2 hours). The proponent then prepares necessary documents, including the project proposal, budget, and identification of resource persons (2 days). Once submitted, the Administrative Staff and Director prepare an endorsement letter (1 hour 30 minutes). The proposal is then endorsed to the EARIST President through the Vice President for Academic Affairs (VPAA) for final approval (1 day).",
    "keywords": [
      "Extension Approval",
      "Coordination Meeting",
      "Project Endorsement",
      "VPAA",
      "MOA Review"
    ]
  },
  {
    "id": "ecs_process_flow_implementation_liquidation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Extension and Community Services",
    "topic": "Project Implementation and Liquidation Process",
    "content": "Following the approval of an Extension project, the funding is processed by the Financial Management Services (FMS), and a Special Order is issued by the Institute President (1 week). The implementation and documentation of the activity or training generally cover a period of 8 hours. Post-implementation, the Extension Project Chair and Dean must validate the activity's relevance and submit required reports, including the Liquidation Report, Terminal Report, Progress Report, and Stakeholder Evaluation results (1 week). The total processing time for the entire Extension and Community Services transaction, from request to liquidation, is estimated at 17 Days and 14 Hours.",
    "keywords": [
      "Project Implementation",
      "Liquidation Report",
      "Special Order",
      "Terminal Report",
      "FMS Funding"
    ]
  },
  {
    "id": "gad_mandate_and_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Gender and Development",
    "topic": "Mandate and Objectives",
    "content": "The Office of Gender and Development (GAD) at EARIST aims to transform unequal gender relations and promote inclusive and sustainable development that benefits both women and men. The office advocates for policies and practices that challenge stereotypes, promote women's rights, and create opportunities for gender equality at all levels of society. The services provided by this office are available to EARISTIANS, adopted Barangays, Schools, LGUs, NGOs, and Industries.",
    "keywords": [
      "Gender Equality",
      "Inclusive Development",
      "Women's Rights",
      "GAD Mandate",
      "Gender Relations"
    ]
  },
  {
    "id": "gad_requirements_and_classification",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Gender and Development",
    "topic": "Service Requirements and Classification",
    "content": "Transactions with the Office of Gender and Development are classified as Highly Technical G2C (Government-to-Client/Stakeholders) services. The required documents for availing GAD services include the Approved Financial Plan of the Institute, the GAD Plan and Budget (GPB), a GAD Request Letter, and a GAD Activity/Project Proposal. Applicants must also submit Budgetary Requirements (if any), an Endorsement from the GAD Focal Point Person to the President recommending VPAA approval, and an Activity Evaluation Form.",
    "keywords": [
      "GAD Requirements",
      "GAD Plan and Budget",
      "GPB",
      "Project Proposal",
      "Financial Plan"
    ]
  },
  {
    "id": "gad_process_flow_gpb_formulation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Gender and Development",
    "topic": "GAD Plan and Budget (GPB) Formulation Process",
    "content": "The formulation of the GAD Plan and Budget (GPB) involves several steps managed by GAD Staff, the Director, and the Focal Person. First, data regarding Programs, Projects, and Activities (PPAs) is gathered and reviewed from different colleges (2 hours). The data is then prepared using the Specified Annual GPB Form, which involves reviewing gender issues, mandates, objectives, and budget allocations (1 week). Once finalized and verified, the GPB is approved by the President (1 day) and encoded into the PWC Website (5 hours). Finally, the GPB is endorsed to the CHED Regional Office for review, with copies furnished to the Planning Services Office and FMS (30 minutes).",
    "keywords": [
      "GPB Formulation",
      "PWC Website",
      "CHED Endorsement",
      "Gender Issues",
      "Budget Allocation"
    ]
  },
  {
    "id": "gad_process_flow_activity_implementation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Gender and Development",
    "topic": "GAD Activity Implementation and Liquidation",
    "content": "For specific GAD activities, the requesting party prepares and submits necessary documents, including the request letter, project proposal, and budget (2 days). The Administrative Staff prepares an endorsement letter (1 hour), which is then recommended by the VPAA and approved by the Institute President (1 day and 30 minutes). Funding processing and the issuance of a Special Order take approximately 1 week. Implementation and documentation of the activity are allotted 8 hours. The process concludes with the submission of the Liquidation Report, Terminal Report, and Evaluation Results (1 week). The total estimated processing time for GAD transactions is 25 days and 17 hours.",
    "keywords": [
      "GAD Implementation",
      "Activity Approval",
      "Special Order",
      "Liquidation",
      "Terminal Report"
    ]
  },
  {
    "id": "qa_request_documents_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Quality Assurance",
    "topic": "Request for Quality Assurance Documents - Overview and Requirements",
    "content": "Under the Quality Assurance services outlined in the EARIST Citizen's Charter 2025, the Request for Quality Assurance Documents is a service designed for internal clients seeking documents related to accreditation, ISO certification, and other quality standards. This transaction is classified as Simple and Government-to-Government (G2G). To avail of this service, the requesting party must submit one original hard copy of a Request Letter addressed to the Director of Quality Assurance. This letter must explicitly contain the full name of the client or requestor, the client's college or office, the specific document requested, the purpose of the request, and the signature of the requestor.",
    "keywords": [
      "Quality Assurance Documents",
      "Accreditation Records",
      "ISO Documents",
      "Internal Clients",
      "Request Letter"
    ]
  },
  {
    "id": "qa_request_documents_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Quality Assurance",
    "topic": "Request for Quality Assurance Documents - Process Flow",
    "content": "The procedural workflow for requesting Quality Assurance documents involves specific steps managed by the QA staff and Director. Upon submission of the request letter, the staff receives, reviews, and evaluates the request to locate the documents (2 hours). The requested documents are then reproduced; this step is allotted 1 day, though the actual time depends on the volume of ongoing printing jobs. Following reproduction, the staff consults with the Unit Head for review and release (2 hours) and logs the issuance in the Outgoing Logbook (1 hour). The final step involves the issuance of the documents to the client, who must sign the logbook to acknowledge receipt. The total processing time is estimated at 2 days and 5 hours.",
    "keywords": [
      "Document Reproduction",
      "Outgoing Logbook",
      "QA Director",
      "Processing Time",
      "Document Release"
    ]
  },
  {
    "id": "qa_accreditation_survey_visit_request",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Quality Assurance",
    "topic": "Request to Attend Accreditation Survey Visits",
    "content": "The Request to Attend Accreditation Survey Visits is a service available to all EARIST AACCUP Accreditors (Internal Clients) who wish to participate in accreditation visits for other State Universities and Colleges. This Simple G2G transaction requires the submission of an Invitation Letter from AACCUP with the invitee's signature. The process begins with the QA staff receiving and evaluating the invitation, followed by the submission of a recommendation letter to the Office of the President (2 hours). The accreditor then waits to receive the approved recommendation and Special Order or Memorandum (1 day). After the visit, the accreditor submits a report, which is reviewed by the QA staff (1 hour). The total processing time for the administrative portion of this service is 2 days and 4 hours.",
    "keywords": [
      "AACCUP Accreditors",
      "Accreditation Survey",
      "Special Order",
      "Travel Order",
      "Accreditor's Report"
    ]
  },
  {
    "id": "srrms_enrollment_new_students_undergrad",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Enrollment Procedure for New Students and Transferees (Undergraduate)",
    "content": "Under the Student Registration and Records Management Services (SRRMS), the enrollment procedure for new undergraduate students and transferees is a multi-stage process involving the SRRMS, Colleges, and Medical Services. The SRRMS is responsible for receiving admission requirements, while Colleges handle pre-enrollment. Required documents for freshmen include Form 138, Certificate of Good Moral Character, Birth Certificate (PSA), and specific certifications if F-138 was used elsewhere. Transferees require a Transcript of Records, Transfer Credentials, and Good Moral Character certificate. \n\nThe process begins with a qualifying exam and College Interview. Accepted applicants proceed to the Medical Laboratory for processing (Fee: 550.00 PHP). Students then submit original credentials to the Registrar's Office. If requirements are incomplete, a promissory note is required. Following verification, students proceed to their respective colleges for subject enlisting, student number assignment, and scholarship tagging. Enrollment officers provide a Voluntary Opt-Out Form for students choosing to pay tuition fees. For those opting out, payment is made at the Cashier's Office. Finally, the Certificate of Registration (COR) is reflected on the student portal.",
    "keywords": [
      "Enrollment",
      "Freshmen",
      "Transferees",
      "Form 138",
      "Medical Laboratory Fee",
      "Voluntary Opt-Out",
      "Qualifying Exam"
    ]
  },
  {
    "id": "srrms_enrollment_grad_school_tcp",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Enrollment Procedure for New Students (TCP & Graduate School)",
    "content": "The SRRMS outlines the enrollment procedure for new Graduate School (GS) and Teacher Certificate Program (TCP) students. Requirements include the approved application for admission, Transcript of Records (TOR) from the last school attended, Transfer Credentials/Honorable Dismissal, Certificate of Employment, and a Marriage Certificate for female married students. \n\nAfter passing the EARIST Graduate Admission Test (EARIST-GAT) or TCP Admission Test, the student obtains an advisement slip from the GS or CED office. The Enrollment Officer registers subjects based on this slip. Students must pay tuition fees at the Cashier's Office, where the amount depends on the units enrolled. Admission credentials and the approved form are submitted to the Registrar's Office. If requirements are incomplete, a promissory note is issued. The Registrar prints and provides the Certificate of Registration (COR) after verifying enrollment status. The total processing time is approximately 25 minutes.",
    "keywords": [
      "Graduate School Enrollment",
      "TCP Enrollment",
      "EARIST-GAT",
      "Advisement Slip",
      "Tuition Fee",
      "Certificate of Registration"
    ]
  },
  {
    "id": "srrms_enrollment_continuing_regular_online",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Enrollment Procedure for Continuing Regular Students (Online)",
    "content": "Continuing regular students use an online portal for self-enrollment. Students log in using their student number and password to select subjects. The College Enrollment Officer validates the subject selection, ensuring prerequisites are met. If there are issues, the officer contacts the student for adjustments. Students wishing to use the Voluntary Opt-Out option to pay fees must inform the College Dean prior to validation. Once validated, the Certificate of Registration is automatically generated and reflected in the student portal. This process is designed to take approximately 5 minutes, though turnaround time may vary based on connectivity and system volume.",
    "keywords": [
      "Online Enrollment",
      "Self-Enrollment",
      "Student Portal",
      "Subject Validation",
      "Voluntary Opt-Out"
    ]
  },
  {
    "id": "srrms_enrollment_irregular_returnee",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Enrollment Process for Irregular Students and Returnees",
    "content": "Irregular students and returnees undergo a complex onsite enrollment process to ensure adherence to retention policies. Requirements include an Academic Program Evaluation (APE), Leave of Absence (LOA) forms for returnees, and an advisement slip. \n\nStudents first apply for an APE at the Registrar's Office one week before enrollment. They pay a 40.00 PHP fee for the Return from Leave of Absence (RFLOA) or APE at the Cashier. Internal evaluators assess grades to determine required subjects (processing time up to 5 working days). Following evaluation, the college enrollment officer assists in subject selection. Validated enrollment results in the generation of the Certificate of Registration. Students who opt-out of free tuition or do not qualify under the retention policy must pay tuition fees. The final step is ID validation at the Registrar's Office, where a sticker is affixed.",
    "keywords": [
      "Irregular Students",
      "Returnees",
      "Academic Program Evaluation",
      "APE",
      "Leave of Absence",
      "Retention Policy",
      "ID Validation"
    ]
  },
  {
    "id": "srrms_enrollment_shifters",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Enrollment Process for Shifters",
    "content": "Shifters are students transferring to a different program or college within EARIST. The process requires an Academic Program Evaluation and a Shifter's Form secured from the College. \n\nThe student must have the Shifter's Form signed by both the previous Dean and the accepting Dean. This form is submitted to the Registrar's Office for verification and program curriculum change. The college enrollment officer then assists the student in selecting subjects based on the evaluation. If the student opts out of free tuition, they must pay fees (40.00 PHP transaction fee plus tuition). Once enrollment is validated and the Certificate of Registration is generated, the student proceeds to the Registrar's Office for ID validation. The estimated processing time is 2 hours and 20 minutes.",
    "keywords": [
      "Shifters",
      "Program Transfer",
      "Shifter's Form",
      "Curriculum Change",
      "ID Validation"
    ]
  },
  {
    "id": "srrms_cross_enrollment_procedure",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Cross-Enrollment Procedure",
    "content": "Currently enrolled students may cross-enroll in another school if a subject is not offered at EARIST. The maximum allowance is six (6) units. The student must present a Letter of Intent (indicating school, subject, and schedule), Certificate of Registration (COR), and School ID to the Registrar. \n\nAfter evaluation of grades, the student pays a 120.00 PHP fee at the Cashier. The official receipt is submitted to the Registrar, who issues a Permit to Cross-Enroll in triplicate. This permit must be signed by the College Dean and the Registrar. Two copies are released to the student. The total processing time is approximately 14 minutes.",
    "keywords": [
      "Cross-Enrollment",
      "Permit to Cross-Enroll",
      "Unit Limit",
      "External Subjects",
      "Registrar"
    ]
  },
  {
    "id": "srrms_withdrawal_dropping_subjects",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Withdrawal of Registration and Dropping of Subjects",
    "content": "The SRRMS distinguishes between Withdrawal of Registration and Dropping of Subjects based on timing. Withdrawal must be completed within two (2) weeks from the first day of regular classes. Dropping must be completed before the scheduled Midterm Examination. \n\nFor both Undergraduate and Graduate programs, the student submits a Letter of Intent (with Parent/Guardian signature for undergrads) to the Registrar. A fee of 80.00 PHP is paid at the Cashier. The Registrar issues the appropriate form (Withdrawal or Dropping), which must be signed by concerned faculty and the Dean. The approved form is submitted to the Registrar to update the enrollment status. For students entitled to refunds, they must proceed to the Financial Management Services (FMS) office after the Registrar processes the form.",
    "keywords": [
      "Withdrawal of Registration",
      "Dropping Subjects",
      "Midterm Examination",
      "Refund of Fees",
      "Letter of Intent"
    ]
  },
  {
    "id": "srrms_leave_of_absence_loa",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Application for Leave of Absence (LOA)",
    "content": "Students wishing to temporarily separate from the Institute for non-academic or non-disciplinary reasons initiate the Leave of Absence (LOA) process at the Registrar's Office. The duration of an LOA must not normally exceed one academic year. \n\nRequirements include a Letter of Intent with a Parent's or Guardian's signature, the LOA Form, and the School ID. The student presents the letter to the Registrar, obtains a payment slip, and pays an 80.00 PHP fee at the Cashier. The accomplished LOA form, Official Receipt, and ID are submitted back to the Registrar. The processing time is approximately 7 minutes.",
    "keywords": [
      "Leave of Absence",
      "LOA",
      "Temporary Separation",
      "Residency",
      "Registrar"
    ]
  },
  {
    "id": "srrms_school_id_issuance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Issuance and Re-Issuance of School ID",
    "content": "The SRRMS manages the issuance of School IDs. For freshmen, the first issuance is free of charge; students fill out a request form or Google form, and the ID is printed and issued within approximately 1 hour and 4 minutes. \n\nFor re-issuance due to update, replacement, or loss, the fee is 200.00 PHP. Requirements include the Certificate of Registration (COR) and a Personal Data Update Form. If the ID was lost, an Affidavit of Loss is mandatory. The student pays the fee at the Cashier, submits the receipt and forms to the Registrar, and the new ID is processed and released. The re-issuance process takes approximately 1 hour and 9 minutes.",
    "keywords": [
      "School ID",
      "ID Replacement",
      "Affidavit of Loss",
      "Freshmen ID",
      "ID Fees"
    ]
  },
  {
    "id": "srrms_graduation_evaluation_application",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Evaluation and Application for Graduation",
    "content": "Graduating students undergo a Final Evaluation to determine if they meet the academic requirements to be included in the list of candidates. This can be done online via a Google link or onsite by submitting an Application for Evaluation and School ID at the Registrar's Office. \n\nOnce qualified, students proceed to the Application for Graduation. They must obtain the application form, pay the graduation fees (amount varies), and submit the form duly signed by the subject Professor and Dean along with the Official Receipt to the Registrar. The Registrar evaluates the completeness of the form and releases one copy to the student.",
    "keywords": [
      "Graduation Application",
      "Final Evaluation",
      "Candidate for Graduation",
      "Graduation Fees",
      "Academic Standing"
    ]
  },
  {
    "id": "srrms_transcript_of_records_tor",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Processing of Transcript of Records (TOR)",
    "content": "The SRRMS processes Transcript of Records (TOR) requests for employment, evaluation, or further studies. For the **First Request**, new graduates who are first-time job seekers are exempt from fees (Republic Act 11261). For others, the fee is 100.00 PHP per page plus 25.00 PHP for the security envelope. \n\nProcessing times differ based on the student's records: \n* **Automated Module (2011-Present):** 5 working days. \n* **Manual Module (2010 and below):** 6 working days due to manual evaluation. \n\nRequirements include an accomplished application form with clearance, School ID, and Documentary Stamps. Representative claiming requires an authorization letter and ID copies.",
    "keywords": [
      "Transcript of Records",
      "TOR",
      "First Time Job Seekers",
      "Automated Records",
      "Manual Records",
      "Clearance"
    ]
  },
  {
    "id": "srrms_honorable_dismissal_transfer_credentials",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Issuance of Honorable Dismissal and Transfer Credentials",
    "content": "Students transferring to other institutions request an Honorable Dismissal (HD) and Transfer Credentials. This Complex G2C transaction requires a clearance, School ID, and Documentary Stamps. The fees include 100.00 PHP per page for the TOR, 80.00 PHP for the HD and Good Moral certificate, and 25.00 PHP for the security envelope. The processing time is 5 working days. The process involves verifying the application, paying fees, and processing the documents via automated or manual modules.",
    "keywords": [
      "Honorable Dismissal",
      "Transfer Credentials",
      "Good Moral Character",
      "Transferring Students",
      "Clearance"
    ]
  },
  {
    "id": "srrms_document_certification_and_recopy",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Request for Certifications, Sad Forms, and Diplomas",
    "content": "The SRRMS handles requests for various certifications, including Certification, Authentication, and Verification (CAV) for employment, Student Admission Document (SAD) forms (ROG, Completion, Dropping), Certified True Copies (CTC), and Duplicate/Recopy of Diplomas. \n\n* **CAV:** Requires original documents. Fee is 40.00 PHP/copy. Processing time is 4 working days. \n* **SAD Forms / CTC / Diploma Recopy:** Fee is 40.00 PHP/copy. Processing time is approximately 1 hour and 18 minutes. \n\nAll requests require a School ID and Official Receipt. Representatives must provide an authorization letter.",
    "keywords": [
      "CAV",
      "Certified True Copy",
      "Diploma Recopy",
      "Report of Grades",
      "Authentication"
    ]
  },
  {
    "id": "srrms_subject_crediting",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Registration and Records Management Services",
    "topic": "Crediting of Subjects and Subject Equivalency",
    "content": "This service ensures prior subjects taken by transferees or shifters are recognized. The student submits the original Transcript of Records (TOR) in a sealed envelope and the Course Description to the Registrar. \n\nAfter paying a fee of 40.00 PHP per copy, the student receives a Crediting Form (for transferees) or Subject Equivalency Form (for shifters). The student must have the form completed and signed by the Department Chairperson and Dean. The signed form is returned to the Registrar for final checking, approval, and crediting into the system. The administrative processing time is approximately 1 hour and 18 minutes.",
    "keywords": [
      "Subject Crediting",
      "Subject Equivalency",
      "Transferees",
      "Shifters",
      "Course Description"
    ]
  },
  {
    "id": "ecc_admin_clearance_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Office of the Administrator",
    "topic": "Student and Faculty Clearance Procedures",
    "content": "Under the Office of the Campus Administrator at the EARIST Cavite Campus (ECC), specific clearance procedures are established for students and faculty. The General Clearance for Application of Student Academic Records allows students, alumni, and transferees to secure clearance for legal purposes, requiring a Clearance Form from the Registrar's Office signed by the Cashier, Accounting, and Chief of OSA. The process takes 5-10 minutes. For faculty, the Signing of Faculty Clearance occurs at the end of every semester and school year. This indicates freedom from money and property accountabilities. Faculty must submit a Faculty/Personnel Clearance Form, printed and signed grade sheets, an Annual Report, a Financial Report (if applicable), and updated Course Syllabi. The clearance must be signed by the Librarian, ECC Assistant Registrar, and Academic Supervisor before final signature by the Campus Administrator.",
    "keywords": [
      "Cavite Campus",
      "Student Clearance",
      "Faculty Clearance",
      "End of School Year",
      "Campus Administrator"
    ]
  },
  {
    "id": "ecc_admin_personnel_logistics",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Office of the Administrator",
    "topic": "Personnel Logistics: Locator Slips, Leave, and Development",
    "content": "The Office of the Campus Administrator manages administrative logistics for faculty and non-teaching personnel. The Signing of Locator's Slip is required before leaving campus for official business; personnel must fill out the slip with departure details, which is signed by the Administrator and recorded in the logbook (10 minutes). For absences, the Application for Leave of Absence (Form 6) must be submitted for signature and forwarded to EARIST-Manila HRMS (3-5 minutes). Additionally, the Request for Faculty Development allows personnel to seek approval for seminars, training, or presentations. This requires a Letter of Request and a Letter of Invitation, which the Administrator signs for \"Recommending Approval\" to be forwarded to the concerned office at EARIST-Manila (15 minutes).",
    "keywords": [
      "Locator Slip",
      "Form 6",
      "Leave of Absence",
      "Faculty Development",
      "Official Business"
    ]
  },
  {
    "id": "ecc_admin_activity_campus_access",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Office of the Administrator",
    "topic": "Activity Approvals and Campus Access",
    "content": "The Office of the Campus Administrator regulates campus activities and access. To Conduct School Activities, Programs, or Projects, students and personnel must submit a Letter of Request with complete details and a Program of Activities. If applicable, this requires the endorsement of an immediate superior and a parent's waiver. The Administrator checks the attachments against the Consolidated Action Plan before approval (20 minutes). For entering the campus outside regular class schedules, a separate Approval of Request/Permit is required. Applicants must submit a Letter of Request endorsed by a faculty member and a list of students involved. The Administrator verifies the authenticity of the request before signing (12 minutes).",
    "keywords": [
      "Activity Approval",
      "Campus Access",
      "Program of Activities",
      "Parent Waiver",
      "Extra-Curricular"
    ]
  },
  {
    "id": "ecc_academic_instructional_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Academic & Instructional Services",
    "topic": "Grade Completion and Program Interview",
    "content": "Under the Academic and Instructional Services overseen by Program Chairs, students with an \"INC\" (Incomplete) grade can avail of the Approval of Completion of Grades service. Requirements include an Accomplished Completion Form from the Registrar and an Official Receipt. The Program Chair verifies the form and the new grade signed by the instructor (10 minutes). Additionally, the Program Interview and Evaluation service assesses incoming freshmen and old students. New entrants present their ECAT Result and Form 138 (or TOR for transferees) for evaluation and interview. Old students submit their completion forms or other credentials. This process takes approximately 15 minutes.",
    "keywords": [
      "Completion of Grades",
      "INC Grade",
      "Program Interview",
      "Freshmen Evaluation",
      "Program Chair"
    ]
  },
  {
    "id": "ecc_administrative_support_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Administrative Services",
    "topic": "Security, Utility, and Cashier Services",
    "content": "Administrative Services at the Cavite Campus encompass Security, Utility, and Cashier functions. Security Services regulate entry: students must present a valid ID/COR for uniform and validity checks, while visitors must present a valid ID and sign the logbook to receive a Visitor's Pass (4 minutes). Utility and Maintenance Services handle repair requests from personnel via a Job Request Form approved by the Campus Administrator (5 minutes). The Cash and Disbursement Service collects payments for school fees, TORs, and other documents. Students or visitors present an assessment billing or Order of Payment, and the staff issues an Official Receipt (10 minutes).",
    "keywords": [
      "Security Check",
      "Visitor Pass",
      "Job Request",
      "Cashier",
      "Tuition Payment"
    ]
  },
  {
    "id": "ecc_registrar_admission_enrollment",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Registrar's Services",
    "topic": "Admission and Enrollment Procedure",
    "content": "The Registrar's Services at EARIST Cavite Campus manages the Admission and Enrollment Procedure. New student applicants apply online via EARIST Pinnacle and upload credentials such as Form 138, Certificate of Good Moral Character, and Birth Certificate. Qualified applicants take the ECAT (Entrance Exam) scheduled by the office (2 hours). Old students submit their Report of Grades (ROG) to Program Chairs for evaluation and issuance of Advisement Slips (1 day). Transferees and new students then submit original entrance credentials to the Registrar. The total processing time, including evaluation, testing, and submission, is estimated at 4 days, 2 hours, and 10 minutes.",
    "keywords": [
      "ECAT",
      "EARIST Pinnacle",
      "Admission Credentials",
      "Advisement Slip",
      "Form 138"
    ]
  },
  {
    "id": "ecc_registrar_enrollment_changes_overload",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Registrar's Services",
    "topic": "Enrollment Changes and Overload Requests",
    "content": "The Registrar's Office handles modifications to student enrollment. For Withdrawal of Enrollment, Changing, Dropping, and Adding of Subjects, students must secure an accomplished form with the Program Chair's evaluation and the Academic Supervisor's recommendation. A fee of 20.00 PHP applies. The Registrar processes these requests within 45 minutes. For graduating students requesting an Excess/Overload of subjects (maximum of 12 units), a Letter of Request with recommending approval from the Program Chair is required. The Registrar's staff assists the student and evaluates records to approve the overload (30 minutes).",
    "keywords": [
      "Dropping Subjects",
      "Adding Subjects",
      "Overload",
      "Excess Units",
      "Graduating Students"
    ]
  },
  {
    "id": "ecc_registrar_records_id_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Registrar's Services",
    "topic": "Student Records and ID Card Services",
    "content": "The Registrar's Office facilitates requests for Student Records (TOR, Honorable Dismissal, Certification, etc.). Students must complete a Clearance Form with signatures from the Deputized Cashier, OSA, and Campus Administrator. Fees vary (e.g., 100.00 PHP/page for TOR). The total processing time for records is 1 hour. Regarding Student Identification Cards, students can request new or replacement IDs. Requirements include a Certificate of Registration (COR) and an Affidavit of Loss for replacements. The fee is 100.00 PHP for new IDs and 150.00 PHP for replacements. The ID processing time is 25 minutes.",
    "keywords": [
      "Transcript of Records",
      "Honorable Dismissal",
      "Student ID",
      "Affidavit of Loss",
      "ID Replacement"
    ]
  },
  {
    "id": "ecc_osas_activities_complaints",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Office of Student Affairs",
    "topic": "Student Activities and Complaints",
    "content": "The Office of Student Affairs Services (OSAS) at the Cavite Campus handles the validation of Student Activities and Student Complaints. For activities, student organizations must submit a Letter of Request with recommending approval from the Program Chair and pertinent documents per CHED Memorandum Order No. 63, s. 2017. The OSAS compiles and reviews documents before submission to the Campus Administrator (2 days). For Student Complaints, the office verifies and investigates written complaints from students, faculty, or personnel. These are endorsed to the Grievance and Legal Counsel Office if necessary. The complaint processing time is 3 days.",
    "keywords": [
      "Student Activities",
      "CHED Memo 63",
      "Student Complaints",
      "Grievance",
      "OSAS"
    ]
  },
  {
    "id": "ecc_library_circulation_photocopying",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Library Services",
    "topic": "Circulation and Photocopying Services",
    "content": "Library Services at the Cavite Campus include circulation and photocopying. For Circulation (Borrowing/Returning), students present their COR and locate books. They sign a Book Card which is filed by the staff. Upon return, the staff exchanges the book for the student's ID/COR (10 minutes). Faculty members follow a similar process but use an Employee ID and sign a Book Card (8 minutes). The library also permits Photocopying of materials subject to copyright laws. Users present their ID or COR, sign the book card, and leave their ID with the staff while photocopying. The ID is returned upon the return of the material (10 minutes).",
    "keywords": [
      "Library Circulation",
      "Borrowing Books",
      "Photocopying",
      "Copyright",
      "Book Card"
    ]
  },
  {
    "id": "ecc_library_special_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Library Services",
    "topic": "Special Library Services (Overnight, Referrals, Equipment)",
    "content": "The Cavite Campus Library offers several special services. Overnight or Weekend Use allows students to borrow books for home use by presenting a COR and signing a Book Card (10 minutes). The Issuance of Referrals provides students with a letter to visit other libraries; this requires a COR and signing a Referral Form List (10 minutes). Users can access Computers/Equipment by presenting a COR and signing a Log Sheet (10 minutes). Reservations for materials can be made via a Reservation Form (10 minutes). Finally, Visiting Users from other institutions or alumni can access the library by presenting a valid ID and a referral letter from their school (10 minutes).",
    "keywords": [
      "Overnight Borrowing",
      "Library Referral",
      "Computer Use",
      "Library Reservation",
      "Visiting Researchers"
    ]
  },
  {
    "id": "ecc_medical_dental_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Medical and Dental Services",
    "topic": "Consultations and OJT Medical Certificates",
    "content": "The Medical and Dental Services (MDS) at the Cavite Campus provides health services to the academic community. Regular Consultation and Check-up services assess patients for fitness. Emergency cases receive first aid or hospital referral, while non-emergencies are managed onsite (1 hour). The MDS also issues Medical Certificates for OJT Students. Students must submit results for a Chest X-ray, Complete Blood Count (CBC), Urinalysis, and an optional Drug Test from a laboratory of their choice. The MDS staff assesses the client and signs the medical form if the student is fit for the OJT program (2 hours).",
    "keywords": [
      "Medical Consultation",
      "OJT Medical Certificate",
      "Chest X-ray",
      "Urinalysis",
      "Physical Exam"
    ]
  },
  {
    "id": "ecc_property_management_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "EARIST Cavite Campus - Property Management",
    "topic": "Supplies and Property Inventory",
    "content": "The Property Management Services (PMS) at the Cavite Campus manages the Request and Issuance of Supplies. Faculty and employees must submit a Requisition and Issue Slip (RIS) based on an Approved Annual Procurement Plan (APP). The request requires the signature of the Head of Office and approval by the Campus Administrator (20 minutes). The PMS also handles the Inventory and Signing of Faculty Clearance for retirement or the closing of the school year. This involves checking individual Memorandum of Receipts (MRs), conducting a physical inventory of items, and processing the Turn-in Slip before signing the clearance (3 hours and 50 minutes).",
    "keywords": [
      "Requisition and Issue Slip",
      "RIS",
      "Property Inventory",
      "Faculty Clearance",
      "Memorandum of Receipt"
    ]
  },
  {
    "id": "sas_scholarship_application",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services",
    "topic": "Scholarship Application Process",
    "content": "Under the Student Affairs and Services, the Scholarship application process is a Simple G2C transaction available to students. The checklist of requirements includes a Certificate of Recognition secured from the Registrar's Office and a Report of Grades (ROG) secured from the Dean's or Registrar's Office. To avail of the service, the student applicant must submit PDF copies of the Certificate of Registration (COR) and ROG to the SARRMS Office Staff. The service is free of charge, though a fee of P20.00 applies if the documents are lost. The total processing time for the request is 1 day.",
    "keywords": [
      "Scholarship",
      "Certificate of Recognition",
      "Report of Grades",
      "SARRMS",
      "Student Services"
    ]
  },
  {
    "id": "sas_on_campus_activity_request",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Leadership Division",
    "topic": "Request for On-Campus Student Activities",
    "content": "The process for requesting On-Campus Student Activities is available to officially enrolled students, registered student organizations, and colleges. This service covers academic and non-academic activities within campus premises. Requirements include a Student Activity Proposal Form, a budget proposal, supporting documents, and a request letter addressed to the Institute Student Government (ISG) President and the Institute President (through the VPAA, SAS Director, and Leadership Division Program Head). The process involves securing the form, submitting the endorsement to the ISG for assessment (5 minutes), and reviewing by the Leadership Division and SAS Director. The proposal is then endorsed to the VPAA and Institute President for final approval (2 days). Once approved, the student secures a copy from the SAS staff. The total processing time is approximately 2 days and 12 minutes.",
    "keywords": [
      "On-Campus Activities",
      "Student Activity Proposal",
      "ISG",
      "Leadership Division",
      "Event Approval"
    ]
  },
  {
    "id": "sas_off_campus_activity_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Local Off-Campus Activities Committee",
    "topic": "Off-Campus Student Activities - Requirements",
    "content": "Off-campus activities, regulated under CHED CMO No. 63 Series of 2017, require specific documentation for approval. This service is classified as Complex. The checklist of requirements includes the Off-campus Form and Checklist (secured from SAS), a Notarized Parent's Consent Form, and a Medical Clearance issued by the Medical and Dental Services. Additionally, proponents must submit a resolution, budget proposal, and other related documents. For CHED-funded educational trips, verification with the Accounting Department is also required.",
    "keywords": [
      "Off-Campus Activities",
      "CHED CMO 63",
      "Parent Consent",
      "Medical Clearance",
      "Field Trip"
    ]
  },
  {
    "id": "sas_off_campus_activity_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Local Off-Campus Activities Committee",
    "topic": "Off-Campus Student Activities - Process Flow",
    "content": "The processing of Off-Campus Student Activities involves a multi-step evaluation. Proponents submit applications to the Office of Student Affairs and Services (SAS) for initial evaluation (30 minutes) and detailed officer evaluation (2 days). This includes checking requirements like insurance and medical clearances. If deficiencies are found, proponents must comply with additional requirements. Upon full compliance, the SAS Director and Committee Chairman approve the documents (1 day), and a Certificate of Compliance is issued. A request is then sent to the President for endorsement to the Commission on Higher Education Regional Office (CHEDRO). The total processing time, including routing to signatories and submission to CHEDRO, is estimated at 6 days, 1 hour, and 52 minutes.",
    "keywords": [
      "Off-Campus Process",
      "CHEDRO Endorsement",
      "Certificate of Compliance",
      "SAS Evaluation",
      "Activity Approval"
    ]
  },
  {
    "id": "sas_new_org_accreditation_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Leadership Division",
    "topic": "Accreditation of Newly-Founded Student Organizations - Requirements",
    "content": "Accreditation for newly-founded student organizations is regulated by the EARIST Student Handbook 2019 (Article X, Section 3). The transaction is classified as Complex. Required documents include the Accreditation Checklist and forms (from the Institute Student Government), the SAS Accreditation Form, and a Letter of Application for Recognition. Organizations must also submit their Constitution and By-Laws, Organization Profile, and a List of Officers (with specimen signatures, student numbers, contact details, and 2x2 IDs). Additional requirements include a Certification of Membership to the Organization, a One-Year Master Plan, and a Financial Plan.",
    "keywords": [
      "Student Organization Accreditation",
      "New Organization",
      "Constitution and By-Laws",
      "Master Plan",
      "ISG"
    ]
  },
  {
    "id": "sas_org_accreditation_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Leadership Division",
    "topic": "Student Organization Accreditation - Process Flow",
    "content": "The accreditation process for student organizations begins with securing the checklist and forms from the Institute Student Government (ISG). The organization submits completed documents to the ISG for initial evaluation (2 days). The ISG then forwards the evaluated documents to the SAS for further review and issuance of findings (2 days). After the organization complies with any lacking requirements, the SAS prints the Certificate of Compliance and Certificate of Accreditation (1 day). These certificates are endorsed to the SAS Director and VPAA for the President's approval (3 days). Finally, the SAS Director issues the signed certificates. The total processing time is 7 days and 50 minutes.",
    "keywords": [
      "Accreditation Process",
      "ISG Evaluation",
      "Certificate of Accreditation",
      "SAS Director",
      "Organization Recognition"
    ]
  },
  {
    "id": "sas_org_renewal_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Leadership Division",
    "topic": "Renewal of Student Organization Accreditation",
    "content": "The renewal of Student Organization Accreditation follows the provisions of the EARIST Student Handbook 2019. Requirements for renewal mirror those for new organizations (Constitution, Profile, Officer Lists, Master Plan) but include two additional critical documents: an Accomplishment Report with documentation and a Financial Report. The process flow remains the same as for new organizations, involving ISG initial evaluation, SAS review, compliance with findings, and final approval by the Institute President, taking approximately 7 days and 50 minutes.",
    "keywords": [
      "Accreditation Renewal",
      "Accomplishment Report",
      "Financial Report",
      "Student Organizations",
      "Leadership Division"
    ]
  },
  {
    "id": "sas_complaints_investigation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Student Affairs and Services - Student Discipline Board",
    "topic": "Student Complaints and Investigation",
    "content": "The Student Affairs and Services handles student complaints through the Student Discipline Board (SDB). This Simple G2C transaction requires the submission of a Complaint Letter (2 copies) and Proof/Evidence such as written witness testimonies (2 copies). The process involves receiving the complaint, notifying concerned parties, and conducting a hearing (1 day). Following the hearing, the SDB submits a resolution signed by the committee to the Vice President for Academic Affairs (VPAA) for the Institute President's approval. Once approved, a copy of the resolution is provided to all concerned parties. The total processing time is estimated at 2 hours and 50 minutes, excluding the 1-day hearing duration.",
    "keywords": [
      "Student Complaints",
      "Student Discipline Board",
      "SDB",
      "Disciplinary Hearing",
      "Case Resolution"
    ]
  },
  {
    "id": "gcts_testing_services_ecat",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Testing Services - ECAT Administration",
    "content": "Under the Guidance, Counseling, and Testing Services, Testing Services are used to assess students' aptitudes, interests, achievements, and intelligence to recommend courses of action for maximizing learning. The Administering of the EARIST College Admission Test (ECAT) is a specific service classified as a Complex Government-to-Citizen (G2C) transaction. It is available to student applicants (external clients). The primary requirement is the original Examination Permit secured from the Admission Office. The process involves receiving and checking the permit (15 minutes), administering the ECAT proper (1 hour and 30 minutes), and scanning/summarizing/forwarding results to College Deans and the Pinnacle system (5 days). The total processing time is 5 days, 1 hour, and 45 minutes.",
    "keywords": [
      "ECAT",
      "Admission Test",
      "Testing Services",
      "Examination Permit",
      "Student Assessment"
    ]
  },
  {
    "id": "gcts_psychological_testing",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Psychological Test Procedure",
    "content": "The Psychological Test is a Simple G2C transaction provided by the Counseling and Testing Services for students. Required documents include a Client Consent Form (ISO registered), a Call Slip, and a Confirmation Slip, all secured from the Guidance Office. The procedure begins with securing a letter of communication to College Deans regarding the schedule (1 day). Students then fill out the Consent Form and undergo the Psychological Test (1 hour). Staff check, score, and interpret the test (1 hour), followed by issuing a call slip to discuss the results (1 day). The total processing time is 1 day and 2 hours.",
    "keywords": [
      "Psychological Test",
      "Client Consent Form",
      "Test Interpretation",
      "Guidance Office",
      "Call Slip"
    ]
  },
  {
    "id": "gcts_needs_assessment_inventory",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Needs Assessment Inventory",
    "content": "The Needs Assessment Inventory is classified as a Complex G2C transaction available to students. The required document is the Needs Assessment Inventory Form (original copy) from the Guidance Office. The process involves securing a letter of communication to the College Dean noted by the SAS (1 day), followed by the administration of the inventory proper (1 hour). Checking, scoring, and interpreting the inventory takes 3 days. Finally, a call slip is issued to discuss the results with a confirmation slip (1 day). The total turnaround time is 5 days and 1 hour.",
    "keywords": [
      "Needs Assessment",
      "Student Inventory",
      "Scoring and Interpretation",
      "Guidance Office",
      "Complex Transaction"
    ]
  },
  {
    "id": "gcts_individual_inventory_service",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Individual Inventory Service",
    "content": "The Individual Inventory Service systematically collects, evaluates, and interprets data to identify student characteristics and potential. This inventory includes personal-social, academic-educational, and vocational-occupational data, kept in confidential storage. The service is a Simple G2C transaction. Students must complete the Individual Inventory Form (ISO registered). The process involves securing a letter of communication to College Deans (1 day), administering the Personal Inventory via room-to-room or Google Form (1 hour), profiling/assessing the data (1 day), and encoding the data (1 day). The total processing time is 3 days and 1 hour.",
    "keywords": [
      "Individual Inventory",
      "Student Profiling",
      "Confidential Data",
      "Personal Data",
      "Vocational Data"
    ]
  },
  {
    "id": "gcts_counseling_services_walk_in_and_initiated",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Counseling Services (Walk-in and Guidance-Initiated)",
    "content": "Counseling Services integrate gathered information to assist students individually or in groups. \n\n1. **Walk-in Counseling:** A Simple G2C transaction where students voluntarily seek assistance. Requirements include a Log sheet, Walk-in slip, and Counseling Form. The process involves an interview and counseling proper (1 hour).\n\n2. **Guidance-Initiated Counseling:** This occurs when the Guidance Office calls a student. Requirements include a Log sheet, Counseling Logbook, Call Slip, and Counseling Schedule. The process involves issuing call slips, conducting counseling, and accomplishing forms (1 hour).",
    "keywords": [
      "Walk-in Counseling",
      "Guidance-Initiated Counseling",
      "Counseling Form",
      "Call Slip",
      "Student Interview"
    ]
  },
  {
    "id": "gcts_exit_interview_and_referral",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Exit Interview and Referral Services",
    "content": "The Guidance Office provides specific counseling types for transitions and referrals. \n\n1. **Exit Interview/Career Counseling:** A Simple transaction for students leaving the institution. Requirements include a Log sheet and Exit Interview Form. The process involves distributing the form, explaining details (10 minutes), and conducting the interview/counseling (1 hour). Total time: 1 hour 10 minutes.\n\n2. **Referral Service:** This service addresses cases where administrators, faculty, or parents refer a student for assistance. The requirement is a Referral Form (ISO registered). The process consists of presenting the form and conducting the counseling interview (1 hour).",
    "keywords": [
      "Exit Interview",
      "Career Counseling",
      "Referral Service",
      "Referral Form",
      "Student Support"
    ]
  },
  {
    "id": "gcts_information_service_seminars",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Information Service (Seminars)",
    "content": "The Information Service disseminates descriptive material regarding personal-social, educational-academic, and vocational-occupational information through planned group activities. This is a Simple G2C transaction. Requirements include an Attendance Log Sheet and a Seminar Evaluation Form. The workflow involves securing a letter of communication to College Deans with the seminar schedule (1 day), conducting the actual seminar, and accomplishing the evaluation form (3 hours). The total processing time is 1 day and 3 hours.",
    "keywords": [
      "Information Service",
      "Student Seminars",
      "Career Information",
      "Social Development",
      "Seminar Evaluation"
    ]
  },
  {
    "id": "gcts_follow_up_and_good_moral",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Guidance, Counseling, and Testing Services",
    "topic": "Follow-up Service and Good Moral Certificate",
    "content": "The Guidance Office provides Follow-up Services and Good Moral Certificate signing. \n\n1. **Follow-up Service:** This assesses how counselees or graduates are doing. It is a Simple transaction requiring a Call Slip, Counseling Form, and Counseling Logbook. The process involves issuing a call slip (1 hour) and conducting the interview (1 hour). Total time: 2 hours.\n\n2. **Good Moral Certificate:** A Simple service where students present the Good Moral Form issued by the Registrar's Office. The Guidance Staff counsels the student and signs the certificate. Total time: 15 minutes.",
    "keywords": [
      "Follow-up Service",
      "Good Moral Certificate",
      "Student Assessment",
      "Graduate Follow-up",
      "Clearance"
    ]
  },
  {
    "id": "earist_charter_2025_admission_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Admission Services",
    "topic": "Overview and Checklist of Requirements",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), Admission Services are defined as the process of admitting or allowing students to apply to the program of their choice. The transaction is classified as 'Simple' and designated as G2C (Government to Citizen), specifically for External Clients (Students). Applicants must submit a specific set of documents to proceed. The Checklist of Requirements includes: one copy of the Original Form 138 (Senior High School Report Card) secured from the previous Senior High School; one copy of the Original Certificate of Good Moral Character secured from the previous Senior High School, College, or University; one photocopy of the Original Certificate of Live Birth secured from the PSA or NSO; one copy of Original Transfer Credentials or Honorable Dismissal secured from the previous College or University; one copy of the Original Copy of Grades secured from the previous College or University; and a Personal Data Form secured from EARIST Admission Services.",
    "keywords": [
      "admission requirements",
      "checklist",
      "Form 138",
      "report card",
      "good moral character",
      "birth certificate",
      "transfer credentials",
      "honorable dismissal",
      "G2C",
      "external clients"
    ]
  },
  {
    "id": "earist_charter_2025_admission_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Admission Services",
    "topic": "Processing Steps and Timeline",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the step-by-step procedure for Admission Services. The total processing time for the entire procedure is estimated at 2 days and 4 hours, and no fees are required to be paid during this process. The process flow is as follows: First, the Staff or Chief of Admission Services determines available slots and verifies requirements through a preliminary assessment (5 minutes). Second, the Chief of Admission Services issues the ECAT Form (15 minutes). Third, the Admission Services Staff issues the examination date and permit (5 minutes). Fourth, on Examination Day, the student must bring the ECAT Form, a Mongol 2 Pencil, and 2 scratch papers; the exam is administered by the Guidance Office Staff (2 hours). Fifth, the checking of the examination and releasing of results is conducted by the Admission Services Staff/Chief (2 days). Sixth, College Deans conduct a personal interview with the student (30 minutes). Seventh, the Chief of Medical and Dental Services conducts a Physical Examination for those who qualify (1 hour). Finally, the Chief of Admission Services handles the final filing and processing (5 minutes).",
    "keywords": [
      "admission process",
      "ECAT form",
      "examination day",
      "processing time",
      "interview",
      "medical exam",
      "step-by-step",
      "mongol 2 pencil",
      "Chief Admission Services"
    ]
  },
  {
    "id": "earist_charter_2025_instruction_services_faculty_evaluation_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Instruction Services",
    "topic": "Faculty Evaluation Overview and Requirements",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the Office of Instruction Services is responsible for the implementation and evaluation of faculty profiles under DBM-CHED Joint Circular No. 03, Series of 2022 (Guidelines on the Reclassification of Faculty Positions in SUCs) and Republic Act (RA) 8292 (Higher Education Modernization Act of 1997). This transaction is classified as 'Highly Technical' and operates as a Government to Government (G2G) service available to Regular Faculty (Internal Clients). The Checklist of Requirements includes: a Log in Receipt secured from the Office of the Faculty Evaluation; Faculty's Documents for Initial Review by the College Evaluation Committee (CEC); and Faculty's Documents for Final Review by the Institutional Evaluation Committee (IEC).",
    "keywords": [
      "Faculty Evaluation",
      "DBM-CHED Joint Circular No. 03",
      "RA 8292",
      "Regular Faculty",
      "CEC",
      "IEC",
      "Instruction Services",
      "requirements"
    ]
  },
  {
    "id": "earist_charter_2025_faculty_evaluation_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Instruction Services",
    "topic": "Faculty Evaluation Process and Timeline",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) details the Faculty Evaluation process, which has a total processing time of 65 days and 30 minutes with no fees required. The process involves the following steps: First, the Faculty submits documents and the completed Individual Summary Sheet (ISS) to the College Evaluation Committee (CEC) (15 minutes). Second, the CEC checks the veracity and completeness of documents (10 days). Third, the CEC schedules a meeting with the Faculty to discuss inquiries or missing attachments (5 days). Fourth, the Faculty complies by submitting required additional documents while the CEC/Chief assists and refers to guidelines if needed (15 days). Fifth, the Faculty finalizes the ISS with acceptable documents (5 days). Sixth, the Faculty submits the folder with the finalized ISS to the Institutional Evaluation Committee (IEC), which reviews the supporting documents (15 minutes for submission, 15 days for review). Seventh, the IEC schedules a meeting with the Faculty to discuss any deficiencies (5 days). Eighth, the Faculty finalizes the ISS, including scanning documents and checking Google links (5 days). Ninth, IEC members sign the finalized ISS (3 days). Finally, the folder is submitted to the Regional Evaluation Committee (REC) for Instructors to Associate Professors, or the Evaluation and Accreditation Committee (EAC) for Professors (2 days).",
    "keywords": [
      "Faculty Evaluation process",
      "Individual Summary Sheet",
      "ISS",
      "College Evaluation Committee",
      "Institutional Evaluation Committee",
      "Regional Evaluation Committee",
      "timeline",
      "processing steps"
    ]
  },
  {
    "id": "earist_charter_2025_vpaf_endorsement_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Vice President for Administration and Finance",
    "topic": "Endorsing Documents to the President - Overview and Requirements",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the procedure for Endorsing Documents to the President covers the period from when documents arrive for endorsement until they are transmitted to the Office of the President. This service is classified as 'Simple' and is a Government to Government (G2G) transaction available to all Institute Personnel, including both teaching and non-teaching staff. The Checklist of Requirements includes: a Clearance secured from the Human Resource Management Services (HRMS); an Individual Performance Commitment Review secured from the HRMS; an Endorsement for Travel for all departments secured from the respective Service Director or Chief of Offices; and an Endorsement of permit to conduct official activities secured from the respective Service Director or Chief of Offices.",
    "keywords": [
      "VPAF",
      "endorsement",
      "documents",
      "President",
      "clearance",
      "travel endorsement",
      "permit",
      "HRMS",
      "G2G"
    ]
  },
  {
    "id": "earist_charter_2025_vpaf_endorsement_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Vice President for Administration and Finance",
    "topic": "Endorsing Documents to the President - Process and Timeline",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the workflow for endorsing documents to the President through the Vice President for Administration and Finance (VPAF). The total processing time for this transaction is 1 Day, and no fees are required. The process consists of a single step where the client submits the request for endorsement to the VPAF. The Agency Action involves assessing and recommending the request for approval, which is the responsibility of the Vice President for Administration & Finance.",
    "keywords": [
      "VPAF",
      "processing time",
      "endorsement process",
      "approval",
      "workflow",
      "no fees"
    ]
  },
  {
    "id": "earist_charter_2025_admin_services_bur_signing_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Administrative Services",
    "topic": "Signing of Budget Utilization Request (BUR) - Overview and Requirements",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), Administrative Services provides the service of 'Signing of Budget Utilization Request (BUR)', which involves signing pertinent documents of the Institute. This transaction is classified as 'Simple' and involves Government to Government (G2G) interactions for Internal Clients. The Checklist of Requirements varies by fund type. For Fund 164, the requirements are: Official Receipt of the Performance Bond secured from the Cashier's Office; Notice of Award secured from the BAC Office; BAC Resolution secured from the BAC Office; BAC Abstract of Bids secured from the BAC Office; BAC Canvass Form secured from the BAC Office; and the Company Profile secured from the BAC Office. For Fund 101, the requirements are: Obligation Request and Status secured from Financial Management Services (FMS); Disbursement Voucher secured from FMS; Approved Letter request by the President provided by the Client; Statement of Account secured from FMS; and the Sales Invoice provided by the Client.",
    "keywords": [
      "Budget Utilization Request",
      "BUR",
      "Fund 164",
      "Fund 101",
      "BAC Office",
      "Financial Management Services",
      "Internal Clients",
      "requirements"
    ]
  },
  {
    "id": "earist_charter_2025_admin_services_bur_signing_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Administrative Services",
    "topic": "Signing of Budget Utilization Request (BUR) - Process and Timeline",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the specific workflow for the Signing of Budget Utilization Request (BUR). The total processing time is estimated at 6 minutes, and there are no fees to be paid. The process involves the following steps: The client submits the Budget of Utilization Requisition (BUR) Form. The Agency Action consists of accepting, verifying, signing the BUR, recording the transaction, and releasing the document. The persons responsible for executing these actions include the Officer In Charge, staff from Financial Management Services (FMS), and the Vice President for Administration and Finance (VPAF).",
    "keywords": [
      "BUR process",
      "processing time",
      "Officer In Charge",
      "VPAF",
      "FMS",
      "workflow",
      "signing"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_personnel_documents",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Request for Other Personnel-Related Documents",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the Human Resources Management Services (HRMS) facilitates the Request for Other Personnel-Related Documents. This service involves the retrieval or acquisition of documents documented by the Office for the benefit of concerned personnel or for legal purposes. The transaction is classified as 'Simple' and is available to all external and internal clients (G2C and G2G). The total processing time is approximately 3 days and 9 minutes with no fees required. The only requirement is a Request Letter with attachments, if any. The process involves submitting the request letter, after which the HRMS staff receives, verifies, prepares the requested personnel-related documents or reports, and releases them to the client.",
    "keywords": [
      "personnel documents",
      "retrieval",
      "request letter",
      "HRMS",
      "internal clients",
      "external clients"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_hiring_faculty_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Hiring of Temporary/Permanent Faculty Member - Requirements",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the requirements for the Hiring of Temporary or Permanent Faculty Members, a service designed to recruit qualified and competent faculty. This transaction is classified as 'Highly Technical'. Applicants must submit the following checklist of requirements: an original Application Letter; an original Personal Data Sheet/Resume; an original and one photocopy of the Official Transcript of Records; an original and one photocopy of the Certificate of Units Earned in post-graduate courses (if any); an original and one photocopy of the Certificate of Eligibility (if applicable); an original and one photocopy of Certificates of Training/Seminar-Workshops for the last five years; an original and one photocopy of the Performance Rating/IPCR (last two ratings in the present plantilla); a Birth Certificate and Marriage Certificate (if applicable) from the PSA; an NBI Clearance; and Medical and Neuropsychiatric Examination Results from an accredited hospital/clinic. Upon hiring, additional requirements include the Position Description Form, Oath of Office, Statement of Assets and Liabilities (SALN), and Assumption of Duty (CSN Form).",
    "keywords": [
      "faculty hiring",
      "teaching positions",
      "application requirements",
      "transcript of records",
      "eligibility",
      "PSA",
      "NBI clearance",
      "medical exam",
      "SALN"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_hiring_faculty_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Hiring of Temporary/Permanent Faculty Member - Process Flow",
    "content": "The Hiring of Temporary/Permanent Faculty Member process under HRMS takes approximately 18 days, 15 hours, and 12 minutes to complete. The workflow begins with the Dean submitting a request letter with the Qualification Standard. HRMS publishes the vacant position (1 hour). Applicants submit requirements (10 days allocated for receiving). HRMS screens documents and profiles applicants (3 days). The Faculty Selection Board Committee evaluates documents (1 day) and HRMS notifies applicants of the schedule. The process continues with a teaching demonstration and interview (2-5 hours), followed by a pre-employment examination for shortlisted applicants (4 hours). HRMS prepares the ranking result for the Dean's approval (2-4 days) and conducts a background check (30 minutes). Once selected, the recommendation letter is routed for approval (2 hours). The chosen applicant visits HRMS for the list of pre-employment requirements (20 minutes), submits the accomplished requirements, and undergoes orientation coordinated by L&D Staff (20 minutes).",
    "keywords": [
      "faculty hiring process",
      "teaching demonstration",
      "interview",
      "pre-employment examination",
      "Faculty Selection Board",
      "ranking result",
      "background check",
      "orientation"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_hiring_job_order",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Hiring of Job Order Personnel",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) details the Hiring of Job Order Personnel, a 'Simple' transaction taking approximately 8 hours and 23 minutes. Requirements include an original Application Letter, Personal Data Sheet/Resume, original and photocopy of the Transcript of Records, Diploma, Certificate of Eligibility (if applicable), and Performance Rating/IPCR (last two ratings). The process involves the Director/Chief waiting for the vacancy posting, followed by the submission of requirements. HR staff screens documents (3 hours) and forwards them to the concerned Director for final selection. Qualified applicants undergo interviews and examinations. HRMS prepares ranking results, notifies the supervisor, and issues the Job Offer. Finally, the hired employee submits pre-employment requirements, biometric registration is coordinated, and onboarding is conducted.",
    "keywords": [
      "Job Order",
      "JO hiring",
      "personnel selection",
      "application requirements",
      "interview",
      "onboarding",
      "biometrics"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_hiring_non_teaching_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Hiring of Permanent Non-Teaching Personnel - Requirements",
    "content": "The Hiring of Permanent Non-Teaching Personnel is a 'Highly Technical' service available to internal and external clients. The checklist of requirements includes: a Personnel Requisition Slip and Qualification Standard (secured from HRMS/Website); original Application Letter; original Personal Data Sheet/Resume; original and photocopy of Official Transcript of Records; Certificate of units earned in post-graduate courses; Certificate of Eligibility; Certificate of Training/Seminars for the last five years; Certificate of Employment (including outside government service); Performance Rating/IPCR (last two ratings); Birth and Marriage Certificates (PSA); NBI Clearance; and Medical/Neuropsychiatric Examination Results. Upon hiring, the Position Description Form, Oath of Office, SALN, and Assumption to Duty (CSN Form) are required.",
    "keywords": [
      "non-teaching hiring",
      "permanent personnel",
      "requirements",
      "eligibility",
      "training certificates",
      "employment certificate",
      "medical exam",
      "SALN"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_hiring_non_teaching_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Hiring of Permanent Non-Teaching Personnel - Process Flow",
    "content": "The process for Hiring Permanent Non-Teaching Personnel takes approximately 16 days, 16 hours, and 59 minutes. Steps include: 1) Director/Chief submits the Personnel Requisition Slip (PRS) and Qualification Standard. 2) HRMS publishes vacant positions if no applicants are available (1 hour). 3) HRMS receives application requirements (10-14 days). 4) HR Staff screens documents and forwards them to the Director/Chief (30-45 mins). 5) The Personnel Selection Board (PSB) evaluates documents (2 days) and conducts interviews (time varies). 6) Psychological tests are conducted for selected applicants (3 hours). 7) HRMS prepares ranking results for the Appointing Authority (30 mins). 8) A background check is conducted for external applicants (30 mins). 9) The recommendation letter is routed for approval (2 hours). 10) The hired personnel receives the approved letter and list of requirements, submits them for checking, and attends onboarding.",
    "keywords": [
      "non-teaching hiring process",
      "Personnel Selection Board",
      "PSB",
      "psychological test",
      "ranking result",
      "background check",
      "onboarding",
      "Personnel Requisition Slip"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_travel_authority",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Request for Travel Authority",
    "content": "The Request for Travel Authority is a 'Complex' G2G transaction for EARIST employees (Internal Clients) intending to travel outside the Philippines. The processing time is 10 days and 5 minutes. Requirements include an Approved Request Letter, an Approved Substitute letter (specifically for teaching personnel), an Itinerary, and a Ticket. The process involves submitting the request letter with attachments to HRMS. HRMS staff verifies the documents, informs the client of the release date, prepares the Travel Authority (10 days), and releases the document upon completion.",
    "keywords": [
      "Travel Authority",
      "travel abroad",
      "substitute letter",
      "itinerary",
      "internal clients",
      "employee travel"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_salary_loan_landbank",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Request for Salary Loan (Land Bank)",
    "content": "The Request for Salary Loan in Land Bank of the Philippines is a 'Simple' service for EARIST employees, taking approximately 2 days and 33 minutes. Requirements include the Landbank Electronic Salary Loan (ESL) BC List Form (from HRMS), Landbank Insurance Form (from HRMS), a photocopy of the Employee ID with specimen signatures, Pay Slips for the last 3 months (from Payroll), and a Flash Drive. The workflow requires the employee to update personal information at Landbank, fill out the forms provided by HRMS, and provide photocopies and the flash drive. HRMS staff encodes the information, lists employees in a transmittal letter, prints documents, secures the Chief's signature (1 day), photocopies requirements, and submits the package to the Cash and Disbursement Officer for direct submission to Landbank (1 day).",
    "keywords": [
      "Salary Loan",
      "Land Bank",
      "ESL",
      "loan application",
      "pay slip",
      "transmittal letter",
      "finance"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_leave_application",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Application for Leave",
    "content": "The Application for Leave is a 'Simple' G2G transaction for EARIST employees to maintain work-life balance. The total processing time is 10 minutes. Requirements consist of the Personnel Form 6 (Application for Leave). For Vacation Leave and Special Privilege Leave (SPL), the request must be filed 5 days in advance. For Sick Leave, it is filed upon arrival. The process involves the employee requesting the form from HRMS, filling it out with the recommendation of their Immediate Supervisor, securing the signature of authorized officials (President/VP/Director), and returning it to HRMS for recording.",
    "keywords": [
      "Leave Application",
      "Form 6",
      "Vacation Leave",
      "Sick Leave",
      "SPL",
      "Special Privilege Leave",
      "internal clients"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_certificate_employment",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Processing Request for Certificate of Employment",
    "content": "The Processing Request for Certificate of Employment (CoE) is a 'Simple' service available to current and former EARIST employees for separation or personal use. Processing takes approximately 3 days and 13 minutes. A critical condition is that the CoE can only be processed once the employee has accomplished their Institute Clearance. Requirements include a duly accomplished Request Slip Form (EARIST-QSF-HRMS-014) and, if claimed by a representative, an Authorization Letter and ID. The process involves submitting the slip, encoding the request in the Document Tracking System (Docutrack), validating the Institute Clearance in the database, printing the CoE, signing by the HRMS Chief, and releasing the document.",
    "keywords": [
      "Certificate of Employment",
      "CoE",
      "Institute Clearance",
      "employment verification",
      "Docutrack",
      "former employees"
    ]
  },
  {
    "id": "earist_charter_2025_hrms_service_records",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Human Resources Management Services",
    "topic": "Processing of Service Records",
    "content": "Eligible EARIST employees and former employees may request the Processing of Service Records. This is a 'Simple' transaction taking approximately 3 days and 9 minutes. The only requirement is the HRMS Request Slip Form. The agency action involves receiving the request, verifying the status of Leave Without Pay (LWOP) for posting in the draft Service Record, and forwarding the request to the HR Appointment Section. The Appointment Section verifies and updates the status of appointment, salary adjustments, and step increments. Finally, HRMS prepares and releases the requested document.",
    "keywords": [
      "Service Record",
      "employment history",
      "LWOP",
      "salary adjustment",
      "step increment",
      "appointment status"
    ]
  },
  {
    "id": "earist_charter_2025_pms_requisition_app",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Property Management Services",
    "topic": "Requisition and Issuance of Supplies (APP Based)",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the Property Management Services (PMS) handles the Requisition and Issuance of supplies based on the Annual Procurement Plan (APP). This transaction is classified as Simple and operates as a Government to Government (G2G) service for Internal Clients. The required documents are the Approved Annual Procurement Plan (APP) and the Signed Requisition and Issue Slip (RIS). The process involves the following steps: First, the Requesting Office prepares four copies of the RIS based on the Approved APP and secures the signature of the Head of the Office. Second, the prepared RIS is forwarded to the PMS Office. Third, PMS staff verify the documents and issue the requested supplies and materials. Fourth, the client accepts the delivery by signing the specific space provided on the RIS. Finally, PMS retains one copy for filing. The total processing time is approximately 20 minutes, and no fees are required.",
    "keywords": [
      "Annual Procurement Plan",
      "APP",
      "Requisition and Issue Slip",
      "RIS",
      "supplies issuance",
      "internal clients",
      "PMS"
    ]
  },
  {
    "id": "earist_charter_2025_pms_requisition_sai_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Property Management Services",
    "topic": "Requisition via Supplies Availability Inquiry (SAI)",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the procedures for requisitioning supplies using the Supplies Availability Inquiry (SAI) form, applicable when standard APP-based requisition requires verification of stock. \n\nFor supplies **not available** or requiring verification: The client submits two copies of the SAI Form. PMS staff checks the Stock Card for availability. If available and suitable, PMS signs the SAI Form, records it in the Logbook, and the client signs the Releasing Logbook. This process takes 25 minutes.\n\nFor supplies **available** at PMS: The client submits the Verified SAI Form signed by the Head of Office. PMS forwards the 'Advance Issuance of Supplies Form' for the client and Head of Office to sign. Upon submission of the accomplished Advance Issuance form, PMS prepares the items for release. The client acknowledges receipt on the form, and PMS releases the items. This process takes approximately 25 minutes.",
    "keywords": [
      "Supplies Availability Inquiry",
      "SAI",
      "Advance Issuance of Supplies",
      "stock verification",
      "unavailable supplies",
      "PMS procedures"
    ]
  },
  {
    "id": "earist_charter_2025_pms_return_property",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Property Management Services",
    "topic": "Returning of Property/Accountability",
    "content": "The procedure for Returning of Property/Accountability allows Internal Clients (Employees and Faculty) to return accountable property or equipment to Property Management Services (PMS). Requirements include the Employee's Copy of the Property Acknowledgement Receipt (PAR) and the Employee's Copy of the Inventory Custodian Slip (ICS). The process begins with the client informing the office of the intended return. PMS verifies the accountability in the employee's folder. The client must attach pictures of the property to be returned and surrender the equipment. PMS accepts the item and prepares the Property Turned-In Slip (PTIS). The client signs the PTIS, receives one copy, and PMS retains the original for the employee's file. Finally, PMS secures the returned equipment in the Storage/Stockroom. The total processing time is 25 minutes.",
    "keywords": [
      "Property Turned-In Slip",
      "PTIS",
      "Property Acknowledgement Receipt",
      "PAR",
      "Inventory Custodian Slip",
      "ICS",
      "returning equipment",
      "accountability"
    ]
  },
  {
    "id": "earist_charter_2025_pms_transfer_property",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Property Management Services",
    "topic": "Transfer of Property/Accountability",
    "content": "The Transfer of Property/Accountability procedure manages the transfer of accountable equipment between faculty and employees. This G2G transaction requires the Employee's Copy of the Property Acknowledgement Receipt (PAR) and the Inventory Custodian Slip (ICS). The workflow involves: 1) The client informs PMS of the transfer; 2) PMS verifies the accountability in the employee's folder; 3) The client attaches pictures of the equipment; 4) PMS prepares the Property Transfer Report (PTR); 5) The client signs the PTR; 6) PMS releases one copy to the client and retains the original in the employee's folder; 7) PMS releases the transferred property to the new client who acknowledges receipt. The total time for this transaction is 25 minutes.",
    "keywords": [
      "Property Transfer Report",
      "PTR",
      "transfer of accountability",
      "PAR",
      "ICS",
      "equipment transfer"
    ]
  },
  {
    "id": "earist_charter_2025_pms_receipt_inspection_goods",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Property Management Services",
    "topic": "Receipt, Inspection, Acceptance, and Recording of Procured Goods",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the procedure for Receipt, Inspection, Acceptance, and Recording of Procured Goods serves External Clients (Suppliers). Required documents include the Approved and Funded Purchase Order (PO) from the Procurement Services Office, Delivery Receipts (D.R.), and Sales Invoices (S.I.). The process initiates when the supplier notifies PMS of the delivery schedule. PMS then notifies the Inspection Committee (including the Resident Auditor, IAS, and technical experts like Jerome Saltorio for ICT) and prepares the Request for Inspection (RFI), Notice of Schedule of Deliveries (NSD), and Inspection Acceptance Report (IAR).\n\nThe items are inspected against the D.R., S.I., and PO. If delivery is partial, 'Partial Delivery' is noted. If non-conforming, items are returned for compliance. If satisfactory, the IAR is signed indicating 'Inspected, verified and found in order.' PMS prepares the Report on Satisfactory/Dissatisfactory Delivery Compliance (RSDDC) for the End-User's signature. Finally, items are recorded in Stock Cards (SC) or Subsidiary Ledger Cards (SLC) and stored in the PMS stockroom pending issuance. The process takes approximately 30 minutes.",
    "keywords": [
      "Inspection Acceptance Report",
      "IAR",
      "procured goods",
      "delivery inspection",
      "RSDDC",
      "Stock Cards",
      "Subsidiary Ledger Cards",
      "suppliers",
      "Purchase Order"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_noa_release",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Release of Notice of Award (NOA) to External Clients",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the release of the Notice of Award (NOA) is a process managed by Procurement Services for External Clients (Contractors, Suppliers, or Winning Bidders). This transaction is classified as Government to Business (G2B) and is considered 'Complex' if it extends beyond the standard Procurement Timeline. The required documents for this process include the Approved BAC Resolution for NOA (secured from the Bids and Awards Committee), the Performance Security Bond for PO and Contract Preparation, the Notarized Contract for NTP (for Civil Works & Consultancy), and the duly signed PO for NTP (for Goods). The process involves the client registering in the logbook (3 minutes) and obtaining the approved BAC Resolution, after which the Staff releases the duly signed NOA (3 minutes). The total processing time is approximately 6 minutes.",
    "keywords": [
      "Notice of Award",
      "NOA",
      "BAC Resolution",
      "External Clients",
      "Performance Security Bond",
      "Procurement Services"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_performance_security",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Acceptance of Performance Security Bond",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the procedure for the Acceptance of Performance Security Bond from External Clients. This G2B transaction is available to Contractors, Suppliers, and Winning Bidders. The checklist of requirements includes the Approved BAC Resolution for NOA, the Performance Security Bond, the Notarized Contract for Notice to Proceed (NTP) for Civil Works/Consultancy, and the duly signed Purchase Order (PO) for Goods. The workflow requires the client to register in the logbook (3 minutes) and submit the Performance Security Bond. The Chief of Procurement Services then receives, reviews, and releases the Contract signed by the Head of the Procuring Entity (HOPE) for the external client's signature and notarization (10 minutes). The total processing time is estimated at 13 minutes.",
    "keywords": [
      "Performance Security Bond",
      "HOPE",
      "Head of Procuring Entity",
      "Contract notarization",
      "G2B",
      "winning bidder"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_contract_po_issuance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Issuance of Notarized Contract and Purchase Order",
    "content": "Under the Procurement Services of the EARIST Citizen's Charter 2025 (1st Edition), the Issuance of Notarized Contract and Duly Approved Purchase Order is a 'Highly Technical' transaction (or Complex if delayed). External Clients must provide the Approved BAC Resolution, Performance Security Bond, Notarized Contract (for Civil Works), and signed PO (for Goods). The process involves the following steps: 1) The client registers in the logbook (3 minutes). 2) The Chief of Procurement Services releases one original copy of the notarized contract and serves the duly signed Purchase Order to the winning bidder for signature (20 minutes). 3) The client submits the signed/notarized contract. 4) The staff registers the documents in the releasing logbook and asks the client to sign the acknowledgment receipt.",
    "keywords": [
      "Notarized Contract",
      "Purchase Order",
      "PO issuance",
      "winning bidder",
      "acknowledgment receipt",
      "Highly Technical"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_ntp_issuance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Issuance of Notice to Proceed (NTP)",
    "content": "The Issuance of Notice to Proceed (NTP) is a service detailed in the EARIST Citizen's Charter 2025 (1st Edition) for External Clients. This process ensures the contractor or supplier receives the official authorization to begin work. Requirements include the BAC Resolution, Performance Security Bond, Notarized Contract, and signed PO. The client steps are: 1) Register in the logbook (3 minutes); 2) Sign the approved Notice to Proceed while the Chief of Procurement Services assists in discussing the NTP and coordinates with Property, Admin, and End Users (10 minutes); and 3) Acknowledge receipt of the Original Notice to Proceed in the Releasing Logbook (5 minutes). The total time for this transaction is 18 minutes.",
    "keywords": [
      "Notice to Proceed",
      "NTP",
      "contractor authorization",
      "Property Office",
      "End User coordination"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_goods_above_1m",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Procurement of Goods (1 Million and Above) - Public Bidding",
    "content": "For the Procurement of Approved Request for Goods valued at 1 Million Pesos and above, the EARIST Citizen's Charter 2025 (1st Edition) mandates Public Bidding. This 'Highly Technical' G2G service is for Internal Clients (Offices and Colleges). The primary requirement is an Approved Purchase Request (APR) with funding from Financial Management Services. The process includes: receiving and pre-numbering the APR (5 minutes); reviewing documents like Terms of Reference, Scope of Work, and Bill of Quantities (5 minutes); preparing the Invitation to Bid (ITB) (5 minutes); PhilGEPS posting (15 days); receiving RFQs/Proposals (closing hour); BAC evaluation and preparation of Abstract of Bids and Resolution (3 days); preparing the Purchase Order (10 minutes); reviewing the PO and Document Checklist (5 minutes); and signing of the PO by the End User (5 minutes). The total timeline is approximately 18 days and 2 hours.",
    "keywords": [
      "Public Bidding",
      "Goods above 1 Million",
      "PhilGEPS",
      "Invitation to Bid",
      "ITB",
      "BAC Resolution",
      "Abstract of Bids",
      "Purchase Request"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_goods_below_1m_internal",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Procurement of Goods (Below 1 Million) - Internal Process",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the Alternate Mode of Procurement for Goods valued below 1 Million Pesos from the perspective of Internal Clients. This 'Highly Technical' process requires an Approved Funded Purchase Request (APR). Key steps include: receiving and pre-numbering the APR (5 minutes); reviewing completeness and preparing the Request for Quotation (RFQ) (25 minutes); PhilGEPS Posting of RFQ (7 days); receiving RFQs from bidders (1 day); BAC preparation of Abstract of Bid Proposal and Resolution (5 days); preparing the Purchase Order (PO) based on the winning bidder (45 minutes); reviewing the PO and checklist (15 minutes); and signing of the PO by the End User (15 minutes). The total processing time is 14 days and 45 minutes.",
    "keywords": [
      "Alternate Mode of Procurement",
      "Goods below 1 Million",
      "Request for Quotation",
      "RFQ",
      "PhilGEPS",
      "Internal Clients"
    ]
  },
  {
    "id": "earist_charter_2025_procurement_goods_below_1m_external",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Procurement Services",
    "topic": "Procurement of Goods (Below 1 Million) - External Process",
    "content": "For External Clients (Contractors/Suppliers) participating in the Alternate Mode of Procurement for Goods below 1 Million Pesos, the EARIST Citizen's Charter 2025 (1st Edition) specifies a 'Simple' to 'Highly Technical' G2B workflow. Requirements include the Unquoted RFQ (from Procurement Service) and the Quoted RFQ with RA 9184 Mandatory Requirements (from the Bidder). The process involves: 1) The bidder receives the Blank RFQ form face-to-face or online (10 minutes). 2) The bidder submits the Quoted RFQ and mandatory requirements. 3) Procurement Staff accepts, reviews, and serves the duly signed Purchase Order (PO) to the external client (20 minutes). 4) The external client signs the original PO (20 minutes). The total time for these specific interaction points is 50 minutes.",
    "keywords": [
      "Alternate Mode of Procurement",
      "External Clients",
      "Quoted RFQ",
      "RA 9184",
      "Mandatory Requirements",
      "Bidder"
    ]
  },
  {
    "id": "earist_charter_2025_security_entrance",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Security Services",
    "topic": "Gain Entrance to EARIST Campus",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), Security Services manages the procedure for gaining entrance to the EARIST campus for students and visitors (External Clients). This transaction is classified as 'Simple' and operates as a Government to Citizen (G2C) service. The Checklist of Requirements includes: Student Identification and Certificate of Registration for students (secured from the Registrar Office), and Valid Identification for visitors (secured from any government or legal entity). The process differs by client type: For students entering the gate, the Security Guard on duty checks the uniform, identity, and ID validity (processing time: 5-10 seconds). For visitors entering the gate, the Security Guard asks for the purpose of the visit, checks identity, requires signing of the Visitor's Logbook, and issues a Visitor's Pass (processing time: 3-5 minutes).The total estimated processing time is 5 minutes and 10 seconds with no fees required.",
    "keywords": [
      "Security Services",
      "entrance procedure",
      "student ID",
      "visitor pass",
      "logbook",
      "campus access",
      "uniform check"
    ]
  },
  {
    "id": "earist_charter_2025_rms_online_request",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Records Management Services",
    "topic": "Online Request of Documents",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the Records Management Service (RMS) allows Internal Clients (Executive Officials, Academic/Non-Academic Personnel, and former employees) to request personal or other documents like Memoranda, Special Orders, and Staff Development Orders online. This transaction is classified as 'Simple' with a total processing time of 1 hour and 15 minutes. The process begins by accessing the RMS Facebook/Messenger account or emailing record@earist.edu.ph. If a client requests documents on behalf of another person, they must attach a scanned copy of the Clearance from the Institute Data Protection Officer or the FOI Office. The RMS staff acknowledges the receipt, and the Chief approves or disapproves the request. Upon approval, the staff locates, retrieves, and prepares the soft/scanned copy, which is then sent to the client via text or messenger within 1 hour.",
    "keywords": [
      "Online Request",
      "Records Management",
      "RMS",
      "Special Order",
      "Memoranda",
      "Data Protection Officer",
      "FOI",
      "soft copy"
    ]
  },
  {
    "id": "earist_charter_2025_rms_request_copy_file",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Records Management Services",
    "topic": "Request for a Copy of Documents on File",
    "content": "The EARIST Citizen's Charter 2025 (1st Edition) outlines the procedure for requesting photocopies of documents under the custody of the Records Management Service (RMS). This service is available to both Internal and External Clients. The transaction is classified as 'Simple' (3 days and 20 minutes) or 'Complex' (5 days and 20 minutes) depending on the nature of the retrieval. Requirements include Form No. 1 (Request for Document Form). If requesting on behalf of another, a Clearance from the Data Protection Officer or FOI Office is required. If requesting a classified confidential document, a written request approved by the Institute President is mandatory. The process involves securing and filling out the form, obtaining necessary clearances, and submitting it to RMS. The Chief checks and approves the request. Staff then locate the files (3-5 days), and finally, the client is notified via email, call, or text to claim the document.",
    "keywords": [
      "Document Request",
      "Form No. 1",
      "confidential document",
      "Institute President",
      "photocopy",
      "Data Protection Clearance"
    ]
  },
  {
    "id": "earist_charter_2025_rms_incoming_correspondence_internal",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Records Management Services",
    "topic": "Incoming Correspondence or Institute Issuances",
    "content": "The procedure for handling Incoming Correspondence or Institute Issuances is a 'Simple' G2G transaction managed by the Records Management Service (RMS). It is available to Executive Officials, Personnel, and CSGO/Manila City Hall. The process takes approximately 3 hours. First, RMS staff receive the correspondence or issuance from the originating office and record it in the incoming logbook (1 hour). Second, the staff reproduces copies for the concerned personnel or offices (1 hour). Finally, the staff records the issuance in the outgoing logbook and delivers the documents to the concerned offices, ensuring the recipient signs the outgoing logbook for acknowledgment (1 hour). No fees or specific requirements are listed for this service.",
    "keywords": [
      "Incoming Correspondence",
      "Institute Issuances",
      "logbook",
      "routing",
      "internal mail"
    ]
  },
  {
    "id": "earist_charter_2025_rms_incoming_correspondence_courier",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Records Management Services",
    "topic": "Incoming Correspondence Received from the Courier",
    "content": "For Incoming Correspondence received via Courier, the EARIST Citizen's Charter 2025 (1st Edition) establishes a 'Simple' G2C transaction taking 2 hours and 10 minutes. This service is available to Executive Officials and Personnel. The client is required to provide a photocopy of the correspondence/communication for the RMS file. The workflow involves: 1) RMS staff receive the package, stamp the date/time/signature, and the client signs the logbook (5 minutes). 2) The client provides a photocopy for the RMS file (5 minutes). 3) RMS records the item in the logbook (30 minutes). 4) RMS records the item in the outgoing logbook and delivers it to the recipient's designated office/college, securing a signature for acknowledgment (1 hour and 30 minutes).",
    "keywords": [
      "Courier",
      "package delivery",
      "incoming mail",
      "correspondence",
      "logbook recording"
    ]
  },
  {
    "id": "earist_charter_2025_rms_outgoing_correspondence",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Records Management Services",
    "topic": "Outgoing Correspondence",
    "content": "The Records Management Service (RMS) handles Outgoing Correspondence for Executive Officials and Chiefs of Offices. This 'Simple' G2G transaction involves posting or mailing written communication through postal or courier services. Requirements include the complete name and address of the recipient, a Mailing/Posting Request Form, availability of funds (verified by FMS), and a photocopy of the outgoing document for the RMS file. The process takes approximately 4 hours and 25 minutes. Clients must accomplish the request form and submit the original plus one photocopy of the document. RMS staff verify fund availability, check the document pages and attachments, prepare the mailing envelope and Registry Return Receipt Card, and record the item in the outgoing logbook. The actual mailing time (bulk requests) is estimated at 4 hours, subject to fund availability. Fees vary based on courier or postal service charges.",
    "keywords": [
      "Outgoing Correspondence",
      "mailing service",
      "postal service",
      "Registry Return Receipt",
      "courier",
      "postage fee"
    ]
  },
  {
    "id": "earist_charter_2025_rms_authentication",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Records Management Services",
    "topic": "Authentication of Documents",
    "content": "According to the EARIST Citizen's Charter 2025 (1st Edition), the Authentication of Documents validates the accuracy of documents for submission to other agencies. This 'Simple' G2G transaction is available to Internal Clients and other Government Agencies. The total processing time is 1 hour and 35 minutes for transactions involving 1-100 pages. Requirements include the original or photocopy from the original, one extra photocopy for the RMS file, and the Document Authentication Request Form. The process involves: 1) Issuing and approving the Request Form (10 minutes). 2) Verifying/validating the submitted documents against the original (10 minutes). 3) Stamping the Certificate of Authenticityeither as a 'Certified True Copy' (for original copies) or 'Certified Photo Copy' (where the original is presented before stamping). 4) Signing the documents (30 minutes) and recording them in the outgoing logbook (10 minutes) before release.",
    "keywords": [
      "Authentication",
      "Certified True Copy",
      "Certified Photo Copy",
      "document validation",
      "RMS",
      "verification"
    ]
  },
  {
    "id": "physical_plant_repair_overview_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Physical Plant and General Services",
    "topic": "Request for Job Order Repair and Maintenance - Overview and Requirements",
    "content": "The Physical Plant and General Services (SPD) department manages the Request for Job Order Repair and Maintenance of Facilities. This service is responsible for maintaining the cleanliness of the Institute vicinity and performing minor carpentry and repairs of facilities. The transaction is classified as Simple and designated as G2G (Government to Government). It is available exclusively to Internal Clients, which include EARIST Offices and Colleges. To avail of this service, clients must provide a specific checklist of requirements: an Approved Letter Request for Repair and Maintenance, and the Actual Copy of the Damaged Property or Furniture. Both requirements are secured and provided by the client.",
    "keywords": [
      "SPD",
      "repair facilities",
      "carpentry",
      "cleanliness",
      "maintenance",
      "internal clients",
      "job order request",
      "requirements"
    ]
  },
  {
    "id": "physical_plant_repair_submission_procedure",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Physical Plant and General Services",
    "topic": "Request for Job Order Repair - Submission and Approval Steps",
    "content": "The administrative procedure for requesting a Job Order Repair involves five specific steps handled by the Physical Plant and General Services (SPD) staff. First, the client submits a written request to the office of the Director of Administrative Services through the Chief of SPD (5 minutes). Second, the Administrative Staff or SPD Staff acknowledges receipt of the documents (5 minutes). Third, the transaction is recorded in the logbook (5 minutes). Fourth, the request is formally approved (5 minutes). Fifth, the Chief of SPD assigns personnel to perform the task (5 minutes). There are no fees associated with these steps. The total processing time for the submission, approval, and assignment phase is 25 minutes.",
    "keywords": [
      "submission process",
      "approval",
      "Chief SPD",
      "Director Administrative Services",
      "logbook",
      "processing time",
      "no fees"
    ]
  },
  {
    "id": "physical_plant_repair_execution_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Physical Plant and General Services",
    "topic": "Request for Repair Process - Execution Phase",
    "content": "Once a Job Order Request is approved, the Physical Plant and General Services (SPD) initiates the technical execution phase, officially titled the Request for Repair Process. This phase begins with the Chief of SPD accepting the Job Order and scheduling the repair (10 minutes). SPD Staff then identify the specific problem (10 minutes), after which the Chief of SPD assembles the necessary team and equipment (10 minutes). The staff devises the appropriate action plan (10 minutes). The actual execution of the repair follows, performed by assigned staff, with the duration depending on the severity of the problem. The process concludes with the Client or End User signing the Job Order (5 minutes). No fees are charged for this service. The total estimated time for preparation and closing is 45 minutes, excluding the variable execution time.",
    "keywords": [
      "repair execution",
      "identifying problem",
      "scheduling",
      "team assembly",
      "signing job order",
      "severity of problem",
      "technical process"
    ]
  },
  {
    "id": "transport_motorpool_vehicle_utilization_overview",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Transportation and Motorpool Services",
    "topic": "Utilization of Vehicle - Overview",
    "content": "Under Transportation and Motorpool Services, the Utilization of Vehicle service is responsible for dispatching drivers and vehicles to transport employees, faculty, and students in connection with their official functions and duties. This transaction is classified as Simple and applies to both Government to Citizen (G2C) and Government to Government (G2G) transactions. The service is available to Offices and Colleges, encompassing both internal and external clients.",
    "keywords": [
      "vehicle dispatch",
      "transportation services",
      "drivers",
      "official business",
      "internal clients",
      "external clients"
    ]
  },
  {
    "id": "transport_motorpool_vehicle_utilization_requirements",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Transportation and Motorpool Services",
    "topic": "Utilization of Vehicle - Requirements",
    "content": "The checklist of requirements listed for the Utilization of Vehicle service includes an Approved Letter Request for Repair and Maintenance and an Actual Copy of the Damaged Property. These documents are noted to be secured by the client.",
    "keywords": [
      "requirements",
      "letter request",
      "checklist",
      "client documents"
    ]
  },
  {
    "id": "transport_motorpool_vehicle_utilization_procedure",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Transportation and Motorpool Services",
    "topic": "Utilization of Vehicle - Processing Steps",
    "content": "The procedure for requesting vehicle utilization involves four steps with a total processing time of 19 minutes and no fees. First, the client submits a written request to the Office of the Director of Administrative Services, where the Admin Staff acknowledges receipt (2 minutes). Second, once the request is approved, the Motorpool Office Staff issues and signs the Trip Ticket (2 minutes). Third, the Admin Staff forwards the request to the Transportation and Motorpool Office (5 minutes). Finally, the Motorpool Office Staff schedules the request and assigns a driver and vehicle (10 minutes).",
    "keywords": [
      "processing steps",
      "trip ticket",
      "driver assignment",
      "scheduling",
      "Admin Services",
      "no fees"
    ]
  },
  {
    "id": "cash_services_enrollment_fees_collection",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Collection of Fees and Payment for Enrollment",
    "content": "Under Cash and Disbursement Services, the Collection of Fees and Payment for Enrollment involves collecting student tuition and other miscellaneous fees. This service is a simple Government to Citizen (G2C) transaction available to students (external clients). The only requirement is an Advisement Slip, which is secured from the Dean's Office. The process consists of two main steps: presenting the Advisement Slip to the Teller for verification (2 minutes) and paying the enrollment fees based on the assessment reflected in the system (3 minutes). The staff at the Cashier's Office issues an Official Receipt or Invoice upon payment. The total processing time is 5 minutes.",
    "keywords": [
      "tuition collection",
      "enrollment payment",
      "advisement slip",
      "cashier",
      "student fees"
    ]
  },
  {
    "id": "cash_services_rental_fees_collection",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Collection of Rental Fees",
    "content": "The Collection of Rental Fees service handles fees from the rentals of IGP Stalls, Venues, and Facilities. This is classified as a simple Government to Citizen (G2C) transaction available to clients and interested parties. To avail of this service, the client must secure an Order of Payment from the Financial Management Services. The process involves presenting the Order of Payment to the Teller for verification of ID and documents (2 minutes), followed by the payment of the rental amount stated in the Order (3 minutes). The Cashier's Office staff records the payment and issues an Official Receipt. The total processing time is 5 minutes.",
    "keywords": [
      "rental fees",
      "IGP stalls",
      "venue rental",
      "order of payment",
      "financial management services"
    ]
  },
  {
    "id": "cash_services_other_school_fees_collection",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Collection of Other School Fees",
    "content": "The Collection of Other School Fees covers payments for miscellaneous documents and processes, including Transcript of Records (TOR), Honorable Dismissal, Certificate of Registration, Authentication of TOR, Completion Form, Certificate of Good Moral Character, Certified True Copy of Grades, and Dropping Forms. Clients must present a Student Admission (SAD) form or Payment form secured from the Student Registration and Records Management Services (SRRMS) or the Graduate School Office. The Cashier's Office staff verifies the student in the system (2 minutes) and accepts the payment as stated in the SAD/payment form (3 minutes). Upon recording the payment, an Official Receipt is issued. The total processing time is 5 minutes.",
    "keywords": [
      "miscellaneous fees",
      "TOR payment",
      "honorable dismissal",
      "SAD form",
      "SRRMS"
    ]
  },
  {
    "id": "cash_services_online_payment_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Online Payment Thru Landbank Link.BizPortal - Process",
    "content": "The Online Payment Thru Landbank Link.BizPortal is a contactless transaction method implemented for health safety and digitalization. Requirements include the Student Number (from SRRMS), Order of Payment (from FMS), and an Email Address. The client must visit www.landbank.com, access the Link.BizPortal, and select 'Eulogio Amang Rodriguez Institute of Science and Technology' as the merchant. The client then selects a specific transaction type, fills out transaction details (Student Number, Name, Order of Payment Number, Amount, Campus, Email), and chooses a payment mode (Landbank/OF Bank ATM, BancNet, Cash Payment, or PCHC Pay Gate). After authorizing the transaction, the client prints the payment confirmation. This self-service portion has no agency processing time.",
    "keywords": [
      "online payment",
      "Landbank Link.BizPortal",
      "contactless transaction",
      "digital payment",
      "merchant selection"
    ]
  },
  {
    "id": "cash_services_online_payment_fees",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Online Payment Thru Landbank Link.BizPortal - Fee Schedule",
    "content": "For online payments via Landbank, the following fees apply based on the transaction type selected: \n1. Augmentation Fee: Computed by the school based on students per class.\n2. Comprehensive Fee (Doctoral): P 400.00.\n3. Comprehensive Fee (Master's): P 200.00.\n4. Defensive Fee (Final Doctoral/Master's): P 900.00.\n5. Pre-Oral Defensive Fee (Doctoral/Master's): P 900.00.\n6. SAD Form: P 20.00 per page.\n7. Transcript of Records: P 100.00 per page.\n8. Tuition Fee (Undergraduate): P 100.00 per unit.\n9. Tuition Fee (Masteral): P 700.00 per unit.\n10. Tuition Fee (Doctoral): P 900.00 per unit.\nFor fees not listed, clients must proceed to the EARIST Cashier's Office.",
    "keywords": [
      "fee schedule",
      "tuition rates",
      "comprehensive fee",
      "defense fee",
      "augmentation fee",
      "unit cost"
    ]
  },
  {
    "id": "cash_services_online_payment_verification",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Online Payment Thru Landbank Link.BizPortal - Verification and Release",
    "content": "After completing an online payment, clients must email the proof of payment to specific addresses based on their department: 'registrar@earist.ph.education' for SRRMS Forms and TORs, or 'graduate@earist.ph.education' for Graduate School fees (Augmentation, Comprehensive, Defense, Tuition). The bank or payment center takes approximately 3 days to transmit the list of payments. Once received, the Chief of Cash and Disbursement Services verifies the emailed proof (5 minutes), records the payment, prints the Official Receipt/Invoice (2 minutes), and releases it to the client (1 minute). The total processing time is 3 working days plus 8 minutes.",
    "keywords": [
      "payment verification",
      "email proof",
      "clearing time",
      "official receipt release",
      "registrar email",
      "graduate school email"
    ]
  },
  {
    "id": "cash_services_disbursement_of_checks",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Cash and Disbursement Services",
    "topic": "Disbursement of Checks",
    "content": "The Disbursement of Checks service involves issuing commercial or MDS checks for payment to individuals or suppliers of goods and services. Requirements include a valid Identification Card (government-issued), an Authorization Letter (if a representative is claiming), and an Official Receipt (for suppliers). The process begins with the Cashier's Office staff verifying the ID and authorization letter (2 minutes). Next, the staff prepares the Official Receipt or Collection Receipt, while the client presents the Disbursement Voucher (10 minutes). Finally, the client signs the voucher and logbook to receive the check and receipt (5 minutes). The total processing time is 17 minutes.",
    "keywords": [
      "check issuance",
      "MDS checks",
      "supplier payment",
      "disbursement voucher",
      "claim check"
    ]
  },
  {
    "id": "medical_dental_regular_consultation_checkup",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Regular Consultation and Check-up (General & Emergency)",
    "content": "Under Medical and Dental Services, the Regular Consultation and Check-up service covers the patient's journey from entry into the Medical Health Services until they are assessed and declared physically fit. This service is available to Executive Officials, Students, Employees, Faculty, and Extension Services (including Adopted Barangays and Immediate Families). It is classified as Simple and covers both G2C and G2G transactions. No documents are required for the visit. For general steps: the patient visits the clinic for assessment (10 minutes), undergoes consultation (15-20 minutes), and registers in the logbook (5 minutes). If assessed as an Emergency Case, the attending Physician or Nurse provides immediate first aid or refers the patient to a hospital of choice. The total processing time is approximately 35 minutes.",
    "keywords": [
      "emergency cases",
      "medical consultation",
      "check-up",
      "first aid",
      "clinic visit"
    ]
  },
  {
    "id": "medical_dental_non_emergency_consultation",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Regular Consultations and Check-ups for Non-Emergency Cases",
    "content": "For Non-Emergency Cases, the Medical and Dental Services provides a specific consultation procedure available to students, employees, faculty, and extension beneficiaries. The process involves three steps: the patient visits the clinic for initial assessment (20 minutes); the Medical Officer conducts the consultation, management, treatment, and prescribes medication if possible (30 minutes); and the patient checks out by registering in the logbook (10 minutes). There are no fees required. The total processing time for non-emergency consultations is 1 hour.",
    "keywords": [
      "non-emergency",
      "prescription",
      "medical treatment",
      "routine check-up"
    ]
  },
  {
    "id": "medical_dental_ojt_certificate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Medical Certificate to OJT Students",
    "content": "The Issuance of Medical Certificate to OJT Students covers the physical examination and clearance required for On-the-Job Training. This service is for students (External Clients). The required documents, secured from a laboratory of choice, include a Chest X-ray result, Complete Blood Count (Result), Urinalysis (Result), and an optional Drug Test Result. The process involves the student visiting the clinic for assessment and providing laboratory work-ups (20 minutes), followed by the Medical Officer performing the check-up and signing the Student Health Record/Medical Certificate indicating 'Fit for OJT' (30 minutes). The student then registers in the logbook (10 minutes). The total processing time is 1 hour.",
    "keywords": [
      "OJT clearance",
      "medical certificate",
      "student health record",
      "chest x-ray",
      "CBC",
      "urinalysis"
    ]
  },
  {
    "id": "medical_dental_return_to_work",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Return/Fit to Work Certificate",
    "content": "The Issuance of Return/Fit to Work Certificate is a Government to Government (G2G) service for Employees and Faculty returning to duty. Requirements include a Medical Certificate and Medical Abstract from an attending physician, and Laboratory Test Results. The Medical Officer assesses the patient and reviews the documents (20 minutes). If the client is fit, the clearance is signed (30 minutes). If the client is not yet fit (Option A), they are treated and advised for follow-up. If further treatment is needed (Option B), they are referred to a hospital or specialist. Once cleared, the Return/Fit to Work form is signed. The total processing time, assuming clearance, is approximately 2 hours.",
    "keywords": [
      "fit to work",
      "employee clearance",
      "medical abstract",
      "return to duty",
      "referral"
    ]
  },
  {
    "id": "medical_dental_permit_to_teach",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Permit to Teach",
    "content": "The Issuance of Permit to Teach is available to Executive Officials, Employees, and Faculty. This service requires the submission of Laboratory Test Results and a Medical Certificate from a laboratory/physician of choice. The procedure includes visiting the clinic for assessment (20 minutes), followed by a proper consultation where the Medical Officer reviews the medical and laboratory work-ups (30 minutes). Upon finishing the assessment, the Medical Staff signs the clearance or Permit to Teach Certificate. The client concludes the visit by registering in the logbook (10 minutes). The total processing time is 1 hour.",
    "keywords": [
      "permit to teach",
      "faculty clearance",
      "health assessment",
      "work-ups review"
    ]
  },
  {
    "id": "medical_dental_athlete_certificate",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Fit to Play/Medical Certificate to Student-Athletes",
    "content": "The Issuance of Fit to Play/Medical Certificate is designed for Student and Employee Athletes to establish their physical fitness for sports. Requirements include a Medical History (from a hospital/physician), a Physical Education Form (from the PE Department), and a Chest X-Ray Result. The process starts with a clinic visit for assessment (20 minutes). The Medical Officer then evaluates the work-up results and performs the medical examination (30 minutes). If cleared, the Fit to Play Form is issued. The total processing time is 1 hour.",
    "keywords": [
      "fit to play",
      "student athletes",
      "PE form",
      "medical history",
      "sports clearance"
    ]
  },
  {
    "id": "medical_dental_excuse_slip",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Issuance of Excuse Slip",
    "content": "The Medical and Dental Services issues Excuse Slips to students. The requirements are an Excuse Letter from Parents or Guardians and a Valid ID of the Parent or Guardian. The process involves an interview and assessment of the student (20 minutes). If the student's name is in the logbook for a previous consultation regarding the illness, an Excuse Slip is issued (20 minutes). If the patient does not have a previous consult, the Excuse Letter is acknowledged or noted, but a medical excuse slip based on clinic records cannot be generated retroactively in the same manner. The total processing time is 1 hour and 10 minutes.",
    "keywords": [
      "excuse slip",
      "medical excuse",
      "parent letter",
      "student absence",
      "clinic records"
    ]
  },
  {
    "id": "medical_dental_pre_enrollment_freshmen",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Pre-Enrollment for First-Year Students",
    "content": "Pre-Enrollment health assessment is required for all Incoming 1st Year Students. The only documentary requirement is a Chest X-Ray from a medical laboratory of choice. The student visits the clinic for a health assessment (20 minutes). The Medical Officer reviews the results and issues a Fit to Enroll Form for those who are physically well (30 minutes). Patients with findings must provide a medical certificate from an attending physician or specialist regarding their deficiency before signing the Fit to Enroll form. The total processing time is 1 hour.",
    "keywords": [
      "freshmen",
      "pre-enrollment",
      "fit to enroll",
      "chest x-ray",
      "health assessment"
    ]
  },
  {
    "id": "medical_dental_annual_physical_exam",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Annual Physical Examination (APE) for Employees",
    "content": "The Annual Physical Examination (APE) promotes overall health for Faculty and Employees (Academic and Non-Academic). The process begins with the client filling out necessary forms (1 hour). Clients are then subjected to laboratory work-ups including Chest X-ray, Blood Chemistry, Urinalysis, Fecalysis, FBS, ECG, Dental, and Eye Examination. The service provider processes these results (2 hours). Once results are ready, the client reports to the Medical Dental Services (MDS) to release results and sign the PVP (30 minutes). Faculty who are physically fit receive clearance. Patients with medical findings are given necessary treatment or referrals (1 hour). The total duration involves approximately 4 hours and 40 minutes.",
    "keywords": [
      "APE",
      "annual physical exam",
      "blood chemistry",
      "ECG",
      "employee health",
      "fecalysis"
    ]
  },
  {
    "id": "medical_dental_dental_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Medical and Dental Services",
    "topic": "Dental Check-up and Tooth Extraction",
    "content": "Dental Check-up and Tooth Extraction services are available to Executive Officials, Faculty, Employees, and Students. For students, a Registration/Enrollment Form from the Registrar (SARRMS) is required. The process involves visiting the Dental Clinic to fill out forms (30 minutes), followed by the consultation proper where dental work-up, treatment, or tooth extraction is performed by the Dental Officer (2 hours). Prescribed medication is given if necessary. The total processing time is 2 hours and 40 minutes.",
    "keywords": [
      "tooth extraction",
      "dental check-up",
      "dental clinic",
      "oral health"
    ]
  },
  {
    "id": "fms_payroll_national_city_paid",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Processing of Payroll (National/City Paid)",
    "content": "Under Financial Management Services, the Processing of Payroll (National/City Paid) involves preparing the payroll for regular salaries and personnel benefits based on the Abstract of Absences. The process includes creating payment documents and facilitating direct deposits via fund transfer. This service is available to Executive Staff, Faculty, and Non-Teaching Personnel (Internal Clients). Required documents include the Abstract of Absences (secured from HRMS) and Billings (from GSIS, LBP, Manila Teachers, Pag-ibig, PhilHealth, or EARIST Credit Cooperatives). The procedure begins with HRMS submitting the abstract, followed by payroll preparation, obligation recording (ORS/BURS), and a series of reviews and signatures by the Budget Services, Accounting Services, and the FMS Director. The total processing time is 1 day and 4 hours.",
    "keywords": [
      "payroll processing",
      "national paid",
      "city paid",
      "abstract of absences",
      "fund transfer",
      "salary"
    ]
  },
  {
    "id": "fms_teaching_honorarium_payroll",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Processing of Teaching Honorarium Payroll",
    "content": "The Processing of Teaching Honorarium Payroll manages the honoraria for regular and part-time faculty. This process uses Daily Time Records (DTRs) or Form 48 and Accomplishment Reports to create direct deposit payments. Requirements include Signed DTRs/Form 48, Accomplishment Reports (if applicable), Honorarium Budget, Designation (for initial payment), and a Certification that grades have been encoded for the last month of the semester. The procedure involves the College submitting documents, FMS staff reviewing and computing hours, preparing the payroll, and routing it for obligation and accounting reviews. The total processing time is 2 days.",
    "keywords": [
      "teaching honorarium",
      "faculty payroll",
      "part-time faculty",
      "Form 48",
      "DTR",
      "grade encoding certification"
    ]
  },
  {
    "id": "fms_payments_suppliers_contractors",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Processing of Payments to Suppliers and Contractors",
    "content": "The Processing of Payments to Suppliers/Contractors facilitates payments for goods and services, including direct deposits or checks. This service is available to EARIST units (end-users) and Suppliers/Contractors. The checklist of requirements includes an Approved Request, Annual Procurement Plan (APP), Program Procurement Management Plan (PPMP), Purchase Order/Contract, Bidding Documents, Inspection Acceptance Report (IAR), Acceptance and Acknowledgement Receipt (ARE), and Inventory Custodian Slip (ICS). The workflow moves through multiple stages: End-user submission, Budget staff review for fund availability, Procurement Service processing, Property Management Services review, and final financial processing (DV, JEV, LDDAP-ADA preparation). The total processing time is 2 days and 5 hours.",
    "keywords": [
      "supplier payment",
      "contractor payment",
      "procurement",
      "purchase order",
      "bidding documents",
      "fund availability"
    ]
  },
  {
    "id": "fms_funding_training_seminars",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Request Funding for Training and Seminars",
    "content": "The Request for Funding for Training/Seminars covers payments for permanent employees, faculty, and student leaders attending workshops and conferences. This Government to Business (G2B) transaction requires an Approved Letter Request, an Invitation from the Organizer, CHED Endorsement, Dean/Service Director Endorsement with Vice President approval, and an Itinerary of Travel. The process involves submitting the request to the FMS Director, forwarding it to the Office of the President for a Special Order (SO), and then preparing the Disbursement Voucher (DV) and Budget Utilization Request. The total processing time is 2 hours and 5 minutes.",
    "keywords": [
      "training funding",
      "seminar funding",
      "travel itinerary",
      "special order",
      "employee development"
    ]
  },
  {
    "id": "fms_financial_assistance_tes",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Processing of Financial Assistance to TES Grantees",
    "content": "The Processing of Financial Assistance to TES Grantees handles payments to student grantees under the Tertiary Education Subsidy. Requirements include an Approved Letter Request, a Qualified list of grantees from CHED, Proof of remittances (LDDAP-ADA/Check) from CHED, a Transmittal letter from CHED, and the Certificate of Registration (CORs) of grantees. The Office of Student Affairs (OSA) submits the documents. FMS staff then print Statements of Account, prepare the payroll, and process the Obligation Request and Disbursement Voucher. The workflow includes reviews by the Chief of Budget Services and Chief of Accounting Services. The total processing time is 2 days.",
    "keywords": [
      "TES grantees",
      "financial assistance",
      "CHED",
      "student subsidy",
      "tertiary education subsidy"
    ]
  },
  {
    "id": "fms_tuition_refund",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Payment of Refund of Tuition",
    "content": "The Payment of Refund of Tuition service processes refunds for students and scholarship providers (e.g., Quezon City Government). Requirements include a Request Letter, Certificate of Registration, Official Receipt of Tuition Fee, Certificate of Scholarship, Student's Statement of Account, Endorsement/List of Scholars, and an Approved Endorsement Letter from SAS. The process involves validating documents from Colleges and OSA, evaluating the refund, preparing the payroll and disbursement voucher, and obtaining signatures from multiple offices (OSA, Budget, Accounting, FMS Director, VPAF, Office of the President). The final step is the preparation and signing of the check or LDDAP. The total processing time is 2 days, 6 hours, and 30 minutes.",
    "keywords": [
      "tuition refund",
      "scholarship refund",
      "tuition fee",
      "statement of account",
      "financial reimbursement"
    ]
  },
  {
    "id": "fms_student_clearance_soa",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Financial Management Services",
    "topic": "Student Clearance and Statement of Account (SOA)",
    "content": "Financial Management Services offers two quick transactions for students: Application for Student Clearance and Issuance of Statement of Account (SOA). \n1. **Student Clearance:** Involves signing the accounting portion of the clearance form required for the Transcript of Records (TOR). Requirements are the Clearance Form and an Authorization (if the applicant is a representative). Processing time is 2 minutes.\n2. **Issuance of SOA:** Provides a system-generated SOA to support scholarship or financial assistance applications. Requirements are a Letter from the requesting agency and an Authorization (if applicable). Processing time is 2 minutes.",
    "keywords": [
      "student clearance",
      "statement of account",
      "SOA",
      "transcript of records requirements",
      "scholarship requirement"
    ]
  },
  {
    "id": "feedback_mechanism_submission_processing",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Feedback and Complaints Mechanism",
    "topic": "Feedback Submission and Processing",
    "content": "To send feedback to EARIST, clients must fill up the Client Feedback Form and drop it at the designated drop box. The EARIST ARTA Secretariat is responsible for collecting the forms, compiling data, and recording all submitted feedback. If a piece of feedback requires a response, it is forwarded to the relevant office, which is mandated to answer within three (3) days of receipt. The response is then relayed back to the client. For inquiries and follow-ups regarding feedback, clients may contact the office at (02) 8243-9460 Loc. 103 or via email at admin_arta@earist.ph.education.",
    "keywords": [
      "feedback form",
      "ARTA Secretariat",
      "response time",
      "drop box",
      "client feedback"
    ]
  },
  {
    "id": "complaint_filing_investigation_process",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Feedback and Complaints Mechanism",
    "topic": "Complaint Filing and Processing",
    "content": "Clients can file a complaint by filling out the Client Complaint Form and dropping it in the designated drop box. Alternatively, complaints can be filed by sending an email to admin_arta@earist.ph.education or by making a phone call. A valid complaint must include the Name of the Person being Complained, the Incident, and Evidence. The EARIST ARTA Secretariat opens the complaints drop box on a weekly basis to evaluate submissions. Upon evaluation, the Administrative Officer initiates an investigation and forwards the complaint to the relevant office for action or explanation. Following the investigation, the Administrative Officer submits a report to the Head of the Agency for appropriate action and provides feedback to the client.",
    "keywords": [
      "complaint filing",
      "administrative investigation",
      "incident report",
      "evidence",
      "weekly evaluation",
      "ARTA Secretariat"
    ]
  },
  {
    "id": "agency_contact_information_arta_pcc",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "Feedback and Complaints Mechanism",
    "topic": "Contact Information for EARIST and Oversight Agencies",
    "content": "For inquiries, follow-ups, and escalation of concerns, the following contact information is provided. EARIST Main inquiries can be directed to (02) 8243-9460 Loc. 103. Official emails include president@earist.ph.education for the Office of the President and admin_arta@earist.ph.education for the ARTA office. External oversight agencies can be reached as follows: Anti-Red Tape Authority (ARTA) at complaints@arta.gov.ph or 8478 5093; Presidential Complaint Center (PCC) at 8888; and the Contact Center ng Bayan (CCB) via SMS at 0908-881-6565.",
    "keywords": [
      "contact directory",
      "ARTA",
      "Presidential Complaint Center",
      "8888",
      "CCB",
      "hotlines"
    ]
  },
  {
    "id": "office_directory_executive_specialized",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "List of Offices",
    "topic": "Directory of Executive and Specialized Offices",
    "content": "The following is the directory for Executive and Specialized Offices at the EARIST Main Campus (Nagtahan, Sampaloc, Manila). All offices can be reached via the trunkline 8-234-94-60 with their respective local numbers:\n\n* **Office of the President:** Located at the 2nd floor, Administrative Bldg. (Local 101).\n* **Office of the Vice President of Academic Affairs:** Located at the 2nd floor, Old Science Bldg. (Local 131).\n* **Office of Internal Audit Services:** Located at the 2nd floor, Old Science Bldg. (Local 121).\n* **Office of the Planning Services:** Located at the 2nd floor, Old Science Bldg. (Local 102).\n* **Office of the Project Management Unit:** Located at the 2nd floor, Apilado Bldg. (Local 148).\n* **Office of the Management Information Services (MIS):** Located at the 4th floor, MIS Bldg. (Local 136).\n* **Office of the Information and Public Affairs:** Located at the 2nd floor, Administrative Bldg. (Local 134).\n* **Office of the Institute Web Services:** Located at the Ground floor, CIT Bldg. (Local 144).\n* **Office of the International Affairs and Linkages:** Located at the Ground floor, Nudas Bldg. (Local 121).\n* **Office of the Business Development Center:** Located at the Ground floor, Nudas Bldg. (Local 130).",
    "keywords": [
      "Office of the President",
      "VP Academic Affairs",
      "Internal Audit",
      "Planning Services",
      "MIS",
      "Public Affairs",
      "International Affairs",
      "office locations",
      "contact numbers"
    ]
  },
  {
    "id": "office_directory_academic_student_support",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "List of Offices",
    "topic": "Directory of Academic Support and Student Services",
    "content": "The following is the directory for Academic Support and Student Services at the EARIST Main Campus. All offices use the trunkline 8-234-94-60:\n\n* **Office of the Library Services:** Located at the 2nd floor, Library Bldg. (Local 122).\n* **Office of the Research Development:** Located at the 3rd floor, MIS Bldg. (Local 117).\n* **Office of the Extension and Community Services:** Located at the Ground floor, Apilado Bldg. (Local 115).\n* **Office of the Quality Assurance Services:** Located at the Ground floor, Apilado Bldg. (Local 105).\n* **Office of the Student Registration and Records Management Services (SRRMS):** Located at the Ground floor, Apilado Bldg. (Local 133).\n* **Office of the Admission Services:** Located at the Ground floor, Apilado Bldg. (Local unspecified).\n* **Office of the Guidance, Counselling, and Testing Services:** Located at the Ground floor, Apilado Bldg. (Local 145).\n* **Office of the National Service Training Program (NSTP):** Located at the 2nd floor, Library Bldg. (Local 146).",
    "keywords": [
      "Library Services",
      "Research Development",
      "Extension Services",
      "Quality Assurance",
      "Registrar",
      "Admission",
      "Guidance Counseling",
      "NSTP",
      "directory"
    ]
  },
  {
    "id": "office_directory_admin_general_services",
    "source": "EARIST Citizen's Charter 2025 (1st Edition)",
    "category": "List of Offices",
    "topic": "Directory of Administrative and General Services",
    "content": "The following is the directory for Administrative, Finance, and General Services offices at the EARIST Main Campus. All offices use the trunkline 8-234-94-60:\n\n* **Office of the Vice President for Administrative and Finance:** Located at the 2nd floor, Library Bldg. (Local 104).\n* **Office of the Administrative Services:** Located at the 3rd floor, MIS Bldg. (Local 103).\n* **Office of the Human Resource Management Services:** Located at the Ground floor, Apilado Bldg. (Local 120).\n* **Office of the Property Management Services:** Located at the Ground floor, Apilado Bldg. (Local 130).\n* **Office of the Procurement Services:** Located at the Ground floor, Apilado Bldg. (Local 129).\n* **Office of the Security Services:** Located at the 2nd floor, Library Bldg. (Local 150).\n* **Office of the Records Management Services:** Located at the 3rd floor, MIS Bldg. (Local 132).\n* **Office of the Physical Plant and General Services:** Located at the Ground floor, Apilado Bldg. (Local unspecified).\n* **Office of the Transportation and Motorpool Services:** Located at the Ground floor, Apilado Bldg. (Local 137).\n* **Office of the Cash and Disbursement Services:** Located at the Ground floor, Apilado Bldg. (Local 106).\n* **Office of the Medical and Dental Services:** Located at the Ground floor, Apilado Bldg. (Local 124).\n* **Office of the Financial Management Services:** Located at the Ground floor, Apilado Bldg. (Local 118).",
    "keywords": [
      "VP Admin and Finance",
      "Human Resources",
      "Property Management",
      "Procurement",
      "Security",
      "Records Management",
      "Physical Plant",
      "Motorpool",
      "Cashier",
      "Medical Services",
      "Financial Management"
    ]
  }
]