[
  {
    "id": "earist_cafa_bfa_program_overview",
    "source": "EARIST BFA Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Architecture and Fine Arts (CAFA), offers the Bachelor of Fine Arts program. This curriculum, effective as of June 2018, requires a total of 180 units for completion. The program structure spans four academic years and one summer term, incorporating general education, technical artistic skills, and professional courses.",
    "keywords": [
      "EARIST",
      "CAFA",
      "Bachelor of Fine Arts",
      "BFA",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cafa_bfa_year_1_curriculum",
    "source": "EARIST BFA Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the Bachelor of Fine Arts at EARIST is divided into two semesters. The First Semester requires 26 credited units and includes foundational courses: Drawing I (DRAWING1), Materials I/Modeling 1 (MATRALS1), Techniques I/Freehand Drawing 1 (TECHNOS1), Visual Perception 1/Elements of Visual Arts (VISPERC1), and History of World Arts (HISTWART). General education subjects include Contextualized Communication in Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), and National Service Training Program 1 (NSTPROG1). The Second Semester also requires 26 credited units. Major courses include Drafting and Perspective (DRAFTPER), Drawing II (DRAWING2), Materials II/Modeling 2 (MATRALS2), Techniques II/Freehand Drawing 2 (TECHNOS2), and Visual Perception 2/Concept of Visual Organization (VISPERC2). General subjects include Mathematics in the Modern World (GEMATHMW), Philippine Literature (GEPANIPI), Fitness Exercises (GEPEFTE), and NSTP 2.",
    "keywords": [
      "First Year",
      "Drawing",
      "Visual Perception",
      "Materials",
      "Techniques",
      "General Education",
      "NSTP"
    ]
  },
  {
    "id": "earist_cafa_bfa_year_2_curriculum",
    "source": "EARIST BFA Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST Bachelor of Fine Arts program focuses on intermediate visual studies and ethics. The First Semester consists of 23 credited units featuring Materials III/Concept, Techniques, Process (MATRALS3), Techniques III/Color and Form 1 (TECHNQS3), and Visual Studies 1/Composition 1 (VISSTUD1). Required general education courses are Gender and Society (GEELECGS), Living in Information Technology Era (GEELECIT), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Sinesosyedad (GESINEPP), and Understanding the Self (GEUNDETS). The Second Semester requires 26 credited units. It continues with Materials IV (MATRALS4), Techniques IV/Color and Form 2 (TECHNQS4), Visual Studies 2/Composition 2 (VISSTUD2), and Oriental Arts (ORIEARTS). Additional requirements include Art Appreciation (GEARTAPP), Business Correspondence and Research Writing (GEELECCP), Ethics (GEETHICS), Mathematics in the Modern World (GEMATHMW), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Visual Studies",
      "Color and Form",
      "Composition",
      "Oriental Arts",
      "Ethics",
      "Gender and Society"
    ]
  },
  {
    "id": "earist_cafa_bfa_year_3_curriculum",
    "source": "EARIST BFA Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST Bachelor of Fine Arts program introduces advanced digital tools and painting concepts. The First Semester (24 units) comprises Advanced Visual Studies 1 (ADVISTU1), Art Theory 1 (ARTTHEO1), Art Workshop 1/Adobe Photoshop (ARTWORK1), Basic to Advance Photography (BTAPHOTO), and Painting 1/Exploration and Analysis of Concept (PAINTING1). General subjects include The Contemporary World, Readings in Philippine History, and Philippine Art. The Second Semester (24 units) includes Advanced Visual Studies 2 (ADVISTU2), Art Theory 2 (ARTTHEO2), Art Workshop 2/Corel Draw (ARTWORK2), Costume & Fashion Design (FASHDES), Gallery Visit and Cultural Heritage Tour (GACULHER), Practical Data Science (GEELECDS), Science and Technology (GESCIENTS), and Painting 2/Portfolio Presentation (PAINTING2). The Summer term requires Cooperative Education/On-the-Job Training (COOPEDUC), which consists of 200 hours and grants 3 credited units.",
    "keywords": [
      "Third Year",
      "Painting",
      "Adobe Photoshop",
      "Corel Draw",
      "Photography",
      "Fashion Design",
      "OJT",
      "Internship"
    ]
  },
  {
    "id": "earist_cafa_bfa_year_4_curriculum",
    "source": "EARIST BFA Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum",
    "topic": "Fourth Year Coursework and Thesis",
    "content": "The Fourth Year of the EARIST Bachelor of Fine Arts program is dedicated to research, seminars, and final thesis production. The First Semester (14 units) includes Art Seminar 1/Art Issues 1 (ARTSEMR1), Art Work 3/Print Art (ARTWORK3), Environmental Science (GEELECES), and Research Methods in the Arts (RESMETAR), which is a 5-unit course. The Second Semester (14 units) marks the completion of the program with Art Seminar 2/Art Issues (ARTSEMR2), Art Workshop 4/Installation Art and Mural Painting (ARTWORK4), The Life and Works of Rizal (GELIFEWR), and the capstone Thesis course (THESISPT), which carries 5 credited units. This final year ensures students are prepared for professional practice through installation art, mural painting, and academic research.",
    "keywords": [
      "Fourth Year",
      "Thesis",
      "Research Methods",
      "Art Seminar",
      "Print Art",
      "Installation Art",
      "Mural Painting",
      "Rizal"
    ]
  }
]
[
  {
    "id": "earist_cafa_bfa_vc_program_overview",
    "source": "EARIST BFA-VC Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Visual Communication)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Architecture and Fine Arts (CAFA), offers a Bachelor of Fine Arts program specializing in Visual Communication. This curriculum, effective as of June 2018, requires a total of 186 units for completion. The program structure spans four academic years and includes a summer term for cooperative education.",
    "keywords": [
      "EARIST",
      "CAFA",
      "Bachelor of Fine Arts",
      "Visual Communication",
      "BFA-VC",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cafa_bfa_vc_year_1_curriculum",
    "source": "EARIST BFA-VC Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Visual Communication)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the Bachelor of Fine Arts (Visual Communication) at EARIST is divided into two semesters. The First Semester requires 29 credited units and includes Living in Information Technology Era (GEELECIT), Contextualized Communication in Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), History of World Arts (HISTWART), Lettering (LETTRING), Materials I/Modeling 1 (MATRALS1), National Service Training Program 1 (NSTPROG1), Techniques I/Freehand Drawing 1 (TECHNQS1), and Visual Perception 1/Elements of Visual Arts (VISPERC1). The Second Semester requires 26 credited units. Courses include Drafting and Perspective (DRAFTPER), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Materials II/Modeling 2 (MATRALS2), NSTP 2 (NSTPROG2), Oriental Arts (ORIEARTS), Techniques II/Freehand Drawing 2 (TECHNOS2), and Visual Perception 2/Concept of Visual Organization (VISPERC2).",
    "keywords": [
      "First Year",
      "Lettering",
      "Visual Perception",
      "Materials",
      "Techniques",
      "Freehand Drawing",
      "General Education"
    ]
  },
  {
    "id": "earist_cafa_bfa_vc_year_2_curriculum",
    "source": "EARIST BFA-VC Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Visual Communication)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BFA Visual Communication program focuses on digital design and photography. The First Semester (26 units) includes Digital Design 1 (DGTLDES1), Figure Drawing 1 (FIGDRAW1), Gender and Society (GEELECGS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Sinesosyedad/Pelikulang Panlipunan (GESINEPP), Understanding the Self (GEUNDETS), Photography 1 (PHOTOGH1), Production Technique 1 (PRODTEC1), and Visual Communication Design 1 (VISCODE1). The Second Semester (23 units) continues these sequences with Digital Design 2 (DGTLDES2), Figure Drawing 2 (FIGDRAW2), Art Appreciation (GEARTAPP), Communicative Proficiency in Business Correspondence and Research Writing (GEELECCP), Physical Activity Towards Health and Fitness II (GEPEHEF2), Photography 2 (PHOTOGH2), Production Technique 2 (PRODTEC2), and Visual Communication Design 2 (VISCODE2).",
    "keywords": [
      "Second Year",
      "Digital Design",
      "Figure Drawing",
      "Photography",
      "Production Technique",
      "Visual Communication Design",
      "VISCODE"
    ]
  },
  {
    "id": "earist_cafa_bfa_vc_year_3_curriculum",
    "source": "EARIST BFA-VC Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Visual Communication)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BFA Visual Communication program advances into design theory and specialized media. The First Semester (24 units) comprises Design Theory (DGTHEORY), Digital Design 3 (DGTLDES3), The Contemporary World (GECONTWO), Readings in Philippine History (GEREADPH), Philippine Art (PHILARTS), Basic to Advanced Textile Design (TEXTDESI), Visual Communication Design 3 (VISCODE3), and Visual Verbal Communication (VISVERCO). The Second Semester (24 units) includes Creative Research (CREATRES), Digital Design 4 (DGTLDES4), Costume & Fashion Design (FASHDES), Practical Data Science (GEELECDS), Ethics (GEETHICS), Science, Technology and Society (GESCIETS), Problem in Visual Communication (PROVISCO), and Visual Communication Design 4 (VISCODE4). The Summer term requires Cooperative Education/On-the-Job Training (COOPEDUC), consisting of 200 hours for 3 credited units.",
    "keywords": [
      "Third Year",
      "Textile Design",
      "Design Theory",
      "Visual Verbal Communication",
      "Fashion Design",
      "Creative Research",
      "OJT"
    ]
  },
  {
    "id": "earist_cafa_bfa_vc_year_4_curriculum",
    "source": "EARIST BFA-VC Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Visual Communication)",
    "topic": "Fourth Year Coursework and Thesis",
    "content": "The Fourth Year of the EARIST BFA Visual Communication program focuses on professional portfolio development, packaging design, and thesis. The First Semester (17 units) includes Environmental Science (GEELECES), The Life and Works of Rizal (GELIFEWR), Basic to Advanced Package Design (PACKDESI), Portfolio (PRTFOLIO), and Research Methods in Visual Communication (RESMETVC), which is a 5-unit course. The Second Semester (14 units) concludes the degree with Basic to Advanced Print Making (PRINTMAK), Seminar in Creative Management (SEMCREMA), Visual Merchandising (VISMECHA), and the capstone Thesis (THESISVC), which carries 5 credited units.",
    "keywords": [
      "Fourth Year",
      "Package Design",
      "Portfolio",
      "Research Methods",
      "Print Making",
      "Visual Merchandising",
      "Thesis",
      "Creative Management"
    ]
  }
]
[
  {
    "id": "earist_cafa_bsarchi_program_overview",
    "source": "EARIST BS Architecture Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Architecture)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Architecture and Fine Arts (CAFA), offers the Bachelor of Science in Architecture program. This curriculum, effective as of June 2018, requires a total of 214 units for completion. The program is a five-year course that includes general education, technical architectural training, and industry immersion.",
    "keywords": [
      "EARIST",
      "CAFA",
      "Bachelor of Science in Architecture",
      "BSArch",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cafa_bsarchi_year_1_curriculum",
    "source": "EARIST BS Architecture Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Architecture)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Architecture program focuses on design fundamentals and visual communication. The First Semester (24 credited units) includes Architectural Design 1 (Introduction to Design), Architectural Visual Communication 1 (Graphics 1), History of Architecture 1, Theory of Architecture 1, and Architectural Visual Communication 2 (Visual Techniques 1). General subjects include Contextualized Communication in Filipino, Mathematics in the Modern World, Movement Enhancement, Solid Mensuration, and NSTP 1. The Second Semester (25 credited units) advances to Building Technology 1 (Building Materials), Architectural Design 2 (Creative Design and Fundamentals), Architectural Visual Communication 3 (Graphics 2), Architectural Interiors, Theory of Architecture 2, and Architectural Visual Communication 4 (Visual Techniques 2). It also requires Differential and Integral Calculus, Filipino sa Iba't ibang Disiplina, Fitness Exercises, and NSTP 2.",
    "keywords": [
      "First Year",
      "Architectural Design",
      "Visual Communication",
      "History of Architecture",
      "Building Technology",
      "Calculus",
      "Solid Mensuration"
    ]
  },
  {
    "id": "earist_cafa_bsarchi_year_2_curriculum",
    "source": "EARIST BS Architecture Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Architecture)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Architecture program introduces technical systems and structural concepts. The First Semester (23 credited units) covers Building Utilities 1 (Plumbing and Sanitary Systems), Architectural Design 3 (Creative Design in Architectural Interiors), History of Architecture 2, Tropical Design, and Architectural Visual Communication 5 (Visual Techniques 3). General courses include Art Appreciation, The Contemporary World, Physical Activity Towards Health and Fitness 1, and Science, Technology and Society. The Second Semester (25 credited units) includes Building Technology 2 (Construction Drawings in Wood, Steel, and Concrete for 1-Storey), Architectural Design 4 (Space Planning 1), History of Architecture 3, Statics of Rigid Bodies, and Surveying. Additional general courses are Living in Information Technology Era, Physical Activity Towards Health and Fitness II, Purposive Communication, and Readings in Philippine History.",
    "keywords": [
      "Second Year",
      "Building Utilities",
      "Tropical Design",
      "Space Planning",
      "Statics",
      "Surveying",
      "Construction Drawings"
    ]
  },
  {
    "id": "earist_cafa_bsarchi_year_3_curriculum",
    "source": "EARIST BS Architecture Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Architecture)",
    "topic": "Third Year Coursework and Summer Immersion",
    "content": "The Third Year of the BS Architecture program focuses on advanced construction, digital tools, and structural theory. The First Semester (20 credited units) includes Building Technology 3 (Construction Drawings for 2-Storey Residential), Building Utilities 2 (Electrical, Electronics, and Mechanical Systems), Computer-Aided Design and Drafting 1 (ARCADD11), Architectural Design 5 (Space Planning 2), History of Architecture 4, and Strength of Materials. The Second Semester (24 credited units) covers Building Technology 4 (Specification Writing and Quantity Surveying), Building Utilities 3 (Acoustics and Lighting Systems), Computer-Aided Design and Drafting 2/BIM (ARCADD12), Architectural Design 6 (Site Development, Planning, and Landscaping), Planning 1 (Site Planning and Landscape Architecture), Professional Practice 1 (Laws), Practical Data Science, and Theory of Structures. The Summer term requires Industry Immersion (3 units), which has extensive prerequisites including Surveying, Strength of Materials, Statics, Calculus, and various Visual Communication courses.",
    "keywords": [
      "Third Year",
      "CADD",
      "BIM",
      "Strength of Materials",
      "Theory of Structures",
      "Planning",
      "Acoustics",
      "Lighting",
      "Industry Immersion"
    ]
  },
  {
    "id": "earist_cafa_bsarchi_year_4_curriculum",
    "source": "EARIST BS Architecture Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Architecture)",
    "topic": "Fourth Year Coursework",
    "content": "The Fourth Year of the BS Architecture program emphasizes urban design and professional practice. The First Semester (20 credited units) includes Architectural Design 7 (Community Architecture and Urban Design), Building Technology 5 (Alternative Building Construction Systems), Planning 2 (Fundamentals of Urban Design and Community Architecture), Professional Practice 2 (Administering Regular Services), Steel and Timber Design, and The Life and Works of Rizal. The Second Semester (20 credited units) covers Research Method for Architecture, Architectural Design 8 (Design of Complex Structure), Specialization 1 (Construction Project Management), Planning 3 (Introduction to Urban and Regional Planning), Professional Practice 3 (Global Practice in the 21st Century), and Ethics.",
    "keywords": [
      "Fourth Year",
      "Urban Design",
      "Community Architecture",
      "Steel and Timber Design",
      "Construction Management",
      "Research Methods",
      "Complex Structures"
    ]
  },
  {
    "id": "earist_cafa_bsarchi_year_5_curriculum",
    "source": "EARIST BS Architecture Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Architecture)",
    "topic": "Fifth Year Coursework and Thesis",
    "content": "The Fifth Year of the BS Architecture program is the capstone year focused on thesis and specialized management. The First Semester (16 credited units) includes Business Management and Application for Architecture 1, Architectural Structures, Architectural Design 9 (Thesis Research Writing), Specialization 2 (Construction Time Management), and Human Settlements and Housing. The Second Semester (14 credited units) concludes the degree with Specialization 3 (Construction Resource Management), Business Management and Application for Architecture 2, Understanding the Self, and Architectural Design 10 (Thesis Research Application).",
    "keywords": [
      "Fifth Year",
      "Thesis",
      "Construction Management",
      "Housing",
      "Human Settlements",
      "Business Management",
      "Architectural Structures"
    ]
  }
]
[
  {
    "id": "earist_cbpa_bsba_hrm_program_overview",
    "source": "EARIST BSBA-HRM Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Business and Public Administration (CBPA), offers the Bachelor of Science in Business Administration program specializing in Human Resource Management. This curriculum, effective as of June 2018, requires a total of 140 units for completion. The program structure spans four academic years and concludes with a 600-hour practicum requirement.",
    "keywords": [
      "EARIST",
      "CBPA",
      "Bachelor of Science in Business Administration",
      "BSBA",
      "Human Resource Management",
      "HRM",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cbpa_bsba_hrm_year_1_curriculum",
    "source": "EARIST BSBA-HRM Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSBA (Human Resource Management) program is divided into two semesters. The First Semester (26 units) includes Administrative Office Procedure and Management (ADOPMNGT), Administrative Work Values and Accountability (ADWOVAAC), Movement Enhancement (GEPEMOVE), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Human Resource Management (HURSMNGT), Keyboarding and Documents Processing 1 (KEYDOCPR), National Service Training Program 1 (NSTPROG1), and Management/Organization and Management (ORGNMNGT). The Second Semester (20 units) includes Ethics (GEETHICS), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Good Governance and Social Responsibility (GOVSORES), NSTP Civic Welfare Training Service 2 (NSTP-CWTS_2), and Recruitment and Selection (RCRTSELC).",
    "keywords": [
      "First Year",
      "Administrative Office Procedure",
      "Human Resource Management",
      "Recruitment and Selection",
      "Good Governance",
      "Keyboarding",
      "NSTP"
    ]
  },
  {
    "id": "earist_cbpa_bsba_hrm_year_2_curriculum",
    "source": "EARIST BSBA-HRM Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSBA-HRM program focuses on fundamental business laws, economics, and specialized HR functions. The First Semester (23 units) comprises Accounting for Service and Trading Industry (ACCOUNT1), Filipino sa Iba't ibang Disiplina (GEFILDIS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Science and Technology (GESCIENTS), Labor Laws and Legislation (LBRLWLEG), Microeconomics (MICROECO), Operations Management/TQM (OPTNMNGT), and Training and Development (TRNGDEVT). The Second Semester (20 units) covers Accounting for Merchandising Industry (ACCOUNT2), Compensation Administration (COMPEADM), Entrepreneurial Management (ENTREMGT), Art Appreciation (GEARTAPP), The Contemporary World (GECONTWO), Physical Activity Towards Health and Fitness II (GEPEHEF2), and Labor Relations & Negotiations (LBRRLNEG).",
    "keywords": [
      "Second Year",
      "Accounting",
      "Labor Law",
      "Microeconomics",
      "Training and Development",
      "Compensation Administration",
      "Labor Relations",
      "Entrepreneurial Management"
    ]
  },
  {
    "id": "earist_cbpa_bsba_hrm_year_3_curriculum",
    "source": "EARIST BSBA-HRM Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the EARIST BSBA-HRM program emphasizes research, taxation, and organizational development. The First Semester (18 units) includes The Life and Works of Rizal (GELIFEWR), Philippine Literature (GEPHILIT), Purposive Communication (GEPURPCO), Business Research in HRM/Thesis 1 (HRBUSRS1), Income Taxation (INCMTAXN), and Project Management (PROJMNGT). The Second Semester (18 units) includes Taxation 2/Business Taxation (BUSITAXN), Franchising (FRANCHIS), Business Research in HRM/Thesis 2 (HRBUSRS2), International Business and Trade (INTLBATT), Managerial Accounting (MGRLACCT), and Organizational Development (ORGNDEVT).",
    "keywords": [
      "Third Year",
      "Business Research",
      "Thesis",
      "Income Taxation",
      "Project Management",
      "Franchising",
      "Managerial Accounting",
      "Organizational Development"
    ]
  },
  {
    "id": "earist_cbpa_bsba_hrm_year_4_curriculum",
    "source": "EARIST BSBA-HRM Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum",
    "topic": "Fourth Year Coursework and Practicum",
    "content": "The Fourth Year of the EARIST BSBA-HRM program concludes the degree with legal studies, strategic management, and internship. The First Semester (9 units) requires Business Law/Obligations & Contract (BUSLWOBL), Special Topics in HRM (SPCLHRDM), and Strategic Management (STRAMNGT). The Second Semester (6 units) is dedicated entirely to the HRM Practicum (HRDMPRAC), which requires 600 hours of on-the-job training.",
    "keywords": [
      "Fourth Year",
      "Business Law",
      "Strategic Management",
      "Special Topics in HRM",
      "Practicum",
      "Internship",
      "OJT"
    ]
  }
]
[
  {
    "id": "earist_cbpa_bsba_mktg_program_overview",
    "source": "EARIST BSBA-MKTG Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Marketing Management)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Business and Public Administration (CBPA), offers the Bachelor of Science in Business Administration program specializing in Marketing Management. This curriculum, effective as of June 2018, requires a total of 146 units for completion. The program is designed to provide students with a strong foundation in business marketing, advertising, and research over the course of four academic years.",
    "keywords": [
      "EARIST",
      "CBPA",
      "Bachelor of Science in Business Administration",
      "BSBA",
      "Marketing Management",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cbpa_bsba_mktg_year_1_curriculum",
    "source": "EARIST BSBA-MKTG Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Marketing Management)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSBA (Marketing Management) program is divided into two semesters. The First Semester (26 units) includes Administrative Work Values and Accountability (ADWOVAAC), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), Human Resource Management (HURSMNGT), Keyboarding and Documents Processing 1 (KEYDOCPR), Microeconomics (MICROECO), National Service Training Program 1 (NSTPROG1), and Management/Organization and Management (ORGNMNGT). The Second Semester (23 units) introduces the major with Business Marketing (BUSIMKTG). Other courses include Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Fitness Exercises (GEPEFITE), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Good Governance and Social Responsibility (GOVSORES), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Business Marketing",
      "Microeconomics",
      "Management",
      "Good Governance",
      "NSTP"
    ]
  },
  {
    "id": "earist_cbpa_bsba_mktg_year_2_curriculum",
    "source": "EARIST BSBA-MKTG Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Marketing Management)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSBA Marketing Management program focuses on core business functions and specialized marketing strategies. The First Semester (20 units) requires Accounting for Service and Trading Industry (ACCOUNT1), The Contemporary World (GECONTWO), Filipino sa Iba't ibang Disiplina (GEFILDIS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Purposive Communication (GEPURPCO), Marketing Management (MKTGMNGT), and Retail Management (RETLMNGT). The Second Semester (23 units) covers Accounting for Merchandising Industry (ACCOUNT2), Advertising (ADVERTSG), Consumer Behavior (CONSBHVR), The Life and Works of Rizal (GELIFEWR), Physical Activity Towards Health and Fitness II (GEPEHEF2), Market Research and Consumer Behavior (MKTRESCH), Product Management (PRODMNGT), and Sales Management (SALEMNGT).",
    "keywords": [
      "Second Year",
      "Marketing Management",
      "Advertising",
      "Consumer Behavior",
      "Retail Management",
      "Sales Management",
      "Product Management",
      "Accounting"
    ]
  },
  {
    "id": "earist_cbpa_bsba_mktg_year_3_curriculum",
    "source": "EARIST BSBA-MKTG Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Marketing Management)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSBA Marketing Management program emphasizes entrepreneurship, taxation, and research. The First Semester (21 units) includes Distribution Management (DISTMNGT), Entrepreneurial Management (ENTRMNGT), Franchising (FRANCHIS), Philippine Literature (GEPHILIT), Income Taxation (INCMTAXN), Managerial Accounting (MGRLACCT), and Business Research in Marketing Management/Thesis 1 (MMBUSRS1). The Second Semester (15 units) includes Taxation 2/Business Taxation (BUSITAXN), Ethics (GEETHICS), Business Research in Marketing Mgt./Thesis 2 (MMBUSRS2), Pricing and Costing (PRICSTRA), and Professional Salesmanship (PROFSALE).",
    "keywords": [
      "Third Year",
      "Distribution Management",
      "Franchising",
      "Thesis",
      "Business Research",
      "Pricing and Costing",
      "Taxation",
      "Managerial Accounting"
    ]
  },
  {
    "id": "earist_cbpa_bsba_mktg_year_4_curriculum",
    "source": "EARIST BSBA-MKTG Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Marketing Management)",
    "topic": "Fourth Year Coursework and Practicum",
    "content": "The Fourth Year of the BSBA Marketing Management program concludes with legal and strategic studies followed by an internship. The First Semester (12 units) requires Business Law/Obligations & Contract (BUSLWOBL), International Business and Trade (INTLBATT), Operations Management/TQM (OPTNMNGT), and Strategic Management (STRAMNGT). The Second Semester (6 units) is dedicated entirely to the Marketing Practicum (MKTGPRAC), which requires 600 hours of training and has Business Research in Marketing Mgt. (Thesis 2) as a prerequisite.",
    "keywords": [
      "Fourth Year",
      "Business Law",
      "International Business",
      "Strategic Management",
      "Practicum",
      "Internship",
      "OJT"
    ]
  }
]
[
  {
    "id": "earist_coe_bsce_program_overview",
    "source": "EARIST BSCE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Civil Engineering)",
    "topic": "Program Overview and Summary",
    [cite_start]"content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Engineering, offers the Bachelor of Science in Civil Engineering (BSCE) program. This curriculum, effective as of June 2018, requires a total of 194 units for completion. The program structure spans four academic years and one summer term, covering general education, fundamental engineering sciences, and specialized civil engineering disciplines[cite: 234, 278, 279].",
    "keywords": [
      "EARIST",
      "College of Engineering",
      "Bachelor of Science in Civil Engineering",
      "BSCE",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_coe_bsce_year_1_curriculum",
    "source": "EARIST BSCE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Civil Engineering)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Civil Engineering program at EARIST lays the foundation in mathematics and sciences. [cite_start]The First Semester (29 units) includes Civil Engineering Orientation (CEENG111), Differential Calculus (CENMAT01), Mathematics for Engineers (CENMATH 111), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), Chemistry for Engineers (NATSCI SP_102), and National Service Training Program 1 (NSTPROG1)[cite: 235]. [cite_start]The Second Semester (27 units) includes Computer Fundamentals and Programming (COM_SP_212), Engineering Drawing and Plans (DRW 101A), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Calculus II/Integral Calculus (MATH_104), Physics for Engineers/Calculus Based (NATSCI103A), and NSTP 2 (NSTPROG2)[cite: 238].",
    "keywords": [
      "First Year",
      "Calculus",
      "Chemistry",
      "Physics",
      "Engineering Drawing",
      "Computer Fundamentals",
      "NSTP"
    ]
  },
  {
    "id": "earist_coe_bsce_year_2_curriculum",
    "source": "EARIST BSCE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Civil Engineering)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSCE program introduces core engineering mechanics and surveying. [cite_start]The First Semester (25 units) comprises Computer Aided Drafting (CAD 101), Fundamentals of Surveying (CVL 311A), Differential Equations (DIFFEQUA), Engineering Economy (EECO_311), Communicative Proficiency in Business Correspondence and Research Writing (GEADCPBR), The Contemporary World (GECONTWO), The Life and Works of Rizal (GELIFEWR), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Statics of Rigid Bodies (STRIGBOD)[cite: 244]. [cite_start]The Second Semester (26 units) covers Mechanics of Deformable Bodies (CENMECDB), Construction Materials and Testing (CVENG221), Engineering Data Analysis (CVENG222), Engineering Surveys (CVENG223), Geology for Civil Engineering (CVENG224), Practical Data Science (GEADDPDS), Ethics (GEETHICS), Physical Activity Towards Health and Fitness II (GEPEHEF2), and Dynamics of Rigid Bodies (MCH 322)[cite: 249].",
    "keywords": [
      "Second Year",
      "Surveying",
      "Statics of Rigid Bodies",
      "Dynamics of Rigid Bodies",
      "Mechanics of Deformable Bodies",
      "Engineering Economy",
      "Geology"
    ]
  },
  {
    "id": "earist_coe_bsce_year_3_curriculum",
    "source": "EARIST BSCE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Civil Engineering)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BSCE program focuses on structural theory and specialized engineering fields. [cite_start]The First Semester (25 units) includes Environmental Science and Engineering (CENENVIR), Engineering Utilities 1 (CVENG311), Engineering Utilities 2 (CVENG312), Highway and Railroad Engineering (CVENG313), Numerical Solution to CE Problems (CVENG314), Structural Theory (CVENG315), Engineering Management (CVENG316), and Living in Information Technology Era (GEELECIT)[cite: 258]. [cite_start]The Second Semester (24 units) covers Technopreneurship (CENTECNO), Building System Design (CVENG321), Hydraulics (CVENG322), Principles of Reinforced/Prestressed Concrete (CVENG323), Principles of Steel Design (CVENG324), Timber Design (CVENG325), and Hydrology (CVENG327)[cite: 260]. [cite_start]The Summer term requires On-the-Job Training (CENOTJOB), which consists of 300 hours and carries 3 credited units[cite: 260].",
    "keywords": [
      "Third Year",
      "Structural Theory",
      "Reinforced Concrete",
      "Steel Design",
      "Hydraulics",
      "Hydrology",
      "Highway Engineering",
      "OJT"
    ]
  },
  {
    "id": "earist_coe_bsce_year_4_curriculum",
    "source": "EARIST BSCE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Civil Engineering)",
    "topic": "Fourth Year Coursework",
    "content": "The Fourth Year of the EARIST BSCE program includes advanced projects and professional specialization courses. [cite_start]The First Semester (18 units) includes CE Project 1 (CVENG411), Geotechnical Engineering 1/Soil Mechanics (CVENG413), Principles of Transportation Engineering (CVENG414), and three specialized professional courses: Water Resources and Coastal Engineering (CVENGSP1), Earthquake Engineering (CVENGSP2), and Bridge Engineering (CVENGSP3)[cite: 266]. [cite_start]The Second Semester (17 units) concludes with CE Project 2 (CVENG422), Construction Methods and Project Management (CVENG423), Quantity Surveying (CVENG427), specialized courses in Construction Cost Engineering (CVENGSP4) and Foundation Engineering (CVENGSP5), and CE Laws, Ethics and Contracts (CVENG 421)[cite: 269].",
    "keywords": [
      "Fourth Year",
      "Geotechnical Engineering",
      "Transportation Engineering",
      "Earthquake Engineering",
      "Bridge Engineering",
      "Construction Management",
      "Quantity Surveying",
      "CE Laws"
    ]
  }
]
[
  {
    "id": "earist_coe_bsche_program_overview",
    "source": "EARIST BSChE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Chemical Engineering)",
    "topic": "Program Overview and Summary",
    [cite_start]"content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Engineering, offers the Bachelor of Science in Chemical Engineering (BSChE) program. This curriculum, effective as of June 2018, requires a total of 200 units for completion[cite: 184]. [cite_start]The program structure spans four academic years and one summer term, designed to prepare students with foundational sciences, engineering principles, and specialized technical skills[cite: 137, 139, 140].",
    "keywords": [
      "EARIST",
      "College of Engineering",
      "Bachelor of Science in Chemical Engineering",
      "BSChE",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_coe_bsche_year_1_curriculum",
    "source": "EARIST BSChE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Chemical Engineering)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Chemical Engineering program focuses on general sciences and mathematics. [cite_start]The First Semester (27 units) includes Differential Calculus (CENMAT01), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Science, Technology and Society (GESCIETS), Chemistry for Engineers (NATSCI SP_102), and National Service Training Program 1 (NSTPROG1)[cite: 140]. [cite_start]The Second Semester (23 units) advances to Analytical Chemistry (CHE 102), Art Appreciation (GEARTAPP), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Calculus II/Integral Calculus (MATH_104), Physics for Engineers/Calculus Based (NATSCI103A), and NSTP 2 (NSTPROG2)[cite: 143].",
    "keywords": [
      "First Year",
      "Analytical Chemistry",
      "Calculus",
      "Physics",
      "NSTP",
      "General Education"
    ]
  },
  {
    "id": "earist_coe_bsche_year_2_curriculum",
    "source": "EARIST BSChE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Chemical Engineering)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSChE program introduces specialized chemistry and core engineering mechanics. [cite_start]The First Semester (26 units) comprises Organic Chemistry (ALCHE_03A), Chemical Engineering Calculations (CHE0211A), Differential Equations (DIFFEQUA), Engineering Mechanics (EEMCH 211), The Life and Works of Rizal (GELIFEWR), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Understanding the Self (GEUNDETS), and Engineering Data Analysis (MM16)[cite: 150]. [cite_start]The Second Semester (24 units) includes Physical Chemistry for Engineers 1 (ALCHE_04), Fundamentals of Material Science and Engineering (ALCHE_05), Introduction to Transport Phenomena and Momentum Transfer (CHENG _02), Chemical Engineering Thermodynamics (CHENG_03), Advanced Engineering Math in CHE (CHENG 04), Computer Aided Design (GENCAD 111), Physical Activity Towards Health and Fitness II (GEPEHEF2), and Strength of Materials (STROFMAT)[cite: 151].",
    "keywords": [
      "Second Year",
      "Organic Chemistry",
      "Thermodynamics",
      "Transport Phenomena",
      "Material Science",
      "Computer Aided Design",
      "Engineering Mechanics"
    ]
  },
  {
    "id": "earist_coe_bsche_year_3_curriculum",
    "source": "EARIST BSChE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Chemical Engineering)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BSChE program focuses on advanced thermodynamic systems and reaction engineering. [cite_start]The First Semester (27 units) includes Introduction to Biotechnology (ALCHE306), Environmental Science and Engineering (CENENVIR), Heat and Mass Transfer (CHENG306), Physical Chemistry for Engineers 2 (CHENG307), Solution Thermodynamics (CHENG308), Methods of Research (CHENG309), Computer Application in ChE (CHENG310), Electrical Standards and Practices (EEENG411), and Communicative Proficiency in Business Correspondence (GEELECCP)[cite: 160]. [cite_start]The Second Semester (26 units) covers Basic and Inferential Statistics (ALCHE308), Engineering Economy (CENENECO), Chemical Reaction Engineering (CHENG311), Chemical Engineering Lab (CHENG312), Particle Technology (CHENG313), Separation Processes (CHENG314), Chemical Process Industries (CHENG315), Track Specialization 1/Paints and Coatings (CHENG316), and Living in Information Technology Era (GMELECHT)[cite: 163]. [cite_start]The Summer term requires On-the-Job Training (CENOTJOB), consisting of 300 hours for 3 credited units[cite: 163].",
    "keywords": [
      "Third Year",
      "Heat Transfer",
      "Mass Transfer",
      "Reaction Engineering",
      "Biotechnology",
      "Separation Processes",
      "OJT",
      "Paints and Coatings"
    ]
  },
  {
    "id": "earist_coe_bsche_year_4_curriculum",
    "source": "EARIST BSChE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Chemical Engineering)",
    "topic": "Fourth Year Coursework",
    "content": "The Fourth Year of the EARIST BSChE program involves capstone design projects and specialized professional tracks. [cite_start]The First Semester (19 units) includes Chemical Engineering Design 1 (CHENG417), Biochemical Engineering (CHENG418), Chemical Engineering Lab 2 (CHENG419), Chemical Process Lab (CHENG420), Engineering Management (CVENG316), The Contemporary World (GECONTWO), Ethics (GEETHICS), Process Safety (CHENG421), and Track Specialization 2/Air Pollution (CHENG422)[cite: 167]. [cite_start]The Second Semester (25 units) concludes with Chemical Engineering Laws and Ethics (CHENG423), Chemical Engineering Design 2 (CHENG424), Process Dynamics and Control (CHENG425), Technopreneurship (CENTECNO), Industrial Waste Management and Control (CHENG426), Field Trips and Seminars (CHENG427), Quantitative Methods in Management (CHENG428), Track Specialization 3/Energy Engineering (CHENG429), and Course Integration (CHENG430)[cite: 174].",
    "keywords": [
      "Fourth Year",
      "Plant Design",
      "Process Control",
      "Safety",
      "Biochemical Engineering",
      "Energy Engineering",
      "Air Pollution",
      "Waste Management"
    ]
  }
]
[
  {
    "id": "earist_coe_bscpe_program_overview",
    "source": "EARIST BSCpE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Computer Engineering)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Engineering, offers the Bachelor of Science in Computer Engineering (BSCpE) program. This curriculum, effective as of June 2018, requires a total of 183 units for completion. The program structure spans four academic years and one summer term, combining electrical engineering fundamentals with computer science and hardware design.",
    "keywords": [
      "EARIST",
      "College of Engineering",
      "Bachelor of Science in Computer Engineering",
      "BSCpE",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_coe_bscpe_year_1_curriculum",
    "source": "EARIST BSCpE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Computer Engineering)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Computer Engineering program establishes the technical and mathematical foundations of the discipline. The First Semester (26 units) includes Computer Aided Drafting (CENCAD 111), Differential Calculus (CENMAT01), Mathematics for Engineers (CENMATH 111), and Computer Engineering as a Discipline (CPENG111). General courses include Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Chemistry for Engineers (NATSCI SP_102), and National Service Training Program 1 (NSTPROG1). The Second Semester (27 units) introduces programming with Object Oriented Programming (CPE 112) and Programming Logic and Design (CPE 113). Additional requirements include Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Integral Calculus (MATH_104_5C), Engineering Data Analysis (MATH 122), Physics for Engineers/Calculus Based (NATSCI103A), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Computer Aided Drafting",
      "Calculus",
      "Object Oriented Programming",
      "Physics",
      "Engineering Data Analysis",
      "NSTP"
    ]
  },
  {
    "id": "earist_coe_bscpe_year_2_curriculum",
    "source": "EARIST BSCpE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Computer Engineering)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSCpE program advances into circuit theory and software algorithms. The First Semester (26 units) comprises Data Structures and Algorithm Analysis (CPENG211), Differential Equations (DIFFEQUA), Fundamentals of Electrical Circuits (EEENG211), Art Appreciation (GEARTAPP), Practical Data Science (GEELECDS), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Purposive Communication (GEPURPCO). The Second Semester (25 units) covers Engineering Economy (CENENECO), Numerical Methods (CPENG221), Software Design (CPENG222), Fundamentals of Electronic Circuits (ECENG221), The Contemporary World (GECONTWO), The Life and Works of Rizal (GELIFEWR), Physical Activity Towards Health and Fitness II (GEPEHEF2), and Science, Technology and Society (GESCIETS).",
    "keywords": [
      "Second Year",
      "Data Structures",
      "Electrical Circuits",
      "Electronic Circuits",
      "Software Design",
      "Numerical Methods",
      "Data Science"
    ]
  },
  {
    "id": "earist_coe_bscpe_year_3_curriculum",
    "source": "EARIST BSCpE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Computer Engineering)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BSCpE program focuses on hardware-software integration and networks. The First Semester (24 units) includes Environmental Science and Engineering (CENENVIR), Cognate/Elective Course 1 (CPEELEC1), Logic Circuits and Design (CPENG311), Data and Digital Communications (CPENG312), CPE Drafting & Design (CPENG313), Operating Systems (CPENG314), Discrete Mathematics (CPENG315), and Fundamentals of Mixed Signal & Sensors (MXSIGSEN). The Second Semester (21 units) includes Technopreneurship (CENTECNO), Cognate/Elective Course 2 (CPEELEC2), Basic Occupational Health & Safety (CPENG321), Computer Network and Security (CPENG322), Microprocessors (CPENG323), CpE Laws and Professional Practice (CPENG324), and Engineering Management (CVENG316). The Summer term requires On-the-Job Training (CENOTJOB), which consists of 300 hours and carries 3 credited units.",
    "keywords": [
      "Third Year",
      "Logic Circuits",
      "Operating Systems",
      "Computer Networks",
      "Security",
      "Microprocessors",
      "OJT",
      "Technopreneurship"
    ]
  },
  {
    "id": "earist_coe_bscpe_year_4_curriculum",
    "source": "EARIST BSCpE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Computer Engineering)",
    "topic": "Fourth Year Coursework",
    "content": "The Fourth Year of the EARIST BSCpE program is dedicated to capstone design and advanced computer architecture. The First Semester (20 units) includes Methods of Research (CPENG411), Computer Architecture and Organization (CPENG412), Embedded Systems (CPENG413), Emerging Technologies in CpE (CPENG414), CpE Practice and Design 1 (CPENG415), Feedback and Control System (CPENG416), and Communicative Proficiency in Business Correspondence (GEELECCP). The Second Semester (11 units) concludes the degree with Cognate/Elective Course 3 (CPEELEC3), CPE Practice and Design 2 (CPENG421), Digital Signal Processing (CPENG422), Introduction to HDL (CPENG423), and Seminars and Field Trips (CPENG424).",
    "keywords": [
      "Fourth Year",
      "Embedded Systems",
      "Computer Architecture",
      "Capstone Design",
      "Digital Signal Processing",
      "HDL",
      "Feedback and Control",
      "Research Methods"
    ]
  }
]
[
  {
    "id": "earist_ccje_bscrim_program_overview",
    "source": "EARIST BS Criminology Curriculum Checklist (Effective June 2018)",
    "category": "College of Criminal Justice Education Curriculum",
    "topic": "Program Overview and Summary",
    [cite_start]"content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Criminal Justice Education, offers the Bachelor of Science in Criminology program[cite: 103, 104, 105]. [cite_start]This curriculum, effective as of June 2018, requires a total of 176 units for completion[cite: 138, 139]. [cite_start]The program provides comprehensive training in law enforcement, criminal law, forensics, and social sciences[cite: 106, 116, 125].",
    "keywords": [
      "EARIST",
      "College of Criminal Justice Education",
      "Bachelor of Science in Criminology",
      "BS Crim",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_ccje_bscrim_year_1_curriculum",
    "source": "EARIST BS Criminology Curriculum Checklist (Effective June 2018)",
    "category": "College of Criminal Justice Education Curriculum",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Criminology program lays the foundation for understanding crime and society. [cite_start]The First Semester requires 26 credited units, consisting of Introduction to Criminology (C1INTCRI), Art Appreciation (GEARTAPP), Gender and Society (GEELECGS), Ethics (GEETHICS), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Fundamentals of Martial Arts (GEPEFOMA), Readings in Philippine History (GEREADPH), and NSTP Military Training Service 1 (NSTPMTS1)[cite: 106]. [cite_start]The Second Semester requires 30 credited units, including Human Behavior and Victimology (C2HUMBEV), Introduction to Philippine Criminal Justice System (CLIPCJS), Living in Information Technology Era (GMELECHT), Filipino sa Iba't ibang Disiplina (GEFILDIS), Arnis and Disarming Techniques (GEPEAADT), Purposive Communication (GEPURPCO), Science, Technology and Society (GESCIETS), Understanding the Self (GEUNDETS), Law Enforcement Organization and Administration (LILAEOAD), and NSTP Military Training Service 2 (NSTPMTS2)[cite: 109].",
    "keywords": [
      "First Year",
      "Introduction to Criminology",
      "Martial Arts",
      "Arnis",
      "Philippine Criminal Justice System",
      "Human Behavior",
      "Victimology",
      "Law Enforcement Organization"
    ]
  },
  {
    "id": "earist_ccje_bscrim_year_2_curriculum",
    "source": "EARIST BS Criminology Curriculum Checklist (Effective June 2018)",
    "category": "College of Criminal Justice Education Curriculum",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Criminology program focuses on theories of crime, police operations, and forensic sciences. [cite_start]The First Semester (26 credited units) includes Theories and Causes of Crime (C3THCACR), Professional Conduct and Ethical Standards (C4PECSTA), Forensic Photography (F1FORPHO), General Chemistry (Organic) (GEADCHEM), The Contemporary World (GECONTWO), Environmental Science (GEELECES), First Aid and Water Safety (GEPEFAWS), Comparative Models in Policing (L2CONOPO), and Law Enforcement Operation and Planning with Crime Mapping (L3LEPCMP)[cite: 116]. [cite_start]The Second Semester (23 credited units) covers Dispute Resolution and Crises/Incidents Management (C5DRCIMA), Fundamentals of Criminal Investigation and Intelligence (CD1FCIN), Technical English 1 Investigative Report Writing and Presentation (CD2IRWP1), Criminal Law Book 1 (CL2CLBO1), Personal Identification Techniques (F2PEIDTE), Forensic Chemistry and Toxicology (F3FOCHTO), and Fundamentals of Marksmanship (GEPEFUMM)[cite: 118].",
    "keywords": [
      "Second Year",
      "Forensic Photography",
      "Crime Mapping",
      "Criminal Law",
      "Marksmanship",
      "Forensic Chemistry",
      "Toxicology",
      "Criminal Investigation"
    ]
  },
  {
    "id": "earist_ccje_bscrim_year_3_curriculum",
    "source": "EARIST BS Criminology Curriculum Checklist (Effective June 2018)",
    "category": "College of Criminal Justice Education Curriculum",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Criminology program advances into specialized corrections, technical forensics, and legal forms. [cite_start]The First Semester (28 credited units) includes Juvenile Delinquency and Juvenile Justice System (C6JDAJJS), Institutional Corrections (CA1INSCO), Technical English 2 (Legal Forms) (CD3TELF2), Traffic Management and Accident Investigation with Driving (CD4TMAID), Character Formation 1 - Nationalism and Patriotism (CFLMINAP), Criminal Law Book 2 (CL3CLBO2), Questioned Documents Examination (F4QUDOEX), Lie Detection Techniques (F5LIDETE), and Introduction to Industrial Security Concepts (L4INSECO)[cite: 125]. [cite_start]The Second Semester (27 credited units) includes Criminological Research 1 (Research Methods with Applied Statistics) (C7CRIMAS), Non-Institutional Corrections (CA2NOICO), Specialized Crime Investigation 1 with Legal Medicine (CD5SCI1M), Fire Protection and Arson Investigation (CD7FPTAI), Vice and Drug Education and Control (CD8VDEAC), Introduction to Cybercrime and Environmental Laws and Protection (CD9INCYB), Character Formation 2 (CFLM2LDM), Evidence (CL4EVIDE), and Forensic Ballistics (F6FORBAL)[cite: 128].",
    "keywords": [
      "Third Year",
      "Juvenile Delinquency",
      "Institutional Corrections",
      "Traffic Management",
      "Lie Detection",
      "Polygraphy",
      "Forensic Ballistics",
      "Cybercrime",
      "Legal Medicine"
    ]
  },
  {
    "id": "earist_ccje_bscrim_year_4_curriculum",
    "source": "EARIST BS Criminology Curriculum Checklist (Effective June 2018)",
    "category": "College of Criminal Justice Education Curriculum",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the BS Criminology program is the final academic year, focusing on research completion, court processes, and internship. [cite_start]The First Semester requires 16 credited units, comprising Criminological Research 2 (Thesis Writing and Presentation) (C8CR2TWP), Therapeutic Modalities (CA3THEMO), Specialized Crime Investigation 2 with Simulation in Interrogation and Interview (CD6SCI21), Criminal Procedure and Court Testimony (CL5CPCTE), Human Rights Education (CL6HURIE), and Internship (OJT 1) which consists of 180 hours (CP1IOJT1)[cite: 134]. [cite_start]The curriculum checklist indicates that the Second Semester has no listed courses, as the total unit count of 176 is achieved upon completion of the First Semester of the Fourth Year[cite: 137, 139].",
    "keywords": [
      "Fourth Year",
      "Thesis",
      "Therapeutic Modalities",
      "Criminal Procedure",
      "Court Testimony",
      "Internship",
      "OJT",
      "Human Rights"
    ]
  }
]
Based on the `BSCS.pdf` document provided, here is the JSON array of Semantic Chunks.

```json
[
  {
    "id": "earist_cas_bscs_program_overview",
    "source": "EARIST BSCS Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Computer Science)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Arts and Sciences (CAS), offers the Bachelor of Science in Computer Science (BSCS) program. This curriculum, effective as of June 2018, requires a total of 168 units for completion. The program structure spans four academic years, covering foundational computing concepts, software engineering, intelligent systems, and a capstone thesis project.",
    "keywords": [
      "EARIST",
      "CAS",
      "Bachelor of Science in Computer Science",
      "BSCS",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cas_bscs_year_1_curriculum",
    "source": "EARIST BSCS Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Computer Science)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Computer Science program establishes the fundamentals of programming and general education. The First Semester (26 units) includes Computer Programming 1/Fundamentals of Programming (FPROGLAB/FPROGLEC), Introduction to Computing (INTROCOMP), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), and National Service Training Program 1 (NSTPROG1). The Second Semester (32 units) advances to Database Management Systems (DBMGTLAB/DBMGTLEC), Discrete Structure 1 (DISSTRU1), and Computer Programming 2/Intermediate Programming (IPROGLAB/IPROGLEC). Additional requirements include Filipino sa Iba't ibang Disiplina (GEFILDIS), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Computer Programming",
      "Database Management System",
      "Discrete Structure",
      "NSTP",
      "Introduction to Computing"
    ]
  },
  {
    "id": "earist_cas_bscs_year_2_curriculum",
    "source": "EARIST BSCS Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Computer Science)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSCS program focuses on algorithms, digital logic, and networking. The First Semester (20 units) comprises Digital Logic Design (DIGDELAB/DIGDELEC), Discrete Structure 2 (DISSTRU2), Data Structures and Algorithm (DSALGLAB/DSALGLEC), Object-Oriented Programming (OOPRGLAB/OOPRGLEC), Physics for Computer Scientists (PHYCSLAB/PHYCSLEC), Communicative Proficiency in Business Correspondence (GEELECCP), and Physical Activity Towards Health and Fitness 1 (GEPEHEF1). The Second Semester (18 units) covers Differential and Integral Calculus (CALCULUS), Graphics and Visual Computing (GPXVCLAB/GPXVCLEC), Information Management (INFOMGMT), Microprocessor & Introduction to Robotics (MICROBOT), Networks and Communications (NETCOMMS), Programming Language (PROGLLAB/PROGLLEC), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Data Structures",
      "Object-Oriented Programming",
      "Digital Logic",
      "Robotics",
      "Networks",
      "Calculus"
    ]
  },
  {
    "id": "earist_cas_bscs_year_3_curriculum",
    "source": "EARIST BSCS Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Computer Science)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the EARIST BSCS program introduces advanced computing theory and software engineering. The First Semester (19 units) includes Algorithm and Complexity (ALGCMPLX), Application Development and Emerging Technology (APDEVLAB/APDEVLEC), Architecture and Organization (ARCHIORG), Human Computer Interaction (HUCOMINT), Intelligent Systems (INTELSYS), Operating System (OPERSYST), and Software Engineering 1 (SOFTENG1). The Second Semester (18 units) initiates the research phase with Thesis 1 (CSTHESI1). Other courses include Practical Data Science (GEELECDS), Mobile Application Development (MOBAPLAB/MOBAPLEC), Modeling and Simulation (MOSIMLAB/MOSIMLEC), Parallel and Distributed Computing (PARACOMP), and Software Engineering 2 (SOFENGLA/SOFTENG2).",
    "keywords": [
      "Third Year",
      "Software Engineering",
      "Thesis",
      "Intelligent Systems",
      "Operating System",
      "Mobile Application Development",
      "Data Science"
    ]
  },
  {
    "id": "earist_cas_bscs_year_4_curriculum",
    "source": "EARIST BSCS Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Computer Science)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the EARIST BSCS program concludes the degree with advanced theory, final thesis defense, and industry immersion. The First Semester (20 units) includes Automata Theory and Formal Language (AUTOMATA), Thesis 2 Lecture and Laboratory (CSTHESI2/CSTHESL2), The Contemporary World (GECONTWO), Environmental Science (GEELECES), Understanding the Self (GEUNDETS), Information Assurance and Security (INFOASEC), and Social Issues and Professional Practice (SSUPPRAC). The Second Semester (15 units) is dedicated to Practicum/Internship (CSINTERN) which carries 6 units, Ethics (GEETHICS), Readings in Philippine History (GEREADPH), and Industry Observation & Field Trips (INDOBSFT).",
    "keywords": [
      "Fourth Year",
      "Thesis",
      "Automata Theory",
      "Information Assurance",
      "Security",
      "Internship",
      "Practicum",
      "Industry Observation"
    ]
  }
]
```
[
  {
    "id": "earist_ced_bse_filipino_program_overview",
    "source": "EARIST BSE-Filipino Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Filipino)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, offers the Bachelor of Secondary Education (BSE) program with a major in Filipino. This curriculum, effective as of June 2018, requires a total of 185 units for completion. The program structure spans four academic years and focuses on Filipino linguistics, literature, and pedagogical skills.",
    "keywords": [
      "EARIST",
      "College of Education",
      "Bachelor of Secondary Education",
      "BSE",
      "Major in Filipino",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_ced_bse_filipino_year_1_curriculum",
    "source": "EARIST BSE-Filipino Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Filipino)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSE Filipino program establishes foundations in language and general education. The First Semester (32 units) includes Introduksyon sa Pag-aaral ng Wika (FILINPWK), Ang Filipino sa Kurikulum ng Batayang Edukasyon (FILKRKLM), Panimulang Linggwistika (FILPANLG), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science and Technology (GESCIENTS), NSTP Literacy Training Service 1 (NSTPLTS1), and National Service Training Program 1 (NSTPROG1). The Second Semester (32 units) includes Estruktura ng Wikang Filipino (FILESWKF), Pagturo at Pagtataya ng Makrong Kasanayan Pangwika (FILPPMKP), Living in Information Technology Era (GEMELECHT), Filipino sa Iba't ibang Disiplina (GEFILDIS), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Panitikang Rehiyon (LITPANRE), NSTP Literacy Training Service 2 (NSTPLTS2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Linguistics",
      "Filipino Curriculum",
      "NSTP",
      "Literacy Training Service",
      "Regional Literature"
    ]
  },
  {
    "id": "earist_ced_bse_filipino_year_2_curriculum",
    "source": "EARIST BSE-Filipino Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Filipino)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSE Filipino program focuses on instructional materials, culture, and professional education. The First Semester (26 units) comprises Paghahanda at Ebalwasyon ng Kagamitang Panturo (FILPGEBA), Ugnayan ng Wika, Kultura at Lipunan (FILUWKAL), Communicative Proficiency in Business Correspondence and Research Writing (GEADCPBR), The Contemporary World (GECONTWO), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Kulturang Popular (LITKUPOP), The Child and Adolescent Learners and Learning Principles (PEDCALLP), and The Teaching Profession (PEDITPRO). The Second Semester (26 units) covers Masining na Talakayan (FILMASTL), Practical Data Science (GEADDPS), Ethics (GEETHICS), Physical Activity Towards Health and Fitness II (GEPEHEF2), Maikling Kuwento at Nobelang Filipino (LITMKNBF), Sanaysay at Talumpati (LITSANTA), Panunuring Pampanitikan (LITSURIP), The Teacher and the Community, School Culture, and Organizational Leadership (PEDTCSOL), and Technology for Teaching and Learning 1 (PEDTFTAL).",
    "keywords": [
      "Second Year",
      "Instructional Materials",
      "Popular Culture",
      "Teaching Profession",
      "Literary Criticism",
      "Short Story",
      "Novel"
    ]
  },
  {
    "id": "earist_ced_bse_filipino_year_3_curriculum",
    "source": "EARIST BSE-Filipino Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Filipino)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSE Filipino program advances into specialized language discourse, translation, and research. The First Semester (27 units) includes Barayti at Baryasyon ng Wika (FILBBWKA), Introduksyon sa Pamamahayag (FILHAYAG), Mga Natatanging Diskurso sa Wika at Panitikan (FILNDWKP), Introduksyon sa Pagsasalin (FILSALIN), Introduksyon sa Pananaliksik-Wika at Panitikan (FILSPWKP), Technology for Teaching and Learning 2/Filipino (FILTCHLR), Assessment of Learning 1 (PEDASOL1), Facilitating Learner-Centered Teaching (PEDFALCT), and Foundation of Special and Inclusive Education (PEDFOSIE). The Second Semester (24 units) covers Filipino Para sa Natanging Gamit (ELECFIGM), Filipino bilang Ikalawang Wika (ELECFIWK), Pananaliksik sa Wika at Panitikan (ELECWKPN), Dulang Filipino (LITDULAF), Panulaang Filipino (LITULAFL), Assessment of Learning 2 (PEDASOL2), Building and Enhancing New Literacies Across the Curriculum (PEDBELAC), and The Teacher and The School Curriculum (PEDTSCUR).",
    "keywords": [
      "Third Year",
      "Translation",
      "Journalism",
      "Research",
      "Inclusive Education",
      "Assessment of Learning",
      "Filipino Poetry",
      "Filipino Drama"
    ]
  },
  {
    "id": "earist_ced_bse_filipino_year_4_curriculum",
    "source": "EARIST BSE-Filipino Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Filipino)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the BSE Filipino program is dedicated to field study and teaching internship. The First Semester (12 units) includes Paghahanda sa Iba't Ibang Kasanayan (ELECPIIK), Competencies Enhancement Program (PEDCOPRO), Field Study 1 (PEDFSTDY1), and Field Study 2 (PEDFSTDY2). The Second Semester (6 units) consists entirely of the Teaching Internship (PEDNTERN).",
    "keywords": [
      "Fourth Year",
      "Field Study",
      "Teaching Internship",
      "Competencies Enhancement",
      "Practicum"
    ]
  }
]
[
  {
    "id": "earist_ced_bse_math_program_overview",
    "source": "EARIST BSE-Math Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Mathematics)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, offers the Bachelor of Secondary Education (BSE) program with a major in Mathematics. This curriculum, effective as of June 2018, requires a total of 177 units for completion. The program structure spans four academic years and covers advanced mathematical theories, pedagogical strategies, and practical teaching experiences.",
    "keywords": [
      "EARIST",
      "College of Education",
      "Bachelor of Secondary Education",
      "BSE",
      "Major in Mathematics",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_ced_bse_math_year_1_curriculum",
    "source": "EARIST BSE-Math Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Mathematics)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSE Mathematics program establishes the mathematical foundation and general education requirements. The First Semester (29 units) includes College and Advanced Algebra (MATHCADA), History of Mathematics (MATHHIMA), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), NSTP Literacy Training Service 1 (NSTPLTS1), and National Service Training Program 1 (NSTPROG1). The Second Semester (32 units) includes Logic and Set Theory (MATHLOGC), Plane and Solid Geometry (MATHPSGE), Trigonometry (MATHTRIG), Living in Information Technology Era (GEELECIT), Filipino sa Iba't ibang Disiplina (GEFILDIS), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), NSTP Literacy Training Service 2 (NSTPLTS2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Algebra",
      "History of Mathematics",
      "Logic",
      "Set Theory",
      "Geometry",
      "Trigonometry",
      "NSTP"
    ]
  },
  {
    "id": "earist_ced_bse_math_year_2_curriculum",
    "source": "EARIST BSE-Math Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Mathematics)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSE Mathematics program introduces calculus, statistics, and professional education courses. The First Semester (27 units) comprises Calculus 1 with Analytic Geometry (MATHCAG1), Elementary Statistics and Probability (MATHESPR), Mathematics of Investment (MATHINVT), Modern Geometry (MATHMODG), Communicative Proficiency in Business Correspondence (GEADCPBR), The Contemporary World (GECONTWO), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), The Child and Adolescent Learners and Learning Principles (PEDCALLP), and The Teaching Profession (PEDTTPRO). The Second Semester (28 units) covers Calculus 2 (MATHANA2), Linear Algebra (MATHLINA), Number Theory (MATHNUMT), Practical Data Science (GEELECDS), Ethics (GEETHICS), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness II (GEPEHEF2), The Teacher and the Community/School Culture (PEDTCSOL), and Technology for Teaching and Learning 1 (PEDTFTAL).",
    "keywords": [
      "Second Year",
      "Calculus",
      "Analytic Geometry",
      "Statistics",
      "Probability",
      "Investment Math",
      "Linear Algebra",
      "Number Theory"
    ]
  },
  {
    "id": "earist_ced_bse_math_year_3_curriculum",
    "source": "EARIST BSE-Math Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Mathematics)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSE Mathematics program focuses on advanced mathematical analysis, research, and teaching strategies. The First Semester (25 units) includes Advance Statistics (MATHADST), Calculus 3 (MATHCAG3), Principles and Strategies of Teaching Mathematics (MATHPSTM), Research in Mathematics (MATHRESM), Solid Mensuration (MATHSOME), Assessment of Learning 1 (PEDASOL1), Facilitating Learner-Centered Teaching (PEDFALCT), and Foundation of Special and Inclusive Education (PEDFOSIE). The Second Semester (21 units) covers Abstract Algebra (MATHABSA), Assessment and Evaluation in Mathematics (MATHAEMA), Problem Solving, Mathematical Investigation and Modelling (MATHPSMI), Technology for Teaching and Learning 2/Instrumentation in Mathematics (MATHTFTL), Assessment of Learning 2 (PEDASOL2), Building and Enhancing New Literacies Across the Curriculum (PEDBELAC), and The Teacher and The School Curriculum (PEDTSCUR).",
    "keywords": [
      "Third Year",
      "Calculus 3",
      "Research in Mathematics",
      "Solid Mensuration",
      "Abstract Algebra",
      "Problem Solving",
      "Mathematical Modelling",
      "Teaching Strategies"
    ]
  },
  {
    "id": "earist_ced_bse_math_year_4_curriculum",
    "source": "EARIST BSE-Math Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Mathematics)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the BSE Mathematics program is dedicated to field study and professional practice. The First Semester (9 units) includes Competencies Enhancement Program (PEDCOPRO), Field Study 1 (PEDFSTDY1), and Field Study 2 (PEDFSTDY2). The Second Semester (6 units) consists entirely of the Teaching Internship (PEDNTERN).",
    "keywords": [
      "Fourth Year",
      "Field Study",
      "Teaching Internship",
      "Competencies Enhancement",
      "Practicum"
    ]
  }
]
[
  {
    "id": "earist_ced_bse_science_program_overview",
    "source": "EARIST BSE-Science Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Science)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, offers the Bachelor of Secondary Education (BSE) program with a major in Science. This curriculum, effective as of June 2018, requires a total of 183 units for completion. The program structure spans four academic years and covers specialized sciences including astronomy, biology, chemistry, and physics, alongside professional education courses.",
    "keywords": [
      "EARIST",
      "College of Education",
      "Bachelor of Secondary Education",
      "BSE",
      "Science Major",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_ced_bse_science_year_1_curriculum",
    "source": "EARIST BSE-Science Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Science)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSE Science program establishes the scientific and general education foundations. The First Semester (29 units) includes Astronomy (ASTRONMY), Earth Science (EARTHSCI), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), NSTP Literacy Training Service 1 (NSTPLTS1), and National Service Training Program 1 (NSTPROG1). The Second Semester (29 units) includes Environmental Science (ENVISCIE), Living in Information Technology Era (GEELECIT), Filipino sa Iba't ibang Disiplina (GEFILDIS), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Meteorology (METORLGY), NSTP Literacy Training Service 2 (NSTPLTS2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Astronomy",
      "Earth Science",
      "Meteorology",
      "Environmental Science",
      "NSTP",
      "Literacy Training Service"
    ]
  },
  {
    "id": "earist_ced_bse_science_year_2_curriculum",
    "source": "EARIST BSE-Science Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Science)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSE Science program advances into biology, chemistry, and physics. The First Semester (29 units) comprises Cell and Molecular Biology (CELLMBIO), Fluid Mechanics (FLUIDMEC), Communicative Proficiency in Business Correspondence (GEADCPBR), The Contemporary World (GECONTWO), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Inorganic Chemistry (INORGCHM), The Child and Adolescent Learners and Learning Principles (PEDCALLP), and The Teaching Profession (PEDTTPRO). The Second Semester (27 units) covers Analytical Chemistry (ANALCHEM), Practical Data Science (GEADDPDS), Ethics (GEETHICS), Genetics (GENESCIE), Physical Activity Towards Health and Fitness II (GEPEHEF2), The Teacher and the Community/School Culture (PEDTCSOL), Technology for Teaching and Learning 1 (PEDTFTAL), and Thermodynamics (THERMODY).",
    "keywords": [
      "Second Year",
      "Cell Biology",
      "Fluid Mechanics",
      "Inorganic Chemistry",
      "Analytical Chemistry",
      "Genetics",
      "Thermodynamics"
    ]
  },
  {
    "id": "earist_ced_bse_science_year_3_curriculum",
    "source": "EARIST BSE-Science Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Science)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSE Science program focuses on advanced physics, organic chemistry, and pedagogy. The First Semester (25 units) includes Electricity and Magnetism (ELECMAGN), Microbiology and Parasitology (MICROPRA), Organic Chemistry (ORGACHEM), Assessment of Learning 1 (PEDASOL1), Facilitating Learner-Centered Teaching (PEDFALCT), Foundation of Special and Inclusive Education (PEDFOSIE), and Technology for Teaching and Learning Science 2 (TECTLSCI). The Second Semester (29 units) covers Anatomy and Physiology (ANPHYSIO), Biochemistry (BIOCHEMI), Modern Physics (MODRNPHY), Assessment of Learning 2 (PEDASOL2), Building and Enhancing New Literacies Across the Curriculum (PEDBELAC), The Teacher and The School Curriculum (PEDTSCUR), Research in Teaching Science (RSRCHSCI), The Teaching of Science (TEACHSCI), and Waves & Optics (WAVESOPT).",
    "keywords": [
      "Third Year",
      "Electricity and Magnetism",
      "Microbiology",
      "Organic Chemistry",
      "Biochemistry",
      "Modern Physics",
      "Waves and Optics",
      "Anatomy and Physiology"
    ]
  },
  {
    "id": "earist_ced_bse_science_year_4_curriculum",
    "source": "EARIST BSE-Science Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (BSE Science)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the BSE Science program is dedicated to field study and teaching internship. The First Semester (9 units) includes Competencies Enhancement Program (PEDCOPRO), Field Study 1 (PEDFSTDY1), and Field Study 2 (PEDFSTDY2). The Second Semester (6 units) consists entirely of the Teaching Internship (PEDNTERN).",
    "keywords": [
      "Fourth Year",
      "Field Study",
      "Teaching Internship",
      "Competencies Enhancement",
      "Practicum"
    ]
  }
]
[
  {
    "id": "earist_coe_bsece_program_overview",
    "source": "EARIST BSECE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electronics and Communication Engineering)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Engineering, offers the Bachelor of Science in Electronics and Communication Engineering (BSECE) program. This curriculum, effective as of June 2018, requires a total of 198 units for completion. The program structure spans four academic years and one summer term, designed to provide comprehensive training in electronics, communications, and engineering technologies.",
    "keywords": [
      "EARIST",
      "College of Engineering",
      "Bachelor of Science in Electronics and Communication Engineering",
      "BSECE",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_coe_bsece_year_1_curriculum",
    "source": "EARIST BSECE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electronics and Communication Engineering)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSECE program lays the mathematical and scientific foundation for engineering. The First Semester (28 units) includes Computer Aided Drafting (CENCAD 111), Differential Calculus (CENMAT01), Mathematics for Engineers (CENMATH 111), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), Chemistry for Engineers (NATSCI SP_102), and National Service Training Program 1 (NSTPROG1). The Second Semester (29 units) includes Environmental Science and Engineering (CENENVIR), Physics 2 (CENPHY2), ECE Workshop 1 (ECE 110L1), Living in Information Technology Era (GEELECIT), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Readings in Philippine History (GEREADPH), Calculus II/Integral Calculus (MATH 104), Physics for Engineers/Calculus Based (NATSCI103A), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Calculus",
      "Physics",
      "ECE Workshop",
      "Chemistry",
      "Drafting",
      "NSTP"
    ]
  },
  {
    "id": "earist_coe_bsece_year_2_curriculum",
    "source": "EARIST BSECE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electronics and Communication Engineering)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSECE program focuses on core electronics and electrical circuits. The First Semester (26 units) comprises Material Science and Engineering (CENMSE), Computer Programming (CENPROG), Differential Equations (DIFFEQUA), Electronics 1: Electronics Devices and Circuits (ECENG211), Engineering Economy (EECO 311), Electrical Circuits 1 (EEENG 211), Communicative Proficiency in Business Correspondence (GEADCPBR), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Engineering Data Analysis (MM16). The Second Semester (28 units) covers Engineering Management (CVENG316), Electronics 2: Electronic Circuit Analysis and Design (ECENG221B), Communications 1: Principles of Communication System (ECENG222), Electrical Circuits 2 (EEENG 221), Electromagnetics (EEN 323), Practical Data Science (GEADDPDS), Physical Activity Towards Health and Fitness II (GEPEHEF2), Understanding the Self (GEUNDETS), and Advance Engineering Mathematics for ECE (MATH319B).",
    "keywords": [
      "Second Year",
      "Electronics Devices",
      "Electrical Circuits",
      "Circuit Analysis",
      "Communications Principles",
      "Electromagnetics",
      "Engineering Economy"
    ]
  },
  {
    "id": "earist_coe_bsece_year_3_curriculum",
    "source": "EARIST BSECE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electronics and Communication Engineering)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BSECE program advances into systems design, digital electronics, and signal processing. The First Semester (25 units) includes Electronics 3: Electronic Systems and Design (ECENG311), Digital Electronics 1: Logic Circuits and Switching Theory (ECENG312), Signals, Spectra, and Signal Processing (ECENG313), Communications 2: Modulation and Coding Techniques (ECENG314), The Contemporary World (GECONTWO), Ethics (GEETHICS), and The Life and Works of Rizal (GELIFEWR). The Second Semester (22 units) covers Communication 3: Transmission Media, Antenna System and Design (ECENG 321), Communications 4: Data Communications (ECENG322), Digital Electronics 2: Microprocessor & Microcontroller Systems & Design (ECENG323), Feedback and Control Systems (ECENG324), ECE Laws, Contracts, Ethics, Standards & Safety (ECENG325), and Purposive Communication (GEPURPCO). The Summer term requires On-the-Job Training (CENOTJOB), which consists of 300 hours and carries 3 credited units.",
    "keywords": [
      "Third Year",
      "Digital Electronics",
      "Signal Processing",
      "Modulation",
      "Data Communications",
      "Microprocessor",
      "Antenna System",
      "OJT"
    ]
  },
  {
    "id": "earist_coe_bsece_year_4_curriculum",
    "source": "EARIST BSECE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electronics and Communication Engineering)",
    "topic": "Fourth Year Coursework and Electives",
    "content": "The Fourth Year of the EARIST BSECE program is dedicated to capstone design, research, and specialized electives. The First Semester (21 units) includes Technopreneurship (CENTECNO), Methods of Research (ECENG411), ECE Elective 1/Advanced Communication System and Design (ECENG412), ECE Elective 2/Advanced Power Supply Systems (ECENG413), ECE Elective 3/Advanced Instrumentation & Control Systems (ECENG414), Design 1/Capstone Project (ECENG415), and Review 1/Mathematics & GEAS (ECENG416). The Second Semester (16 units) concludes the degree with Seminars/Colloquium (ECENG421), Design 2/Capstone Project 2 (ECENG422), ECE Elective 4/Advanced Networking (ECENG423), ECE Elective 5/Renewable Energy Systems (ECENG424), ECE Elective 6/Robotics Technology (ECENG425), and Review 2/Electronics & Communications/EST (ECENG426).",
    "keywords": [
      "Fourth Year",
      "Capstone Project",
      "Research Methods",
      "Robotics",
      "Renewable Energy",
      "Networking",
      "Instrumentation",
      "Board Exam Review"
    ]
  }
]
[
  {
    "id": "earist_coe_bsee_program_overview",
    "source": "EARIST BSEE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electrical Engineering)",
    "topic": "Program Overview and Summary",
    [cite_start]"content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Engineering, offers the Bachelor of Science in Electrical Engineering (BSEE) program. This curriculum, effective as of June 2018, requires a total of 196 units for completion. The program structure spans four academic years and one summer term, providing comprehensive training in electrical circuits, power systems, electronics, and engineering standards[cite: 541, 542, 508].",
    "keywords": [
      "EARIST",
      "College of Engineering",
      "Bachelor of Science in Electrical Engineering",
      "BSEE",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_coe_bsee_year_1_curriculum",
    "source": "EARIST BSEE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electrical Engineering)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSEE program establishes the fundamental engineering sciences and mathematics. [cite_start]The First Semester (25 units) includes Computer Aided Drafting (CENCAD 111), Differential Calculus (CENMAT01), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), Chemistry for Engineers (NATSCI_SP_102), and National Service Training Program 1 (NSTPROG1)[cite: 500]. [cite_start]The Second Semester (27 units) includes Living in Information Technology Era (GEELECIT), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Calculus II/Integral Calculus (MATH_104), Physics for Engineers/Calculus Based (NATSCI103A), and NSTP 2 (NSTPROG2)[cite: 503].",
    "keywords": [
      "First Year",
      "Calculus",
      "Physics",
      "Chemistry",
      "Computer Aided Drafting",
      "NSTP",
      "General Education"
    ]
  },
  {
    "id": "earist_coe_bsee_year_2_curriculum",
    "source": "EARIST BSEE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electrical Engineering)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSEE program focuses on core electrical and mechanical engineering principles. [cite_start]The First Semester (27 units) comprises Computer Programming (CENPROG), Differential Equations (DIFFEQUA), Electrical Circuits 1 (EEENG_211), Engineering Mechanics (EEMCH 211), Basic Thermodynamics (EEMEN 211), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Engineering Data Analysis (MM16)[cite: 509]. [cite_start]The Second Semester (22 units) covers Electronics Circuits: Devices and Analysis (ECENG 221), Electrical Circuits 2 (EEENG 221), Engineering Math for EE (EEENG 222), Electromagnetics (EEENG_223), Fundamentals of Deformable Bodies (EEMCH 221), Fluid Mechanics (EEMCH 222), Practical Data Science (GEELECDS), and Physical Activity Towards Health and Fitness II (GEPEHEF2)[cite: 512].",
    "keywords": [
      "Second Year",
      "Electrical Circuits",
      "Thermodynamics",
      "Fluid Mechanics",
      "Electromagnetics",
      "Engineering Mechanics",
      "Electronics Circuits"
    ]
  },
  {
    "id": "earist_coe_bsee_year_3_curriculum",
    "source": "EARIST BSEE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electrical Engineering)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BSEE program advances into power systems, machinery, and specialized electronics. [cite_start]The First Semester (22 units) includes Engineering Economy (CENENECO), Electrical Circuits 3/Polyphase (EEENG311), Numerical Methods and Analysis (EEENG312), Electrical Machines 1 (EEENG313), Fundamentals of Electronics Communication (EEFUNECO), Industrial Electronics (EEINELEC), and Logic Circuit and Switching Theory (EELOGCKT)[cite: 520]. The Second Semester (27 units) includes Environmental Science and Engineering (CENENVIR), Microprocessor System (ECENG321), EE Laws, Codes and Professional Ethics (EEENG321), Electrical Machines 2 (EEENG322), Electrical Apparatus and Devices (EEENG323), Basic Occupational Safety and Health (EEENG324), Feedback Control Systems (EEENG325), and Management of Engineering Projects and Estimate (EEENG326). [cite_start]The Summer term requires On-the-Job Training (CENOTJOB), which consists of 300 hours and carries 3 credited units[cite: 522].",
    "keywords": [
      "Third Year",
      "Electrical Machines",
      "Polyphase Circuits",
      "Industrial Electronics",
      "Microprocessor System",
      "Feedback Control",
      "OJT",
      "EE Laws"
    ]
  },
  {
    "id": "earist_coe_bsee_year_4_curriculum",
    "source": "EARIST BSEE Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Electrical Engineering)",
    "topic": "Fourth Year Coursework and Capstone",
    "content": "The Fourth Year of the EARIST BSEE program involves advanced design, research, and professional preparation. The First Semester (26 units) includes Material Science and Engineering (CENMATSC), Technopreneurship (CENTECNO), Electrical Standards and Practices (EEENG411), Electrical Systems and Illumination Design (EEENG412), EE Elective 1/Power System Protection 1 (EEENG413), Research Methods (EEENG414), Instrumentation and Control (EEENG415), Review 1/ESAS & Mathematics (EEENG416), Adv. [cite_start]AutoCAD for EE (EEENG417), and The Life and Works of Rizal (GELIFEWR)[cite: 529]. [cite_start]The Second Semester (17 units) concludes the degree with Power System Analysis (EEENG421), EE Elective 2/Power System Protection 2 (EEENG422), Research Project or Capstone Design Project (EEENG423), Seminars/Field Trip/Colloquia (EEENG424), Fundamentals of Power Plant Design (EEENG425), Distribution Systems and Substation Design (EEENG426), and Review 2/Electrical Engineering (EEENG427)[cite: 532].",
    "keywords": [
      "Fourth Year",
      "Power System Analysis",
      "Power Plant Design",
      "Substation Design",
      "Illumination Design",
      "Capstone Project",
      "Board Exam Review",
      "Instrumentation"
    ]
  }
]
```json
[
  {
    "id": "earist_cbpa_bs_entrep_program_overview",
    "source": "EARIST BS Entrepreneurship Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Entrepreneurship)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Business and Public Administration (CBPA), offers the Bachelor of Science in Entrepreneurship program. This curriculum, effective as of June 2018, requires a total of 129 units for completion. The program structure spans four academic years and focuses on opportunity seeking, business planning, and enterprise implementation.",
    "keywords": [
      "EARIST",
      "CBPA",
      "Bachelor of Science in Entrepreneurship",
      "BS Entrep",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cbpa_bs_entrep_year_1_curriculum",
    "source": "EARIST BS Entrepreneurship Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Entrepreneurship)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Entrepreneurship program establishes the foundation for business creation. The First Semester (20 units) includes Movement Enhancement (GEPEMOVE), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Human Resource Management (HURSMNGT), Microeconomics (MICROECO), National Service Training Program 1 (NSTPROG1), and Opportunity Seeking (OPPOSEEK). The Second Semester (26 units) includes Entrepreneurial Behavior (ENBEHAVE), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Science, Technology and Society (GESCIETS), NSTP 2 (NSTPROG2), and Social Entrepreneurship (SOCIALEN).",
    "keywords": [
      "First Year",
      "Opportunity Seeking",
      "Entrepreneurial Behavior",
      "Social Entrepreneurship",
      "Microeconomics",
      "Human Resource Management",
      "NSTP"
    ]
  },
  {
    "id": "earist_cbpa_bs_entrep_year_2_curriculum",
    "source": "EARIST BS Entrepreneurship Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Entrepreneurship)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Entrepreneurship program focuses on business laws, planning, and strategic management. The First Semester (20 units) comprises Business Law and Taxation (BUSLWTXN), Business Plan Preparation (BUSPLNPR), The Contemporary World (GECONTWO), Ethics (GEETHICS), Filipino sa Iba't ibang Disiplina (GEFILDIS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Market Research and Consumer Behavior (MKTRESCH). The Second Semester (20 units) covers The Life and Works of Rizal (GELIFEWR), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness II (GEPEHEF2), Operations Management/TQM (OPTNMNGT), Program and Policies on Enterprise Development (PRGPOLED), Pricing and Costing (PRICSTRA), and Strategic Management (STRAMNGT).",
    "keywords": [
      "Second Year",
      "Business Law",
      "Taxation",
      "Business Plan Preparation",
      "Market Research",
      "Operations Management",
      "Pricing and Costing",
      "Strategic Management"
    ]
  },
  {
    "id": "earist_cbpa_bs_entrep_year_3_curriculum",
    "source": "EARIST BS Entrepreneurship Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Entrepreneurship)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Entrepreneurship program emphasizes specialized tracks such as manufacturing, service, and agribusiness. The First Semester (18 units) includes E-commerce (ECOMMERC), Entrepreneurial Marketing Strategies (ENTMKSTR), Events Management (EVNTMNGT), Financial Management (FINLMNGT), International Business and Trade (INTLBATT), and Manufacturing (MFGTRAC1). The Second Semester (15 units) covers Agribusiness (AGRTRAC3), Distribution Management (DISTMNGT), Franchising (FRANCHIS), Innovation Management (INNOMNGT), and Managing a Service Enterprise (MSETRAC2).",
    "keywords": [
      "Third Year",
      "E-commerce",
      "Manufacturing",
      "Financial Management",
      "Agribusiness",
      "Franchising",
      "Service Enterprise",
      "Innovation Management"
    ]
  },
  {
    "id": "earist_cbpa_bs_entrep_year_4_curriculum",
    "source": "EARIST BS Entrepreneurship Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Entrepreneurship)",
    "topic": "Fourth Year Coursework and Implementation",
    "content": "The Fourth Year of the BS Entrepreneurship program is dedicated entirely to the practical execution of business plans. The First Semester (5 units) consists of Business Plan Implementation I (BUSPLAN1). The Second Semester (5 units) concludes the degree with Business Plan Implementation II (BUSPLAN2). Both courses require the prior completion of Business Plan Preparation.",
    "keywords": [
      "Fourth Year",
      "Business Plan Implementation",
      "Capstone",
      "Practicum"
    ]
  }
]
```
[
  {
    "id": "earist_chtm_bshm_program_overview",
    "source": "EARIST BSHM Curriculum Checklist",
    "category": "College of Hospitality and Tourism Management Curriculum",
    "topic": "Program Overview",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Hospitality and Tourism Management (CHTM), offers the Bachelor of Science in Hospitality Management (BSHM) program. The curriculum is structured to provide students with theoretical knowledge and practical skills in lodging, food service, and tourism operations over the course of four academic years.",
    "keywords": [
      "EARIST",
      "CHTM",
      "Bachelor of Science in Hospitality Management",
      "BSHM",
      "Hospitality",
      "Tourism"
    ]
  },
  {
    "id": "earist_chtm_bshm_year_1_curriculum",
    "source": "EARIST BSHM Curriculum Checklist",
    "category": "College of Hospitality and Tourism Management Curriculum",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSHM program lays the foundation for general education and core hospitality concepts. The First Semester (23 units) includes Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), National Service Training Program 1 (NSTPROG1), Macro Perspective of Tourism and Hospitality (THCMACPR), and Risk Management as Applied to Safety, Security and Sanitation (THCRISKM). The Second Semester (38 units) includes Living in Information Technology Era (GEELECIT), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Fundamentals in Lodging Operations (HPCFUNLO), Kitchen Essentials and Basic Food Preparation (HPCKITES), NSTP 2 (NSTPROG2), Micro Perspective of Tourism and Hospitality (THCMICPR), and Quality Service Management in Tourism and Hospitality (THCQUASM).",
    "keywords": [
      "First Year",
      "Lodging Operations",
      "Kitchen Essentials",
      "Risk Management",
      "Tourism Perspectives",
      "NSTP",
      "Sanitation"
    ]
  },
  {
    "id": "earist_chtm_bshm_year_2_curriculum",
    "source": "EARIST BSHM Curriculum Checklist",
    "category": "College of Hospitality and Tourism Management Curriculum",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSHM program focuses on operations management, culinary arts, and legal aspects of the industry. The First Semester (23 units) comprises Operations Management in Tourism and Hospitality (BMECOPMN), World Literature and Humanities (GEADWOLH), The Contemporary World (GECONTWO), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Commercial Baking with Entrepreneurship (HMPECBWE), Fundamentals in Food Service Operations (HPCFUNFS), Philippine Culture and Tourism Geography (THCPHCTG), and Applied Business Tools and Technologies (THPCABTT). The Second Semester (23 units) includes Physical Activity Towards Health and Fitness II (GEPEHEF2), Asian Cuisine (HMPEASCU), Bar and Beverage Management with Laboratory (HMPEBARM), Rooms Division (HMPERDIV), Entrepreneurship in Tourism and Hospitality (THCENTRE), Legal Aspects in Tourism and Hospitality (THCLEGAS), Tourism and Hospitality Marketing (THCMARKT), and Professional Development and Applied Ethics (THCPDAET).",
    "keywords": [
      "Second Year",
      "Commercial Baking",
      "Food Service Operations",
      "Asian Cuisine",
      "Bar and Beverage Management",
      "Rooms Division",
      "Hospitality Law",
      "Marketing"
    ]
  },
  {
    "id": "earist_chtm_bshm_year_3_curriculum",
    "source": "EARIST BSHM Curriculum Checklist",
    "category": "College of Hospitality and Tourism Management Curriculum",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSHM program emphasizes strategic management, specialized cuisine, and research. The First Semester (24 units) includes Strategic Management and Total Quality Management (BMECSTQM), Introduction to MICE Management (THPCMICE), Foreign Language 1 (THPCFLA1), Food and Beverage Operations with Laboratory (HMPEFBOP), Research in Hospitality 1 (HPCRESH1), Western Cuisine (HMPEWECU), Understanding the Self (GEUNDETS), and Practical Data Science (GEELECDS). The Second Semester (24 units) covers Cruiseship Operations and Management (HMPECROM), Ergonomics and Facilities Planning (HPCERGFP), Garde Manger with Food Styling and Design (HMPEGMFD), Research in Hospitality 2 (HPCRESH2), Cost Control in Hospitality Industry (HMPECCHI), Catering and Banquet Management (HMPECABM), Foreign Language 2 (THPCFLA2), and Readings in Philippine History (GEREADPH).",
    "keywords": [
      "Third Year",
      "MICE",
      "Western Cuisine",
      "Garde Manger",
      "Catering",
      "Banquet Management",
      "Foreign Language",
      "Cruiseship Operations",
      "Research"
    ]
  },
  {
    "id": "earist_chtm_bshm_year_4_curriculum",
    "source": "EARIST BSHM Curriculum Checklist",
    "category": "College of Hospitality and Tourism Management Curriculum",
    "topic": "Fourth Year Coursework and Practicum",
    "content": "The Fourth Year of the BSHM program concludes with advanced topics and industry immersion. The First Semester (15 units) includes Ethics (GEETHICS), The Life and Works of Rizal (GELIFEWR), Advanced Bread and Pastry Production (HMPEADBP), Supply Chain Management in Hospitality Industry (HPCSUPCM), and Multicultural Diversity in Workplace for the Tourism Professional (THCMULDI). The Second Semester is dedicated entirely to the Hospitality Practicum (HPCHOSPR), which requires 600 hours of training in Hotel, Restaurant, Event Centers, or Resorts. This practicum has extensive prerequisites involving nearly all major subjects from the previous three years.",
    "keywords": [
      "Fourth Year",
      "Practicum",
      "Internship",
      "Supply Chain Management",
      "Bread and Pastry",
      "Multicultural Diversity",
      "600 Hours"
    ]
  }
]
[
  {
    "id": "earist_cafa_bsid_program_overview",
    "source": "EARIST BS Interior Design Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Interior Design)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Architecture and Fine Arts (CAFA), offers the Bachelor of Science in Interior Design (BSID) program. This curriculum, effective as of June 2018, requires a total of 186 units for completion. The program structure spans four academic years and one summer term, covering design theory, history, technical skills, and professional practice.",
    "keywords": [
      "EARIST",
      "CAFA",
      "Bachelor of Science in Interior Design",
      "BSID",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cafa_bsid_year_1_curriculum",
    "source": "EARIST BS Interior Design Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Interior Design)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Interior Design program establishes the foundation in design basics and general education. The First Semester (27 units) includes Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Interior Design 1A (INDES111), Interior Design Drafting (INDESIDD), Theory of Interior Design (INDESTID), Visual Techniques (INDESVST), and National Service Training Program 1 (NSTPROG1). The Second Semester (28 units) includes The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Interior Design 1B (INDES121), Color Studies 1/Color Theory (INDESCTH), History of Philippine Art (INDESHPA), Perspective (INDESPER), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Interior Design Drafting",
      "Color Theory",
      "Visual Techniques",
      "Perspective",
      "NSTP",
      "History of Philippine Art"
    ]
  },
  {
    "id": "earist_cafa_bsid_year_2_curriculum",
    "source": "EARIST BS Interior Design Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Interior Design)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Interior Design program focuses on rendering, history, and materials. The First Semester (27 units) comprises 2-Dimensional Drawing (2DDRAWNG), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Sinesosyedad/Pelikulang Panlipunan (GESINEPP), Interior Design 2A (INDES211), Color Studies II/Color Rendering (INDESCRD), History of Interior Design 1 (INDESHD1), and Materials and Resources 1 (INDESMR1). The Second Semester (27 units) covers 3-Dimensional Drawing (3DDRAWNG), The Contemporary World (GECONTWO), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness II (GEPEHEF2), Interior Design 2B (INDES221), Renaissance Art (INDES223), History of Interior Design 2 (INDESHD2), Lighting Design (INDESLID), and Materials and Resources 2 (INDESMR2).",
    "keywords": [
      "Second Year",
      "Color Rendering",
      "History of Interior Design",
      "Materials and Resources",
      "Lighting Design",
      "Renaissance Art",
      "3D Drawing"
    ]
  },
  {
    "id": "earist_cafa_bsid_year_3_curriculum",
    "source": "EARIST BS Interior Design Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Interior Design)",
    "topic": "Third Year Coursework and Summer Internship",
    "content": "The Third Year of the BS Interior Design program emphasizes furniture design, construction utilities, and research. The First Semester (24 units) includes Computer Rendering (COMRENDG), Communicative Proficiency in Business Correspondence (GEELECCP), Practical Data Science (GEELECDS), Understanding the Self (GEUNDETS), Interior Design 3A (INDES311), Construction Materials and Utilities (INDESCMU), Furniture Design 1 (INDESFD1), and History of Interior Design 3/Oriental Arts (INDESHD3). The Second Semester (26 units) covers Costume and Fashion (FASHNDES), Art Appreciation (GEARTAPP), Interior Design 3B (INDES321), Building Utilities/ID Elec 5 (INDESBUT), Furniture Design 2 (INDESFD2), Interior Construction and Detailing (INDESICD), Plant/Cultural Tours and Seminars (INDESPCT), and Research Methods in Interior Design (INDESRID). The Summer term requires Practicum/Internship (INDESPRAC) consisting of 3 credited units.",
    "keywords": [
      "Third Year",
      "Furniture Design",
      "Computer Rendering",
      "Oriental Arts",
      "Construction Materials",
      "Building Utilities",
      "Practicum",
      "Internship"
    ]
  },
  {
    "id": "earist_cafa_bsid_year_4_curriculum",
    "source": "EARIST BS Interior Design Curriculum Checklist (Effective June 2018)",
    "category": "College of Architecture and Fine Arts Curriculum (Interior Design)",
    "topic": "Fourth Year Coursework and Thesis",
    "content": "The Fourth Year of the BS Interior Design program concludes the degree with thesis work and professional practice. The First Semester (12 units) includes Interior Design 7/Thesis/Research (INDES411), Business Management in Interior Design (INDESBMD), and Interior Floral Design and Plantscaping (INDESIFP). The Second Semester (12 units) covers Interior Design 8/Actual Construction (INDES421), Interior Styling and Photography (INDESISP), and Professional Practice and Ethics (INDESPPE).",
    "keywords": [
      "Fourth Year",
      "Thesis",
      "Actual Construction",
      "Floral Design",
      "Plantscaping",
      "Interior Styling",
      "Professional Practice",
      "Business Management"
    ]
  }
]
[
  {
    "id": "earist_cas_bsit_program_overview",
    "source": "EARIST BSIT Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Information Technology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Arts and Sciences (CAS), offers the Bachelor of Science in Information Technology (BSIT) program. This curriculum, effective as of June 2018, requires a total of 157 units for completion. The program structure spans four academic years, focusing on software development, networking, database management, and systems administration.",
    "keywords": [
      "EARIST",
      "CAS",
      "Bachelor of Science in Information Technology",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cas_bsit_year_1_curriculum",
    "source": "EARIST BSIT Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Information Technology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Information Technology program establishes the foundations of computing and general education. The First Semester (26 units) includes Computer Programming 1/Fundamentals of Programming (FPROGLAB/FPROGLEC), Introduction to Computing (INTCOMLB/INTCOMLC), Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), and National Service Training Program 1 (NSTPROG1). The Second Semester (33 units) advances to Database Management System 1 (DBMSLAB1/DBMSLEC1), Discrete Mathematics (DISCMATH), Computer Programming 2/Intermediate Programming (IPROGLAB/IPROGLEC), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Panitikan sa Pilipinas (GEPANIPI), Science, Technology and Society (GESCIETS), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Computer Programming",
      "Introduction to Computing",
      "Database Management System",
      "Discrete Mathematics",
      "NSTP",
      "General Education"
    ]
  },
  {
    "id": "earist_cas_bsit_year_2_curriculum",
    "source": "EARIST BSIT Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Information Technology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSIT program covers core technical skills in web development, networking, and databases. The First Semester (11 units) includes Business Analytics (BUSANALY), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Web Development 1 (WEBDVLB1/WEBDVLC1). The Second Semester (20 units) includes Database Management System 2 (DBMSLAB2/DBMSLEC2), Communicative Proficiency in Business Correspondence (GEELECCP), Physical Activity Towards Health and Fitness II (GEPEHEF2), Introduction to Human Computer Interaction (INTHCILB/INTHCILC), Integrative Programming and Technologies 1 (IPATLAB1/IPATLEC1), Networking 1 (NETWKLB1/NETWKLC1), and Web Development 2 (WEBDVLB2/WEBDVLC2).",
    "keywords": [
      "Second Year",
      "Web Development",
      "Database Management System",
      "Business Analytics",
      "Networking",
      "Human Computer Interaction",
      "Integrative Programming"
    ]
  },
  {
    "id": "earist_cas_bsit_year_3_curriculum",
    "source": "EARIST BSIT Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Information Technology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the EARIST BSIT program focuses on advanced systems, mobile development, and research. The First Semester (18 units) includes Application Development and Emerging Technology (APDEVLAB/APDEVLEC), Practical Data Science (GEELECDS), Multimedia (MMDIALAB/MMDIALEC), Networking 2 (NETWKLB2/NETWKLC2), Systems Integration and Architecture 1 (SYSARCH1/SYSARLB1), and Web Development 3 (WEBDVLB3/WEBDVLC3). The Second Semester (21 units) initiates the research phase with Capstone Project and Research 1 (ITTHESI1). Other courses include Environmental Science (GEELECES), The Life and Works of Rizal (GELIFEWR), Information Assurance and Security 1 (IAASLAB1/IAASLEC1), Mobile Application Development (MOBAPLAB/MOBAPLEC), Object-Oriented Programming (OOPRGLAB/OOPRGLEC), and Quantitative Methods (QUANMETH).",
    "keywords": [
      "Third Year",
      "Application Development",
      "Multimedia",
      "Networking",
      "Systems Integration",
      "Capstone Project",
      "Mobile Application Development",
      "Information Assurance",
      "Object-Oriented Programming"
    ]
  },
  {
    "id": "earist_cas_bsit_year_4_curriculum",
    "source": "EARIST BSIT Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Information Technology)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the EARIST BSIT program concludes with advanced security, systems administration, and industry immersion. The First Semester (18 units) includes The Contemporary World (GECONTWO), Information Assurance and Security 2 (IAASLAB2/IAASLEC2), Capstone Project and Research 2 (ITTHESI2/ITTHESL2), Social and Professional Issues (SPISSUES), Systems Administration and Maintenance (SYSADMLB/SYSADMLC), and Systems Integration and Architecture 2 (SYSARCH2/SYSARLB2). The Second Semester (10 units) is dedicated entirely to the Practicum/Internship (ITINTERN).",
    "keywords": [
      "Fourth Year",
      "Information Assurance",
      "Security",
      "Capstone Project",
      "Systems Administration",
      "Practicum",
      "Internship",
      "Social Issues"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_at_program_overview",
    "source": "EARIST BSIT-AT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Automotive Technology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Automotive Technology. This curriculum, effective as of June 2018, requires a total of 168 units for completion. The program structure spans four academic years, covering general education, technical automotive skills, welding, electronics, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Automotive Technology",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_at_year_1_curriculum",
    "source": "EARIST BSIT-AT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Automotive Technology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Automotive Technology) program establishes fundamental technical and general skills. The First Semester (23 units) includes Basic SMAW and GMAW, Soldering and Joining Operation for Automotive Application (AUTOTEC1), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURPCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), and National Service Training Program 1 (NSTPROG1). The Second Semester (29 units) includes Automotive Engine Overhauling, Rebuilding, Basic Power Conversion and Electrical Assembly (AUTOTEC2), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Automotive Engine Overhauling",
      "SMAW",
      "GMAW",
      "Welding",
      "Industrial Drawing",
      "CAD",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_at_year_2_curriculum",
    "source": "EARIST BSIT-AT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Automotive Technology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Automotive Technology) program focuses on specialized automotive systems and electronics. The First Semester (23 units) comprises Automotive Air-conditioning System: Servicing, Repair and Maintenance (AUTOTEC3), Basic Automotive Electronics Engine Management System (ELCAUTO1), Entrepreneurship and Cooperatives (ENTNCOOP), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Motorcycle and Small Engine Servicing and Maintenance (AUTOTEC4), Computer Programming (COMPPROG), Automotive Electronic Instrumentation & Electronic Climate Control Systems Servicing and Maintenance (ELCAUTO2), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Automotive Air-conditioning",
      "Engine Management System",
      "Motorcycle Servicing",
      "Small Engine",
      "Computer Programming",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_at_year_3_curriculum",
    "source": "EARIST BSIT-AT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Automotive Technology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Automotive Technology) program advances into electronic management and research. The First Semester (24 units) includes Advanced Electronic Engine Management for Petrol/Gasoline Engine (AUTOTEC5), Automotive Body Computer System Diagnosis and Electronically Controlled Powertrain System (ELCAUTO3), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers Advanced Electronic Engine Management for Common Rail Direct Injection Diesel Engine (AUTOTEC6), Elective 4: Simulated Safety Driving and Troubleshooting (ELCAUTO4), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "Electronic Engine Management",
      "Petrol Engine",
      "Diesel Engine",
      "Powertrain System",
      "Safety Driving",
      "Research Methods",
      "Feasibility Study"
    ]
  },
  {
    "id": "earist_cit_bsit_at_year_4_curriculum",
    "source": "EARIST BSIT-AT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Automotive Technology)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Automotive Technology) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_dt_program_overview",
    "source": "EARIST BSIT-DT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Drafting Technology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Drafting Technology. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, focusing on manual and computer-aided drafting (CAD), architectural rendering, modeling, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Drafting Technology",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_dt_year_1_curriculum",
    "source": "EARIST BSIT-DT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Drafting Technology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Drafting Technology) program establishes foundational drafting skills. The First Semester (23 units) includes Advanced Mechanical Drafting (DRAFTEC1), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Advance Machine and Furniture Drafting (DRAFTEC2), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Mechanical Drafting",
      "Furniture Drafting",
      "Industrial Drawing",
      "CAD",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_dt_year_2_curriculum",
    "source": "EARIST BSIT-DT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Drafting Technology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Drafting Technology) program focuses on architectural drafting and specialized CAD software. The First Semester (23 units) comprises Advanced Architectural Drafting 1 (DRAFTEC3), Auto CAD Drawing (ELCDRAF1), Entrepreneurship and Cooperatives (ENTNCOOP), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Computer Programming (COMPPROG), Advanced Architectural Drafting 2 (DRAFTEC4), Sketch-up with Vray (ELCDRAF2), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Architectural Drafting",
      "Auto CAD",
      "Sketch-up",
      "Vray",
      "Computer Programming",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_dt_year_3_curriculum",
    "source": "EARIST BSIT-DT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Drafting Technology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Drafting Technology) program advances into 3D modeling, rendering, and research. The First Semester (24 units) includes CAD Architectural Renderings (DRAFTEC5), Revit Architecture (ELCDRAF3), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers 3D Architectural Modeling and Construction Materials and Estimate (DRAFTEC6), Elective 4: Photoshop (ELCDRAF4), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "CAD Rendering",
      "Revit Architecture",
      "3D Architectural Modeling",
      "Construction Materials",
      "Photoshop",
      "Research Methods",
      "Feasibility Study"
    ]
  },
  {
    "id": "earist_cit_bsit_dt_year_4_curriculum",
    "source": "EARIST BSIT-DT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Drafting Technology)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Drafting Technology) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_electrical_program_overview",
    "source": "EARIST BSIT-Electrical Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Electrical Technology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Electrical Technology. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, focusing on electrical codes, motor controls, automation, and industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Electrical Technology",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_electrical_year_1_curriculum",
    "source": "EARIST BSIT-Electrical Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Electrical Technology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Electrical Technology) program establishes fundamental electrical skills and general education. The First Semester (23 units) includes Philippine Electrical Code (PEC) and Its Application (ELECTRI1), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Transformer, DC Rotating Machine and Alternative Sources of Energy (ELECTRI2), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Philippine Electrical Code",
      "PEC",
      "Transformers",
      "DC Rotating Machine",
      "Industrial Drawing",
      "CAD",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_electrical_year_2_curriculum",
    "source": "EARIST BSIT-Electrical Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Electrical Technology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Electrical Technology) program focuses on motors, refrigeration, and electronics. The First Semester (23 units) comprises Domestic Refrigeration and Air-conditioning System (ELCELCT1), AC Rotating Machine, Single Phase and Three Phase Motors (ELECTRI3), Entrepreneurship and Cooperatives (ENTNCOOP), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Computer Programming (COMPPROG), Basic Electronics (ELCELCT2), Basic Motor Control Circuits (ELECTRI4), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Refrigeration",
      "AC Rotating Machine",
      "Motors",
      "Basic Electronics",
      "Motor Control Circuits",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_electrical_year_3_curriculum",
    "source": "EARIST BSIT-Electrical Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Electrical Technology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Electrical Technology) program advances into automation, logic circuits, and research. The First Semester (24 units) includes Logic Circuit and Solid State Motor Controller (ELCELCT3), Advanced Motor Control Circuits (ELECTRI5), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers Elective 4: Preventive Maintenance (ELCELCT4), Programmable Logic Circuits, Automation and Mechatronics (ELECTRI6), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "Logic Circuits",
      "Advanced Motor Control",
      "PLC",
      "Automation",
      "Mechatronics",
      "Preventive Maintenance",
      "Research Methods"
    ]
  },
  {
    "id": "earist_cit_bsit_electrical_year_4_curriculum",
    "source": "EARIST BSIT-Electrical Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Electrical Technology)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Electrical Technology) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_fat_program_overview",
    "source": "EARIST BSIT-FAT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Fashion and Apparel Technology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Fashion and Apparel Technology. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, covering clothing fundamentals, fashion design, textile studies, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Fashion and Apparel Technology",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_fat_year_1_curriculum",
    "source": "EARIST BSIT-FAT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Fashion and Apparel Technology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Fashion and Apparel Technology) program establishes foundational skills in apparel construction and general technical drawing. The First Semester (23 units) includes Clothing Fundamentals and Apparel Construction (FASHTEC1), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Men's Clothing and Advanced Apparel Construction (FASHTEC2), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Clothing Fundamentals",
      "Apparel Construction",
      "Men's Clothing",
      "Industrial Drawing",
      "CAD",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_fat_year_2_curriculum",
    "source": "EARIST BSIT-FAT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Fashion and Apparel Technology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Fashion and Apparel Technology) program focuses on design development and textile studies. The First Semester (23 units) comprises Textile Study (ELCFASH1), Entrepreneurship and Cooperatives (ENTNCOOP), Fashion Studies and Design Development 1 (FASHTEC3), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Computer Programming (COMPPROG), Costume Details and Fashion Accessories (ELCFASH2), Fashion Design and Development 2 (FASHTEC4), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Textile Study",
      "Fashion Studies",
      "Design Development",
      "Costume Details",
      "Fashion Accessories",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_fat_year_3_curriculum",
    "source": "EARIST BSIT-FAT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Fashion and Apparel Technology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Fashion and Apparel Technology) program advances into production analysis, merchandising, and research. The First Semester (24 units) includes Garment Alteration and Repair Services (ELCFASH3), Apparel Production and Operation Analysis (FASHTEC5), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers Elective 4: Home Details and Interior Accessories (ELCFASH4), Apparel Production and Fashion Merchandizing (FASHTEC6), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "Garment Alteration",
      "Apparel Production",
      "Fashion Merchandizing",
      "Home Details",
      "Research Methods",
      "Feasibility Study"
    ]
  },
  {
    "id": "earist_cit_bsit_fat_year_4_curriculum",
    "source": "EARIST BSIT-FAT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Fashion and Apparel Technology)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Fashion and Apparel Technology) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_food_tech_program_overview",
    "source": "EARIST BSIT-FT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Food Technology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Food Technology. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, covering food selection, processing, quantity production, experimental cookery, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Food Technology",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_food_tech_year_1_curriculum",
    "source": "EARIST BSIT-FT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Food Technology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Food Technology) program establishes foundational culinary and general skills. The First Semester (23 units) includes Food Selection and Preparation (FOODTEC1), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Quantity Food Production (FOODTEC2), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Food Selection",
      "Preparation",
      "Quantity Food Production",
      "Industrial Drawing",
      "CAD",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_food_tech_year_2_curriculum",
    "source": "EARIST BSIT-FT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Food Technology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Food Technology) program focuses on specialized food science and processing. The First Semester (23 units) comprises Food Safety and Sanitation with Food Laws (ELCFOOD1), Entrepreneurship and Cooperatives (ENTNCOOP), Advanced Baking and Pastry Production (FOODTEC3), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Computer Programming (COMPPROG), Food Science/Food Chemistry (ELCFOOD2), Food Processing and Packaging (FOODTEC4), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Food Safety",
      "Sanitation",
      "Advanced Baking",
      "Pastry Production",
      "Food Chemistry",
      "Food Processing",
      "Packaging"
    ]
  },
  {
    "id": "earist_cit_bsit_food_tech_year_3_curriculum",
    "source": "EARIST BSIT-FT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Food Technology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Food Technology) program advances into experimental cookery and cuisine management. The First Semester (24 units) includes Food Science/Culinary Nutrition (ELCFOOD3), Experimental Cookery with Objective Evaluation of Food (FOODTEC5), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers Elective 4: Subjective Evaluation of Food (ELCFOOD4), Asian and Western Cuisine (FOODTEC6), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "Culinary Nutrition",
      "Experimental Cookery",
      "Food Evaluation",
      "Asian Cuisine",
      "Western Cuisine",
      "Research Methods"
    ]
  },
  {
    "id": "earist_cit_bsit_food_tech_year_4_curriculum",
    "source": "EARIST BSIT-FT Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Food Technology)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Food Technology) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_ic_program_overview",
    "source": "EARIST BSIT-IC Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Industrial Chemistry)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Industrial Chemistry. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, covering chemical processing, product formulation (wines, soaps, cosmetics, plastics), quality control, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Industrial Chemistry",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_ic_year_1_curriculum",
    "source": "EARIST BSIT-IC Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Industrial Chemistry)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Industrial Chemistry) program establishes foundational chemical and drawing skills. The First Semester (23 units) includes Wine and Other Beverages (INDCHEM1), Industrial Drawing with CAD 1/2D (INDRACA1), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Food Preservation and Processing (INDCHEM2), Industrial Drawing with CAD 2/3D (INDRACA2), Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Wine and Other Beverages",
      "Food Preservation",
      "Industrial Drawing",
      "CAD",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_ic_year_2_curriculum",
    "source": "EARIST BSIT-IC Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Industrial Chemistry)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Industrial Chemistry) program focuses on industrial testing, soaps, and cosmetics. The First Semester (23 units) comprises Basic Industrial and Testing Techniques (ELCCHEM1), Entrepreneurship and Cooperatives (ENTNCOOP), Oils, Fats Soap and Detergent Industry (INDCHEM3), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Computer Programming (COMPPROG), Packaging Methods and Techniques (ELCCHEM2), Color Chemistry and Cosmetic Industry (INDCHEM4), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), and Physical Activity Towards Health and Fitness II (GEPEHEF2).",
    "keywords": [
      "Second Year",
      "Industrial Testing",
      "Soap and Detergent Industry",
      "Color Chemistry",
      "Cosmetic Industry",
      "Packaging Methods",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_ic_year_3_curriculum",
    "source": "EARIST BSIT-IC Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Industrial Chemistry)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Industrial Chemistry) program advances into heavy industries like pulp, paper, and plastics. The First Semester (24 units) includes Green Chemistry (ELCCHEM3), Pulp and Paper Industry (INDCHEM5), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers Elective 4: Waste Management and Basic Process (ELCCHEM4), Plastic Industry (INDCHEM6), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "Green Chemistry",
      "Pulp and Paper Industry",
      "Plastic Industry",
      "Waste Management",
      "Research Methods",
      "Feasibility Study"
    ]
  },
  {
    "id": "earist_cit_bsit_ic_year_4_curriculum",
    "source": "EARIST BSIT-IC Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Industrial Chemistry)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Industrial Chemistry) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_msp_program_overview",
    "source": "EARIST BSIT-MSP Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Machine Shop Practice)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Machine Shop Practice. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, covering metrology, machining operations (lathe, milling, grinding), tool and die making, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Machine Shop Practice",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_msp_year_1_curriculum",
    "source": "EARIST BSIT-MSP Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Machine Shop Practice)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Machine Shop Practice) program establishes fundamental mechanical skills and general education. The First Semester (23 units) includes Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), Metrology and Bench Work Practices (MECHTEC1), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), Lathe Machine Operation 1 (MECHTEC2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Metrology",
      "Bench Work",
      "Industrial Drawing",
      "CAD",
      "Lathe Machine Operation",
      "NSTP"
    ]
  },
  {
    "id": "earist_cit_bsit_msp_year_2_curriculum",
    "source": "EARIST BSIT-MSP Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Machine Shop Practice)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Machine Shop Practice) program focuses on advanced machining and maintenance. The First Semester (23 units) comprises Applied Mechanical Mathematics (ELCMSPR1), Entrepreneurship and Cooperatives (ENTNCOOP), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Milling and Grinding Machine Operations (MECHTEC3), and Plant Visit and Seminar (PLAVISEM). The Second Semester (23 units) covers Computer Programming (COMPPROG), Corrective and Preventive Maintenance (ELCMSPR2), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), Physical Activity Towards Health and Fitness II (GEPEHEF2), and Electric Arc and Gas Welding (MECHTEC4).",
    "keywords": [
      "Second Year",
      "Milling Machine",
      "Grinding Machine",
      "Welding",
      "Electric Arc",
      "Gas Welding",
      "Preventive Maintenance",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_msp_year_3_curriculum",
    "source": "EARIST BSIT-MSP Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Machine Shop Practice)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Machine Shop Practice) program advances into CNC technology, tool design, and research. The First Semester (24 units) includes Introduction to CNC (ELCMSPR3), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), Tool and Die Making (MECHTEC5), and Methodology of Research 1/Feasibility Study (METORES1). The Second Semester (24 units) covers Elective 4: Blueprint Reading (ELCMSPR4), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Jigs and Fixtures Design (MECHTEC6), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), and Production Operation Management (PROOPMAN).",
    "keywords": [
      "Third Year",
      "CNC",
      "Tool and Die Making",
      "Blueprint Reading",
      "Jigs and Fixtures Design",
      "Research Methods",
      "Feasibility Study"
    ]
  },
  {
    "id": "earist_cit_bsit_msp_year_4_curriculum",
    "source": "EARIST BSIT-MSP Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Machine Shop Practice)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Machine Shop Practice) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cit_bsit_rac_program_overview",
    "source": "EARIST BSIT-RA Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Refrigeration and Air Conditioning)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Industrial Technology (CIT), offers the Bachelor of Science in Industrial Technology program specializing in Refrigeration and Air Conditioning Technology. This curriculum, effective as of June 2018, requires a total of 162 units for completion. The program structure spans four academic years, covering HVAC systems, refrigeration principles, industrial chillers, and intensive industrial training.",
    "keywords": [
      "EARIST",
      "CIT",
      "Bachelor of Science in Industrial Technology",
      "Refrigeration and Air Conditioning",
      "BSIT",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cit_bsit_rac_year_1_curriculum",
    "source": "EARIST BSIT-RA Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Refrigeration and Air Conditioning)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Industrial Technology (Refrigeration and Air Conditioning) program establishes foundational HVAC skills and general education. The First Semester (23 units) includes Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Understanding the Self (GEUNDETS), Industrial Drawing with CAD 1/2D (INDRACA1), National Service Training Program 1 (NSTPROG1), and Special Refrigeration, Systems, Principles, Installation and Servicing (RACTECH1). The Second Semester (23 units) includes Filipino sa Iba't ibang Disiplina (GEFILDIS), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Industrial Drawing with CAD 2/3D (INDRACA2), NSTP 2 (NSTPROG2), and Light and Heavy Transport Air-Conditioning Systems, Installation and Servicing (RACTECH2).",
    "keywords": [
      "First Year",
      "Refrigeration Principles",
      "Transport Air-Conditioning",
      "Industrial Drawing",
      "CAD",
      "NSTP",
      "Installation and Servicing"
    ]
  },
  {
    "id": "earist_cit_bsit_rac_year_2_curriculum",
    "source": "EARIST BSIT-RA Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Refrigeration and Air Conditioning)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Industrial Technology (Refrigeration and Air Conditioning) program focuses on HVAC electronics, commercial systems, and duct design. The First Semester (23 units) comprises Electronics and Power Inverter Application in HVAC/R System (ELCRACT1), Entrepreneurship and Cooperatives (ENTNCOOP), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Plant Visit and Seminar (PLAVISEM), and Packed HVAC Units and Commercial Refrigeration System Servicing (RACTECH3). The Second Semester (23 units) covers Computer Programming (COMPPROG), Industrial HVAC/R Motor Controller (ELCRACT2), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), Physical Activity Towards Health and Fitness II (GEPEHEF2), and Air-Duct System, Design, Fabrication, Installation and Servicing (RACTECH4).",
    "keywords": [
      "Second Year",
      "HVAC Electronics",
      "Commercial Refrigeration",
      "Motor Controller",
      "Air-Duct System",
      "Fabrication",
      "Plant Visit"
    ]
  },
  {
    "id": "earist_cit_bsit_rac_year_3_curriculum",
    "source": "EARIST BSIT-RA Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Refrigeration and Air Conditioning)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Industrial Technology (Refrigeration and Air Conditioning) program advances into industrial heating, chillers, and research. The First Semester (24 units) includes Industrial Heating System (ELCRACT3), Foreign Language (FORELANG), Practical Data Science (GEELECDS), Readings in Philippine History (GEREADPH), Industrial Organization & Management (INDORMAN), Methodology of Research 1/Feasibility Study (METORES1), and Industrial Chiller Systems, Servicing and Preventive Maintenance (RACTECH5). The Second Semester (24 units) covers Elective 4: Marine Refrigeration and Cold Storage Plant System (ELCRACT4), Art Appreciation (GEARTAPP), Labor Relation (LABRELTN), Methodology of Research 2/Project Study (METORES2), Occupational Health and Safety Standards (OHASSTAN), Production Operation Management (PROOPMAN), and Ice Plant Design and Installation (RACTECH6).",
    "keywords": [
      "Third Year",
      "Industrial Heating",
      "Chiller Systems",
      "Preventive Maintenance",
      "Marine Refrigeration",
      "Cold Storage",
      "Ice Plant Design",
      "Research Methods"
    ]
  },
  {
    "id": "earist_cit_bsit_rac_year_4_curriculum",
    "source": "EARIST BSIT-RA Curriculum Checklist (Effective June 2018)",
    "category": "College of Industrial Technology Curriculum (Refrigeration and Air Conditioning)",
    "topic": "Fourth Year Coursework and Industrial Training",
    "content": "The Fourth Year of the BS Industrial Technology (Refrigeration and Air Conditioning) program consists entirely of intensive industrial training. The First Semester (11 units) requires In-Plant Training (INPLTRN1) and Student Training Evaluation 1 (STTREVL). The Second Semester (11 units) requires Supervised Industrial Training (INPLTRN2) and Student Training Evaluation 2 (STTREVL2).",
    "keywords": [
      "Fourth Year",
      "In-Plant Training",
      "Supervised Industrial Training",
      "OJT",
      "Internship",
      "Student Training Evaluation"
    ]
  }
]
[
  {
    "id": "earist_cas_bsmath_program_overview",
    "source": "EARIST BS Mathematics Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Mathematics)",
    "topic": "Program Overview and Summary",
    [cite_start]"content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Arts and Sciences (CAS), offers the Bachelor of Science in Mathematics (BS Math) program. This curriculum, effective as of June 2018, requires a total of 182 units for completion. The program structure spans four academic years and concludes with a practicum/internship component[cite: 88, 92, 125].",
    "keywords": [
      "EARIST",
      "CAS",
      "Bachelor of Science in Mathematics",
      "BS Math",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cas_bsmath_year_1_curriculum",
    "source": "EARIST BS Mathematics Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Mathematics)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the Bachelor of Science in Mathematics at EARIST consists of foundational courses and general education requirements. The First Semester (34 units) includes Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), Calculus 1 (MATHANA1), Fundamental Concepts of Mathematics (MATHFUND), and National Service Training Program 1 (NSTPROG1). [cite_start]The Second Semester (32 units) introduces computing and physics, requiring Fundamentals of Computing 1 (COMPLAB1/COMPLEC1), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Understanding the Self (GEUNDETS), General Physics 1/Mechanics and Heat (GPMAHLAB/GPMAHLEC), Calculus 2 (MATHANA2), and National Service Training Program 2 (NSTPROG2)[cite: 93, 96].",
    "keywords": [
      "First Year",
      "Calculus",
      "Fundamentals of Computing",
      "General Physics",
      "Mechanics and Heat",
      "NSTP",
      "Fundamental Concepts of Mathematics"
    ]
  },
  {
    "id": "earist_cas_bsmath_year_2_curriculum",
    "source": "EARIST BS Mathematics Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Mathematics)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BS Mathematics program advances into higher calculus and abstract mathematics. The First Semester (21 units) comprises Fundamentals of Computing 2 (COMPLAB2/COMPLEC2), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), General Physics 2/Electricity and Magnetism (GPEAMLAB/GPEAMLEC), Abstract Algebra (MATHABSA), and Calculus 3 (MATHANA3). [cite_start]The Second Semester (23 units) includes Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Physical Activity Towards Health and Fitness II (GEPEHEF2), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Advanced Calculus (MATHADVC), Linear Algebra (MATHLINA), and Probability (MATHPROB)[cite: 102, 105].",
    "keywords": [
      "Second Year",
      "Abstract Algebra",
      "Calculus 3",
      "Advanced Calculus",
      "Linear Algebra",
      "Probability",
      "General Physics 2"
    ]
  },
  {
    "id": "earist_cas_bsmath_year_3_curriculum",
    "source": "EARIST BS Mathematics Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Mathematics)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the EARIST BS Mathematics program focuses on specialized mathematical theories and applications. The First Semester (24 units) includes Automata Theory and Formal Language (AUTOMATA), Differential Equations (DIFFEQUA), The Life and Works of Rizal (GELIFEWR), Graph Theory and Applications (MATHGRAP), Theory of Interest (MATHINTE), Number Theory (MATHNUMT), Statistical Theory (MATHSTAT), and Operations Research (OPERSRES). [cite_start]The Second Semester (21 units) covers The Entrepreneurial Mind (GEELECEM), Actuarial Mathematics (MATHACTU), Mathematical Modeling (MATHMODE), Modern Geometry (MATHMODG), Numerical Analysis (MATHNUMA), Free Elective 1 (MTFELEC1), and Seminar in Thesis Writing (MTTHES11)[cite: 111, 114].",
    "keywords": [
      "Third Year",
      "Differential Equations",
      "Graph Theory",
      "Number Theory",
      "Operations Research",
      "Actuarial Mathematics",
      "Numerical Analysis",
      "Mathematical Modeling"
    ]
  },
  {
    "id": "earist_cas_bsmath_year_4_curriculum",
    "source": "EARIST BS Mathematics Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Mathematics)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the EARIST BS Mathematics program culminates with advanced analysis, thesis completion, and professional internship. The First Semester (18 units) requires Basic Accounting (BASICACC), Filipino sa Iba't ibang Disiplina (GEFILDIS), Complex Analysis (MATHCMPX), Real Analysis (MATHREAL), Free Elective 2 (MTFELEC2), and Thesis Writing (MITHESI2). [cite_start]The Second Semester (9 units) is dedicated entirely to the Practicum/Internship (MTINTERN), which serves as the final requirement for graduation[cite: 121, 124].",
    "keywords": [
      "Fourth Year",
      "Complex Analysis",
      "Real Analysis",
      "Thesis Writing",
      "Practicum",
      "Internship",
      "Basic Accounting"
    ]
  }
]
[
  {
    "id": "earist_coe_bsme_program_overview",
    "source": "EARIST BSME Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Mechanical Engineering)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Engineering, offers the Bachelor of Science in Mechanical Engineering (BSME) program. This curriculum, effective as of June 2018, requires a total of 205 units for completion. The program structure spans four academic years and one summer term, focusing on thermal sciences, machine design, power plant engineering, and industrial processes.",
    "keywords": [
      "EARIST",
      "College of Engineering",
      "Bachelor of Science in Mechanical Engineering",
      "BSME",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_coe_bsme_year_1_curriculum",
    "source": "EARIST BSME Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Mechanical Engineering)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Mechanical Engineering program establishes the mathematical and scientific foundation for engineering. The First Semester (29 units) includes Engineering Drawing 1 (CENDRW 111), Differential Calculus (CENMAT01), Practical Data Science (GEELECDS), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Mechanical Engineering Orientation (MEENG 111), Chemistry for Engineers (NATSCI SP 102), and National Service Training Program 1 (NSTPROG1). The Second Semester (29 units) includes Computer Aided Drafting (CENCADIA), Art Appreciation (GEARTAPP), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), The Life and Works of Rizal (GELIFEWR), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), Calculus II/Integral Calculus (MATH_104), Physics for Engineers/Calculus Based (NATSCI103A), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Calculus",
      "Physics",
      "Chemistry",
      "Engineering Drawing",
      "Mechanical Engineering Orientation",
      "NSTP"
    ]
  },
  {
    "id": "earist_coe_bsme_year_2_curriculum",
    "source": "EARIST BSME Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Mechanical Engineering)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the EARIST BSME program focuses on core engineering mechanics, thermodynamics, and electrical basics. The First Semester (28 units) comprises Computer Fundamentals and Programming (COM SP 211), Basic Electrical Engineering (EEN 211), Living in Information Technology Era (GEELECIT), Ethics (GEETHICS), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Statics of Rigid Bodies (MCH 311), Workshop Theory and Practice (MEN 212), Thermodynamics 1 (MEN 314), and Differential Equations (MM15). The Second Semester (23 units) covers Engineering Management (CVENG316), Basic Electronics (ECENG 222), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness II (GEPEHEF2), Advance Mathematics for ME (MATH 222B), Dynamics of Rigid Bodies (MCH 322), Thermodynamics 2 (MEENG 221), Machine Shop Theory (MEENG 222), and Engineering Data Analysis (MM16).",
    "keywords": [
      "Second Year",
      "Thermodynamics",
      "Statics",
      "Dynamics",
      "Differential Equations",
      "Machine Shop Theory",
      "Basic Electronics",
      "Engineering Management"
    ]
  },
  {
    "id": "earist_coe_bsme_year_3_curriculum",
    "source": "EARIST BSME Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Mechanical Engineering)",
    "topic": "Third Year Coursework and Summer OJT",
    "content": "The Third Year of the EARIST BSME program advances into fluid mechanics, machine elements, and specialized mechanical systems. The First Semester (26 units) includes Engineering Economy (CENENECO), Mechanics of Deformable Bodies (CENMECDB), Fluid Mechanics (FLUIDMEC), Heat Transfer (MEENG312), Machine Elements 1 (MEENG314), Vibration Engineering (MEENG315), Computer Application for ME (MEENG316), M.E Elective 1/Engine Friction and Lub (MEENG317), and DC and AC Machinery (MEMADCAC). The Second Semester (21 units) covers Method of Research for ME (MEENG321), Refrigeration System (MEENG322), Fluid Machineries (MEENG323), Combustion Engineering (MEENG324), Materials Science and Engineering for ME (MEENG325), Mechanical Engineering Lab 1 (MEENG326), M.E Elective 2/Design of Building Piping System (MEENG328), and Machine Elements 2 (MEENG329). The Summer term requires On-the-Job Training (CENOTJOB), consisting of 300 hours for 3 credited units.",
    "keywords": [
      "Third Year",
      "Fluid Mechanics",
      "Heat Transfer",
      "Machine Elements",
      "Refrigeration System",
      "Combustion Engineering",
      "OJT",
      "Mechanical Engineering Lab"
    ]
  },
  {
    "id": "earist_coe_bsme_year_4_curriculum",
    "source": "EARIST BSME Curriculum Checklist (Effective June 2018)",
    "category": "College of Engineering Curriculum (Mechanical Engineering)",
    "topic": "Fourth Year Coursework and Capstone",
    "content": "The Fourth Year of the EARIST BSME program involves complex system design, power plants, and professional practice. The First Semester (23 units) includes Technopreneurship (CENTECNO), Air-Conditioning & Ventilation System (MEENG411), ME Project Study 1 (MEENG412), Machine Design 1 (MEENG413), Mechanical Engineering Lab 2 (MEENG414), Control Engineering (MEENG415), Control Engineering Laboratory (MEENG416), and Power Plant Design with Renewable Energy (MEENG417). The Second Semester (23 units) concludes the degree with Industrial Plant Engineering (MEENG421), ME Project Study 2 (MEENG422), Machine Design 2 (MEENG423), Basic Occupational Safety and Health (MEENG424), Manufacturing & Industrial Processes with Plant Visits (MEENG425), Mechanical Engineering Lab 3 (MEENG426), ME Laws, Ethics, Contracts, Codes and Standard (MEENG427), and M.E. Integrative Course (MEENG428).",
    "keywords": [
      "Fourth Year",
      "Power Plant Design",
      "Machine Design",
      "Industrial Plant Engineering",
      "HVAC",
      "Control Engineering",
      "Project Study",
      "ME Laws"
    ]
  }
]
[
  {
    "id": "earist_ced_bsned_program_overview",
    "source": "EARIST BSNED Curriculum Checklist",
    "category": "College of Education Curriculum (Special Needs Education)",
    "topic": "Program Overview",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, offers the Bachelor of Special Needs Education (Generalist) program. The curriculum is designed to prepare students for teaching learners with developmental, sensory, physical, emotional, and behavioral disabilities through a mix of general education, professional education, and specialized major courses.",
    "keywords": [
      "EARIST",
      "College of Education",
      "Bachelor of Special Needs Education",
      "BSNED",
      "Generalist",
      "Special Education"
    ]
  },
  {
    "id": "earist_ced_bsned_year_1_curriculum",
    "source": "EARIST BSNED Curriculum Checklist",
    "category": "College of Education Curriculum (Special Needs Education)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the Bachelor of Special Needs Education (Generalist) establishes foundations in general education and child development. The First Semester (26 units) includes Living in Information Technology Era (GEELECIT), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), NSTP Literacy Training Service 1 (NSTPLTS1), National Service Training Program 1 (NSTPROG1), and The Child and Adolescent Learners and Learning Principles (PEDCALLP). The Second Semester (26 units) includes Foundations of Special Education (FOSPINED), Art Appreciation (GEARTAPP), Filipino sa Iba't ibang Disiplina (GEFILDIS), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), NSTP Literacy Training Service 2 (NSTPLTS2), and NSTP 2 (NSTPROG2).",
    "keywords": [
      "First Year",
      "Child and Adolescent Learners",
      "Foundations of Special Education",
      "NSTP",
      "General Education",
      "Literacy Training"
    ]
  },
  {
    "id": "earist_ced_bsned_year_2_curriculum",
    "source": "EARIST BSNED Curriculum Checklist",
    "category": "College of Education Curriculum (Special Needs Education)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSNED Generalist program focuses on specific disabilities and professional teaching standards. The First Semester (26 units) comprises Practical Data Science (GEADDPDS), Ethics (GEETHICS), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), The Teacher and The School Curriculum (PEDTSCUR), The Teaching Profession (PEDTTPRO), Learners with Sensory and Physical Disabilities (SNEDLSPD), Learners with Developmental Disabilities (SNEDLWDD), and Learners with Emotional, Behavioral, Language and Communication Disabilities (SNLEBLCD). The Second Semester (26 units) covers Communicative Proficiency in Business Correspondence (GEADCPBR), The Contemporary World (GECONTWO), Physical Activity Towards Health and Fitness II (GEPEHEF2), Facilitating Learner-Centered Teaching (PEDFALCT), The Teacher and the Community/School Culture (PEDTCSOL), Technology for Teaching and Learning 1 (PEDTFTAL), Curriculum and Pedagogy in Inclusive Education (SNEDCPIE), Educational Assessment of Students with Additional Needs (SNEDEASA), and Gifted and Talented Learners (SNEDGTLS).",
    "keywords": [
      "Second Year",
      "Sensory Disabilities",
      "Developmental Disabilities",
      "Behavioral Disabilities",
      "Inclusive Education",
      "Gifted Learners",
      "Educational Assessment"
    ]
  },
  {
    "id": "earist_ced_bsned_year_3_curriculum",
    "source": "EARIST BSNED Curriculum Checklist",
    "category": "College of Education Curriculum (Special Needs Education)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSNED Generalist program advances into instructional adaptations and specialized management strategies. The First Semester (21 units) includes Assessment of Learning 1 (PEDASOL1), Building and Enhancing New Literacies Across the Curriculum (PEDBELAC), Adapted Physical Education and Recreation (SNAPERMH), Behavior Management and Modification (SNEDEMAM), Transition Education (SNEDTRED), Instructional Adaptations in Language and Literacy Instruction (SNINALLI), and Instructional Adaptations in Mathematics and Science Instruction (SNINAMSI). The Second Semester (15 units) covers Assessment of Learning 2 (PEDASOL2), Development of Individualized Education Plans (SNEDDIEP), Early Childhood Inclusive Education (SNEDECIE), Instructional Adaptations for Teaching Content Areas (SNINATCA), and Research in Special Needs and Inclusive Education (SNRESNIE).",
    "keywords": [
      "Third Year",
      "Adapted PE",
      "Behavior Management",
      "Transition Education",
      "Instructional Adaptations",
      "IEP",
      "Early Childhood Inclusive Education"
    ]
  },
  {
    "id": "earist_ced_bsned_year_4_curriculum",
    "source": "EARIST BSNED Curriculum Checklist",
    "category": "College of Education Curriculum (Special Needs Education)",
    "topic": "Fourth Year Coursework",
    "content": "The Fourth Year of the BSNED Generalist program (First Semester) focuses on final competency enhancement and field experience. It includes the Competencies Enhancement Program (PEDCOPRO), which requires the completion of all prior General Education, Professional Education, and Major courses (from First to Third Year) as prerequisites. It also includes Field Study 1 (PEDFSTDY1).",
    "keywords": [
      "Fourth Year",
      "Competencies Enhancement",
      "Field Study 1",
      "Prerequisites",
      "PEDCOPRO"
    ]
  }
]
[
  {
    "id": "earist_cbpa_bsoa_program_overview",
    "source": "EARIST BSOA Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Office Administration)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Business and Public Administration (CBPA), offers the Bachelor of Science in Office Administration (BSOA) program. This curriculum, effective as of June 2018, requires a total of 130 units for completion. The program structure spans four academic years, focusing on administrative skills, shorthand, research, and office management.",
    "keywords": [
      "EARIST",
      "CBPA",
      "Bachelor of Science in Office Administration",
      "BSOA",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cbpa_bsoa_year_1_curriculum",
    "source": "EARIST BSOA Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Office Administration)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Office Administration program establishes foundational office skills. The First Semester (22 units) includes Administrative Office Procedure and Management (ADOPMNGT), Administrative Work Values and Accountability (ADWOVAAC), Foundation of Shorthand (FNDSTENO), Movement Enhancement (GEPEMOVE), Understanding the Self (GEUNDETS), Keyboarding and Documents Processing 1 (KEYDOCPR), and National Service Training Program 1 (NSTPROG1). The Second Semester (23 units) includes Advanced Shorthand (ADVSTENO), The Contemporary World (GECONTWO), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Mathematics in the Modern World (GEMATHMW), Fitness Exercises (GEPEFITE), Readings in Philippine History (GEREADPH), Keyboarding and Documents Processing 2 (KEYDOCPR2), and NSTP 2 (NSTP-CWTS_2).",
    "keywords": [
      "First Year",
      "Shorthand",
      "Keyboarding",
      "Office Procedure",
      "Document Processing",
      "NSTP"
    ]
  },
  {
    "id": "earist_cbpa_bsoa_year_2_curriculum",
    "source": "EARIST BSOA Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Office Administration)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Office Administration program focuses on professional development and communication. The First Semester (17 units) comprises Art Appreciation (GEARTAPP), Filipino sa Iba't ibang Disiplina (GEFILDIS), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Purposive Communication (GEPURPCO), Personal and Professional Development (PRPROFDV), and Speed Transcription (SPDTRANS). The Second Semester (17 units) covers Accounting for Merchandising Industry (ACCOUNT2), Business Report Writing (BUSREPWR), Ethics (GEETHICS), Physical Activity Towards Health and Fitness II (GEPEHEF2), Science and Technology (GESCIENTS), and Office Administration Internship (300 Hours) (OAINTERN).",
    "keywords": [
      "Second Year",
      "Speed Transcription",
      "Professional Development",
      "Business Report Writing",
      "Accounting",
      "Internship"
    ]
  },
  {
    "id": "earist_cbpa_bsoa_year_3_curriculum",
    "source": "EARIST BSOA Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Office Administration)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Office Administration program advances into specialized shorthand and research. The First Semester (15 units) includes The Life and Works of Rizal (GELIFEWR), Integrated Software Applications (INTSOFAP), Fundamentals of Machine Shorthand 1 (MACSHAN1), Internet Research for Business/BR1 (OABUSRS1), and Operations Management/TQM (OPTNMNGT). The Second Semester (15 units) includes Entrepreneurial Behavior (ENBEHAVE), Events Management (EVNTMNGT), Philippine Literature (GEPHILIT), Machine Shorthand 2 (MACSHAN2), and Basic Research/Thesis Writing/BR2 (OABUSRS2).",
    "keywords": [
      "Third Year",
      "Machine Shorthand",
      "Business Research",
      "Thesis Writing",
      "Operations Management",
      "Events Management"
    ]
  },
  {
    "id": "earist_cbpa_bsoa_year_4_curriculum",
    "source": "EARIST BSOA Curriculum Checklist (Effective June 2018)",
    "category": "College of Business and Public Administration Curriculum (Office Administration)",
    "topic": "Fourth Year Coursework and Practicum",
    "content": "The Fourth Year of the BS Office Administration program concludes with legal, strategic, and practical training. The First Semester (15 units) requires Business Law/Obligations & Contract (BUSLWOBL), Customer Relations (CUSTRELA), Income Taxation (INCMTAXN), Project Management (PROJMNGT), and Strategic Management (STRAMNGT). The Second Semester (6 units) is dedicated entirely to Legal/Medical Office Procedure (OAPRACTI), which serves as the final practicum.",
    "keywords": [
      "Fourth Year",
      "Business Law",
      "Income Taxation",
      "Strategic Management",
      "Customer Relations",
      "Practicum",
      "Legal Office Procedure",
      "Medical Office Procedure"
    ]
  }
]
[
  {
    "id": "earist_cas_bspsych_program_overview",
    "source": "EARIST BS Psychology Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Psychology)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Arts and Sciences (CAS), offers the Bachelor of Science in Psychology program. This curriculum, effective as of June 2018, requires a total of 173 units for completion. The program is designed to provide students with a comprehensive understanding of psychological theories, research methods, and practical applications across four academic years.",
    "keywords": [
      "EARIST",
      "CAS",
      "Bachelor of Science in Psychology",
      "BS Psych",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_cas_bspsych_year_1_curriculum",
    "source": "EARIST BS Psychology Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Psychology)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BS Psychology program establishes the biological and theoretical foundations of the discipline. The First Semester (25 units) includes Biological Science Laboratory and Lecture (BIOSCLAB/BIOSCLEC), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), Introduction to Psychology (INTROPSY), and National Service Training Program 1 (NSTPROG1). The Second Semester (36 units) includes Anatomy and Physiology Laboratory and Lecture (ANAPYLAB/ANAPYLEC), Art Appreciation (GEARTAPP), Mathematics in the Modern World (GEMATHMW), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), NSTP 2 (NSTP-CWTS_2), and Psychological Statistics (PSYCSTAT), which is a 5-unit course.",
    "keywords": [
      "First Year",
      "Biological Science",
      "Anatomy and Physiology",
      "Introduction to Psychology",
      "Psychological Statistics",
      "NSTP",
      "General Education"
    ]
  },
  {
    "id": "earist_cas_bspsych_year_2_curriculum",
    "source": "EARIST BS Psychology Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Psychology)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BS Psychology program focuses on developmental processes, experimental methods, and physiological bases of behavior. The First Semester (20 units) comprises Biochemistry Laboratory and Lecture (BIOCHLAB/BIOCHLEC), Developmental Psychology (DEVPSYCH), Practical Data Science (GEELECDS), Living in Information Technology Era (GEELECIT), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Sinesosyedad/Pelikulang Panlipunan (GESINEPP), and Physiological Psychology (PHYPSYCH). The Second Semester (21 units) covers Experimental Psychology Laboratory and Lecture (EXPSYLAB/EXPSYLEC), The Contemporary World (GECONTWO), Communicative Proficiency in Business Correspondence (GEELECCP), Physical Activity Towards Health and Fitness II (GEPEHEF2), Physics for Psychology Students Laboratory and Lecture (PHYPSYLB/PHYPSYLC), and Theories of Personality (THEOPERS).",
    "keywords": [
      "Second Year",
      "Biochemistry",
      "Developmental Psychology",
      "Physiological Psychology",
      "Experimental Psychology",
      "Physics for Psychology",
      "Theories of Personality"
    ]
  },
  {
    "id": "earist_cas_bspsych_year_3_curriculum",
    "source": "EARIST BS Psychology Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Psychology)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BS Psychology program advances into specialized fields and research methodology. The First Semester (20 units) includes Abnormal Psychology (ABNPSYCH), Cognitive Psychology (COGPSYCH), Field Methods Laboratory and Lecture (FLDMETLB/FLDMETLC), Ethics (GEETHICS), Industrial Organizational Psychology (INDPSYCH), and Social Psychology (SOCPSYCH). The Second Semester (23 units) covers The Life and Works of Rizal (GELIFEWR), Human Behavior in Organizations (HUMBEORG), Labor Laws and Labor Relations (LABORLAW), Disaster and Mental Health (MNTLHLTH), Psychological Assessment Laboratory and Lecture (PSYASSLB/PSYASSLC), Research in Psychology I (PSYTHES1), and Sikolohiyang Pilipino (SIKOLPIL).",
    "keywords": [
      "Third Year",
      "Abnormal Psychology",
      "Cognitive Psychology",
      "Industrial Organizational Psychology",
      "Psychological Assessment",
      "Research in Psychology",
      "Sikolohiyang Pilipino"
    ]
  },
  {
    "id": "earist_cas_bspsych_year_4_curriculum",
    "source": "EARIST BS Psychology Curriculum Checklist (Effective June 2018)",
    "category": "College of Arts and Sciences Curriculum (Psychology)",
    "topic": "Fourth Year Coursework and Practicum",
    "content": "The Fourth Year of the BS Psychology program concludes the degree with advanced electives, research completion, and professional internship. The First Semester (18 units) includes Panitikan sa Pilipinas (GEPANIPI), Open Elective (OPENELEC), Organizational Development (ORGLDVMT), Positive Psychology (POSPSYCH), Research in Psychology II (PSYTHES2), and Strategic Human Resource Management (STRATHRM). The Second Semester (10 units) is dedicated to the Integrative Course in Psychology/Review Class (ICOPSYCH) and Practicum/Internship (PSYCHOJT), which carries 6 credited units.",
    "keywords": [
      "Fourth Year",
      "Organizational Development",
      "Positive Psychology",
      "Research in Psychology",
      "Practicum",
      "Internship",
      "Integrative Course",
      "Review Class"
    ]
  }
]
[
  {
    "id": "earist_chtm_bstm_program_overview",
    "source": "EARIST BSTM Curriculum Checklist (Effective June 2018)",
    "category": "College of Hospitality and Tourism Management Curriculum (Tourism Management)",
    "topic": "Program Overview",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Hospitality and Tourism Management (CHTM), offers the Bachelor of Science in Tourism Management (BSTM) program. This curriculum, effective as of June 2018, is structured to provide students with comprehensive knowledge in tourism operations, management, and sustainability over the course of four academic years.",
    "keywords": [
      "EARIST",
      "CHTM",
      "Bachelor of Science in Tourism Management",
      "BSTM",
      "Tourism",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_chtm_bstm_year_1_curriculum",
    "source": "EARIST BSTM Curriculum Checklist (Effective June 2018)",
    "category": "College of Hospitality and Tourism Management Curriculum (Tourism Management)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BSTM program establishes the foundation for tourism studies and general education. The First Semester (23 units) includes Living in Information Technology Era (GEELECIT), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), Movement Enhancement (GEPEMOVE), Understanding the Self (GEUNDETS), National Service Training Program 1 (NSTPROG1), Macro Perspective of Tourism and Hospitality (THCMACPR), Risk Management as Applied to Safety, Security and Sanitation (THCRISKM), and Sustainable Tourism (TPCSUSTO). The Second Semester (38 units) includes Mathematics in the Modern World (GEMATHMW), Panitikan sa Pilipinas (GEPANIPI), Fitness Exercises (GEPEFITE), Science, Technology and Society (GESCIETS), NSTP 2 (NSTPROG2), Micro Perspective of Tourism and Hospitality (THCMICPR), Quality Service Management in Tourism and Hospitality (THCQUASM), Global Culture and Tourism Geography (TPCGLCTG), and Recreational and Leisure Management (TPECRELM).",
    "keywords": [
      "First Year",
      "Sustainable Tourism",
      "Risk Management",
      "Macro Perspective",
      "Micro Perspective",
      "Global Culture",
      "Tourism Geography",
      "NSTP"
    ]
  },
  {
    "id": "earist_chtm_bstm_year_2_curriculum",
    "source": "EARIST BSTM Curriculum Checklist (Effective June 2018)",
    "category": "College of Hospitality and Tourism Management Curriculum (Tourism Management)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BSTM program focuses on specialized tourism management and operations. The First Semester (23 units) comprises Physical Activity Towards Health and Fitness 1 (GEPEHEF1), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Philippine Culture and Tourism Geography (THCPHCTG), Tour and Travel Management (TPCTTMGT), Eco Tourism Management (TPECECTM), Specialized Food and Beverage Service Operations (TPECSFBS), and Tourism Information Management (TPECTINM). The Second Semester (23 units) includes Operations Management in Tourism and Hospitality (BMECOPMN), World Literature and Humanities (GEADWOLH), The Contemporary World (GECONTWO), Physical Activity Towards Health and Fitness II (GEPEHEF2), Entrepreneurship in Tourism and Hospitality (THCENTRE), Legal Aspects in Tourism and Hospitality (THCLEGAS), Transportation Management (TPCTRANM), and The Ethics of Tour Guiding and Escorting (TPECETGE).",
    "keywords": [
      "Second Year",
      "Tour and Travel Management",
      "Eco Tourism",
      "Transportation Management",
      "Tour Guiding Ethics",
      "Tourism Information Management",
      "Philippine Culture"
    ]
  },
  {
    "id": "earist_chtm_bstm_year_3_curriculum",
    "source": "EARIST BSTM Curriculum Checklist (Effective June 2018)",
    "category": "College of Hospitality and Tourism Management Curriculum (Tourism Management)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BSTM program emphasizes research, marketing, and specialized tourism sectors. The First Semester (24 units) includes Practical Data Science (GEELECDS), Ethics (GEETHICS), Tourism and Hospitality Marketing (THCMARKT), Multicultural Diversity in Workplace for the Tourism Professional (THCMULDI), Foreign Language 1 (THPCFLA1), Introduction to MICE Management (THPCMICE), Research in Tourism 1 (TPCREST1), and Tourism Policy Planning and Development (TPCTPPAD). The Second Semester (24 units) covers Art Appreciation (GEARTAPP), Professional Development and Applied Ethics (THCPDAET), Applied Business Tools and Technologies (THPCABTT), Foreign Language 2 (THPCFLA2), Research in Tourism 2 (TPCREST2), Cruise Tourism (TPECCRTO), Destination Management and Marketing (TPECDESM), and Tourism Product Development (TPECTPRD).",
    "keywords": [
      "Third Year",
      "Tourism Marketing",
      "MICE Management",
      "Research in Tourism",
      "Cruise Tourism",
      "Destination Management",
      "Tourism Policy",
      "Foreign Language"
    ]
  },
  {
    "id": "earist_chtm_bstm_year_4_curriculum",
    "source": "EARIST BSTM Curriculum Checklist (Effective June 2018)",
    "category": "College of Hospitality and Tourism Management Curriculum (Tourism Management)",
    "topic": "Fourth Year Coursework and Practicum",
    "content": "The Fourth Year of the BSTM program concludes with strategic management and industry practicum. The First Semester (15 units) includes Strategic Management and Total Quality Management (BMECSTQM), The Life and Works of Rizal (GELIFEWR), Accommodation Operations and Management (TPECACOM), Philippine Gastronomical Tourism (TPECPHGT), and Travel Writing and Photography (TPECTWAP). The Second Semester (6 units) is dedicated entirely to the Tourism Practicum (TPCTORPR), which requires 600 hours of training in Transportation, Tourism Offices, Travel Agencies, or Airports. This practicum has extensive prerequisites covering major subjects from the first three years.",
    "keywords": [
      "Fourth Year",
      "Practicum",
      "Internship",
      "Accommodation Operations",
      "Gastronomical Tourism",
      "Travel Writing",
      "Strategic Management",
      "600 Hours"
    ]
  }
]
[
  {
    "id": "earist_ced_btled_he_program_overview",
    "source": "EARIST BTLED-HE Curriculum Checklist",
    "category": "College of Education Curriculum (Home Economics)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, offers the Bachelor of Technology and Livelihood Education (BTLED) program with a specialization in Home Economics. The curriculum integrates general education, professional education, and major courses in home economics, industrial arts, and agri-fishery arts to prepare students for teaching and livelihood instruction.",
    "keywords": [
      "EARIST",
      "College of Education",
      "Bachelor of Technology and Livelihood Education",
      "BTLED",
      "Home Economics",
      "HE"
    ]
  },
  {
    "id": "earist_ced_btled_he_year_1_curriculum",
    "source": "EARIST BTLED-HE Curriculum Checklist",
    "category": "College of Education Curriculum (Home Economics)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BTLED Home Economics program establishes foundations in general education and basic TLE concepts. The First Semester (32 units) includes Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), NSTP Literacy Training Service 1 (NSTPLTS1), National Service Training Program 1 (NSTPROG1), Home Economics Literacy (TLEEXHEL), Introduction to ICT I (TLEEXITY), and Consumer Education (TLEHECED). The Second Semester (32 units) includes Living in Information Technology Era (GEELECIT), Filipino sa Iba't ibang Disiplina (GEFILDIS), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), NSTP Literacy Training Service 2 (NSTPLTS2), NSTP 2 (NSTPROG2), Entrepreneurship (TLEEXENT), Family and Consumer Life Skills (TLEEXFCL), and Introduction to ICT II (TLEEXIT2).",
    "keywords": [
      "First Year",
      "Home Economics Literacy",
      "Consumer Education",
      "ICT",
      "Entrepreneurship",
      "Family Life Skills",
      "NSTP"
    ]
  },
  {
    "id": "earist_ced_btled_he_year_2_curriculum",
    "source": "EARIST BTLED-HE Curriculum Checklist",
    "category": "College of Education Curriculum (Home Economics)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BTLED Home Economics program broadens into agri-fishery, industrial arts, and food service management. The First Semester (29 units) comprises Communicative Proficiency in Business Correspondence (GEADCPBR), The Contemporary World (GECONTWO), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), The Child and Adolescent Learners and Learning Principles (PEDCALLP), The Teaching Profession (PEDTTPRO), Introduction to Agri-Fishery Arts 1 (TLEEXAF1), Introduction to Industrial Arts I (TLEEXIA1), Household Resource Management (TLEHEHRM), and Principles of Food Preparation (TLEHEPFP). The Second Semester (29 units) covers Practical Data Science (GEADDPDS), Ethics (GEETHICS), Physical Activity Towards Health and Fitness II (GEPEHEF2), The Teacher and the Community/School Culture (PEDTCSPT), Technology for Teaching and Learning 1 (PEDTFTAL), Introduction to Agri-Fishery Arts II (TLEEXAF2), Introduction to Industrial Arts II (TLEEXIA2), Bread and Pastry Arts (TLEHEBPA), Food and Nutrition (TLEHEFAN), and School Food Service Management (TLEHESFM).",
    "keywords": [
      "Second Year",
      "Agri-Fishery Arts",
      "Industrial Arts",
      "Food Preparation",
      "Bread and Pastry",
      "School Food Service",
      "Household Resource Management"
    ]
  },
  {
    "id": "earist_ced_btled_he_year_3_curriculum",
    "source": "EARIST BTLED-HE Curriculum Checklist",
    "category": "College of Education Curriculum (Home Economics)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BTLED Home Economics program focuses on specialized home economics skills, research, and pedagogy. The First Semester (27 units) includes Assessment of Learning 1 (PEDASLT1), Facilitating Learner-Centered Teaching (PEDFLTM1), Foundation of Special and Inclusive Education (PEDFOSIE), Research I: Research In Home Economics 1 (RESINHE1), Technology for Teaching & Learning 2/TLE (TLEEXTTL), Arts in Daily Living (TLEHEADL), Child and Adolescent Development (TLEHECAD), Clothing Selection, Purchase & Care (TLEHECSP), and Fundamentals of Food Technology (TLEHEFFT). The Second Semester (24 units) covers Assessment of Learning 2 w/ Focus on Trainer's Methodology (PEDAL2TM), Building and Enhancing New Literacies Across the Curriculum (PEDBELAC), Curriculum Development and Evaluation (PEDCDTM2), Research II: Research in Home Economics II (RESINHE2), Beauty Care with Health & Wellness (TLEHEBCH), Clothing Construction (TLEHECCD), Crafts Design/Handicrafts (TLEHECDH), and Marriage and Family Relationships (TLEHEMFR).",
    "keywords": [
      "Third Year",
      "Research in Home Economics",
      "Clothing Construction",
      "Beauty Care",
      "Crafts Design",
      "Food Technology",
      "Assessment of Learning"
    ]
  },
  {
    "id": "earist_ced_btled_he_year_4_curriculum",
    "source": "EARIST BTLED-HE Curriculum Checklist",
    "category": "College of Education Curriculum (Home Economics)",
    "topic": "Fourth Year Coursework",
    "content": "The Fourth Year of the BTLED Home Economics program (First Semester) focuses on field study and competency enhancement. Courses include Competencies Enhancement Program (PEDCOPRO) and Field Study 1 (PEDFSTDY1). The Field Study 1 course requires the completion of all major and professional education courses from the previous three years as prerequisites, including Assessment of Learning, Curriculum Development, and various specialized TLE subjects.",
    "keywords": [
      "Fourth Year",
      "Field Study",
      "Competencies Enhancement",
      "Prerequisites",
      "PEDCOPRO"
    ]
  }
]
[
  {
    "id": "earist_ced_btled_ia_program_overview",
    "source": "EARIST BTLED-IA Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (Industrial Arts)",
    "topic": "Program Overview and Summary",
    "content": "The Eulogio 'Amang' Rodriguez Institute of Science and Technology (EARIST), through the College of Education, offers the Bachelor of Technology and Livelihood Education (BTLED) program with a specialization in Industrial Arts. This curriculum, effective as of June 2018, requires a total of 188 units for completion. The program is designed to equip future educators with technical skills in industrial arts, pedagogical knowledge, and research capabilities.",
    "keywords": [
      "EARIST",
      "College of Education",
      "Bachelor of Technology and Livelihood Education",
      "BTLED",
      "Industrial Arts",
      "IA",
      "Total Units",
      "Curriculum Effectivity"
    ]
  },
  {
    "id": "earist_ced_btled_ia_year_1_curriculum",
    "source": "EARIST BTLED-IA Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (Industrial Arts)",
    "topic": "First Year Coursework",
    "content": "The First Year curriculum for the BTLED Industrial Arts program establishes foundations in general education and basic technology concepts. The First Semester (32 units) includes Art Appreciation (GEARTAPP), Kontekstwalisadong Komunikasyon sa Filipino (GEKOMFIL), The Life and Works of Rizal (GELIFEWR), Mathematics in the Modern World (GEMATHMW), Movement Enhancement (GEPEMOVE), Science, Technology and Society (GESCIETS), NSTP Literacy Training Service 1 (NSTPLTS1), National Service Training Program 1 (NSTPROG1), Home Economics Literacy (TLEEXHEL), Introduction to ICT I (TLEEXITI), and Graphic Arts (TLEIAGHA). The Second Semester (35 units) includes Living in Information Technology Era (GEELECIT), Filipino sa Iba't ibang Disiplina (GEFILDIS), Fitness Exercises (GEPEFITE), Purposive Communication (GEPURPCO), Readings in Philippine History (GEREADPH), Understanding the Self (GEUNDETS), NSTP Literacy Training Service 2 (NSTPLTS2), NSTP 2 (NSTPROG2), Entrepreneurship (TLEEXENT), Family and Consumer Life Skills (TLEEXFCL), and Introduction to ICT II (TLEEXIT2).",
    "keywords": [
      "First Year",
      "Graphic Arts",
      "ICT",
      "Home Economics Literacy",
      "Entrepreneurship",
      "General Education",
      "NSTP"
    ]
  },
  {
    "id": "earist_ced_btled_ia_year_2_curriculum",
    "source": "EARIST BTLED-IA Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (Industrial Arts)",
    "topic": "Second Year Coursework",
    "content": "The Second Year of the BTLED Industrial Arts program introduces specialized industrial and automotive technologies. The First Semester (29 units) comprises Communicative Proficiency in Business Correspondence (GEADCPBR), The Contemporary World (GECONTWO), Panitikan sa Pilipinas (GEPANIPI), Physical Activity Towards Health and Fitness 1 (GEPEHEF1), The Child and Adolescent Learners and Learning Principles (PEDCALLP), The Teaching Profession (PEDTTPRO), Introduction to Agri-Fishery Arts 1 (TLEEXAF1), Introduction to Industrial Arts I (TLEEXIA1), Civil Technology I (TLEIACT1), and Fundamentals of Automotive Technology (TLEIAFAT). The Second Semester (26 units) covers Practical Data Science (GEADDPDS), Ethics (GEETHICS), Physical Activity Towards Health and Fitness II (GEPEHEF2), The Teacher and the Community/School Culture (PEDTCSPT), Technology for Teaching and Learning 1 (PEDTFTAL), Introduction to Agri-Fishery Arts II (TLEEXAF2), Introduction to Industrial Arts II (TLEEXIA2), Applied Automotive Technology (TLEIAAAT), and Civil Technology II (TLEIACT2).",
    "keywords": [
      "Second Year",
      "Civil Technology",
      "Automotive Technology",
      "Industrial Arts",
      "Agri-Fishery Arts",
      "Teaching Profession"
    ]
  },
  {
    "id": "earist_ced_btled_ia_year_3_curriculum",
    "source": "EARIST BTLED-IA Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (Industrial Arts)",
    "topic": "Third Year Coursework",
    "content": "The Third Year of the BTLED Industrial Arts program focuses on electrical, electronics, and refrigeration technologies alongside research. The First Semester (27 units) includes Assessment of Learning 1 (PEDASLT1), Facilitating Learner-Centered Teaching (PEDFLTM1), Foundation of Special and Inclusive Education (PEDFOSIE), Research I: Research In Industrial Arts 1 (RESINIA1), Technology for Teaching & Learning 2/TLE (TLEEXTTL), Domestic Refrigeration and Air-Conditioning (TLEIADRA), Fundamentals of Electronics Technology (TLEIAFEE), Fundamentals of Electrical Technology (TLEIAFET), and Metal Works (TLEIAMWS). The Second Semester (24 units) covers Assessment of Learning 2 w/ Focus on Trainer's Methodology (PEDAL2TM), Building and Enhancing New Literacies Across the Curriculum (PEDBELAC), Curriculum Development and Evaluation (PEDCDTM2), Research II: Research in Industrial Arts II (RESINIA2), Applied Electrical Technology (TLEIAAET), Crafts Design/Handicraft (TLEIACDH), Commercial Refrigeration and Air-Conditioning (TLEIACRA), and Digital Electronics Technology (TLEIADET).",
    "keywords": [
      "Third Year",
      "Refrigeration and Air-Conditioning",
      "Electronics Technology",
      "Electrical Technology",
      "Metal Works",
      "Research in Industrial Arts",
      "Digital Electronics"
    ]
  },
  {
    "id": "earist_ced_btled_ia_year_4_curriculum",
    "source": "EARIST BTLED-IA Curriculum Checklist (Effective June 2018)",
    "category": "College of Education Curriculum (Industrial Arts)",
    "topic": "Fourth Year Coursework and Internship",
    "content": "The Fourth Year of the BTLED Industrial Arts program is dedicated to field study and teaching internship. The First Semester (9 units) includes Competencies Enhancement Program (PEDCOPRO), Field Study 1 (PEDFSTDY1), and Field Study 2 (PEDFSTDY2). The Second Semester (6 units) consists entirely of the Teaching Internship (PEDNTERN).",
    "keywords": [
      "Fourth Year",
      "Field Study",
      "Teaching Internship",
      "Competencies Enhancement",
      "Practicum"
    ]
  }
]