[
  {
    "id": "admission_reqs_2025_tech_eng_design_official",
    "source": "EARIST Admission Posters A.Y. 2025-2026 & Social Media Directory",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "Admission Requirements and Official Facebook Pages for Engineering, Computing, Industrial Tech, and Architecture (CEN, CCS, CIT, CAFA)",
    "content": "According to the EARIST Admission Posters for Academic Year 2025-2026, the University has established specific grade requirements and designated official social media channels for its technical colleges.\n\nFor the College of Engineering (CEN), which includes BS Chemical, Electrical, Civil, Mechanical, Computer, and Electronics Engineering, applicants need a GWA of 90% and no grade lower than 88. The official Facebook page for CEN is https://www.facebook.com/profile.php?id=61575803500947.\n\nFor the College of Computing Studies (CCS), offering BS Computer Science and BS Info Tech, applicants need a GWA of 90% and no grade lower than 80. The official Facebook page for CCS is https://www.facebook.com/profile.php?id=61560553803457.\n\nFor the College of Architecture and Fine Arts (CAFA), Architecture and Interior Design applicants need a GWA of 90% (no grade lower than 85), while Fine Arts requires a GWA of 85%. The official Facebook page for CAFA is https://www.facebook.com/cafaearistofficial.\n\nFor the College of Industrial Technology (CIT), covering all industrial technology majors, applicants must have no grades lower than 80. The official Facebook page for CIT is https://www.facebook.com/profile.php?id=100076321872710&sk=about.",
    "keywords": [
      "CEN Facebook page",
      "CCS Facebook page",
      "CAFA Facebook page",
      "CIT Facebook page",
      "Official social media",
      "Engineering admission",
      "Architecture requirements"
    ]
  },
  {
    "id": "admission_reqs_2025_business_arts_service_official",
    "source": "EARIST Admission Posters A.Y. 2025-2026 & Social Media Directory",
    "category": "Admission Requirements A.Y. 2025-2026",
    "topic": "Admission Requirements and Official Facebook Pages for Business, Arts, Education, Criminology, and Hospitality (CBPA, CAS, CED, CCJE, CHTM)",
    "content": "According to the EARIST Admission Posters for Academic Year 2025-2026, the University has updated the admission criteria and contact channels for business and service programs.\n\nFor the College of Business and Public Administration (CBPA), offering Entrepreneurship, Public Admin, and Business Admin, applicants need a GWA of 90% and no grade lower than 80. The official Facebook page for CBPA is https://www.facebook.com/earist.cbpa.\n\nFor the College of Criminal Justice Education (CCJE), offering BS Criminology, applicants need a GWA of 90% (no grade lower than 85) and must meet height requirements. The official Facebook page for CCJE is https://www.facebook.com/EARIST.CCJE.\n\nFor the College of Hospitality and Tourism Management (CHTM), offering Tourism and Hospitality Management, applicants need a GWA of 85% (no grade lower than 80) and must meet height requirements. The official Facebook page for CHTM is https://www.facebook.com/CHTMOfficial.\n\nFor the College of Arts and Sciences (CAS), Psychology applicants need a GWA of 90%, while Math and Physics applicants need no grade lower than 80. The official Facebook page for CAS is https://www.facebook.com/amazingcas.\n\nFor the College of Education (CED), offering Secondary Ed, Special Needs Ed, and BTLEd, applicants must have no grades lower than 80. The official Facebook page for CED is https://www.facebook.com/EARIST.CED.Official.",
    "keywords": [
      "CBPA Facebook page",
      "CCJE Facebook page",
      "CHTM Facebook page",
      "CAS Facebook page",
      "CED Facebook page",
      "Business Administration admission",
      "Criminology requirements"
    ]
  }
]